[Survived] BlockStatement
src/accounts/__mocks__/accounts.queries.ts:12:64
 
 export const __setDbData = db.__setDbData;
 
-export async function getUserById(id: number): Promise<User[]> {
-  return await db.selectMany((user) => user.id === id);
-}
+export async function getUserById(id: number): Promise<User[]> {}
 
 export async function getUserByEmail(email: string): Promise<User[]> {

[Survived] ConditionalExpression
src/accounts/__mocks__/accounts.queries.ts:13:40
 export const __setDbData = db.__setDbData;
 
 export async function getUserById(id: number): Promise<User[]> {
-  return await db.selectMany((user) => user.id === id);
+  return await db.selectMany((user) => false);
 }
 

[Survived] ConditionalExpression
src/accounts/__mocks__/accounts.queries.ts:13:40
 export const __setDbData = db.__setDbData;
 
 export async function getUserById(id: number): Promise<User[]> {
-  return await db.selectMany((user) => user.id === id);
+  return await db.selectMany((user) => true);
 }
 

[Survived] BlockStatement
src/accounts/__mocks__/accounts.queries.ts:16:70
   return await db.selectMany((user) => user.id === id);
 }
 
-export async function getUserByEmail(email: string): Promise<User[]> {
-  return await db.selectMany((user) => user.email === email);
-}
+export async function getUserByEmail(email: string): Promise<User[]> {}
 
 export async function insertNewUser(user: HashedCredentials & UserData): Promise<UserId> {

[Survived] EqualityOperator
src/accounts/__mocks__/accounts.queries.ts:17:40
 }
 
 export async function getUserByEmail(email: string): Promise<User[]> {
-  return await db.selectMany((user) => user.email === email);
+  return await db.selectMany((user) => user.email !== email);
 }
 

[Survived] ConditionalExpression
src/accounts/__mocks__/accounts.queries.ts:17:40
 }
 
 export async function getUserByEmail(email: string): Promise<User[]> {
-  return await db.selectMany((user) => user.email === email);
+  return await db.selectMany((user) => true);
 }
 

[Survived] BlockStatement
src/accounts/__mocks__/accounts.queries.ts:20:90
   return await db.selectMany((user) => user.email === email);
 }
 
-export async function insertNewUser(user: HashedCredentials & UserData): Promise<UserId> {
-  const id = await db.insert(user);
-  return { id };
-}
+export async function insertNewUser(user: HashedCredentials & UserData): Promise<UserId> {}
 
 export const deleteUserById = db.delete;
