[Killed] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:12:102
 
 const jwtConfig: JwtConfig = config.get('tokens');
 
-const setTokens = (ctx: Koa.Context, tokens: { accessToken: string, refreshToken: string }): void => {
-  const { accessToken, refreshToken } = tokens;
-  ctx.cookies.set('accessToken', accessToken, { maxAge: jwtConfig.accessExpiresIn });
-  ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
-};
+const setTokens = (ctx: Koa.Context, tokens: { accessToken: string, refreshToken: string }): void => {};
 
 const processingRefreshToken = (refreshToken: string): Koa.Middleware => async(ctx, next) => {

[Killed] ObjectLiteral
Pichupido/src/middlewares/checkAuth.ts:15:49
 const setTokens = (ctx: Koa.Context, tokens: { accessToken: string, refreshToken: string }): void => {
   const { accessToken, refreshToken } = tokens;
   ctx.cookies.set('accessToken', accessToken, { maxAge: jwtConfig.accessExpiresIn });
-  ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
+  ctx.cookies.set('refreshToken', refreshToken, {});
 };
 

[Killed] ArrowFunction
Pichupido/src/middlewares/checkAuth.ts:18:32
   ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
 };
 
-const processingRefreshToken = (refreshToken: string): Koa.Middleware => async(ctx, next) => {
-  if (!refreshToken) {
-    return ctx.throw(401, 'Tokens expired, please log in again');
-  }
-  let payload: RefreshToken;
-  try {
-    payload = jwt.verify(refreshToken, jwtConfig.refreshSecret) as RefreshToken;
-    if (payload.type !== 'refresh') {
-      return ctx.throw(400, 'Invalid token, please log in again');
-    }
-  } catch (e) {
-    return ctx.throw(400, 'Invalid token, please log in again');
-  }
-  const tokens = await createAndUpdateTokens(payload.userId);
-  ctx.state.tokens = tokens;
-  setTokens(ctx as Koa.Context, tokens);
-  return next();
-};
+const processingRefreshToken = () => undefined;
 
 const checkAuth: Middleware = async (ctx, next) => {

[Killed] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:18:94
   ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
 };
 
-const processingRefreshToken = (refreshToken: string): Koa.Middleware => async(ctx, next) => {
-  if (!refreshToken) {
-    return ctx.throw(401, 'Tokens expired, please log in again');
-  }
-  let payload: RefreshToken;
-  try {
-    payload = jwt.verify(refreshToken, jwtConfig.refreshSecret) as RefreshToken;
-    if (payload.type !== 'refresh') {
-      return ctx.throw(400, 'Invalid token, please log in again');
-    }
-  } catch (e) {
-    return ctx.throw(400, 'Invalid token, please log in again');
-  }
-  const tokens = await createAndUpdateTokens(payload.userId);
-  ctx.state.tokens = tokens;
-  setTokens(ctx as Koa.Context, tokens);
-  return next();
-};
+const processingRefreshToken = (refreshToken: string): Koa.Middleware => async(ctx, next) => {};
 
 const checkAuth: Middleware = async (ctx, next) => {

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:19:7
 };
 
 const processingRefreshToken = (refreshToken: string): Koa.Middleware => async(ctx, next) => {
-  if (!refreshToken) {
+  if (false) {
     return ctx.throw(401, 'Tokens expired, please log in again');
   }

[Killed] BooleanLiteral
Pichupido/src/middlewares/checkAuth.ts:19:7
 };
 
 const processingRefreshToken = (refreshToken: string): Koa.Middleware => async(ctx, next) => {
-  if (!refreshToken) {
+  if (refreshToken) {
     return ctx.throw(401, 'Tokens expired, please log in again');
   }

[Killed] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:23:7
     return ctx.throw(401, 'Tokens expired, please log in again');
   }
   let payload: RefreshToken;
-  try {
-    payload = jwt.verify(refreshToken, jwtConfig.refreshSecret) as RefreshToken;
-    if (payload.type !== 'refresh') {
-      return ctx.throw(400, 'Invalid token, please log in again');
-    }
-  } catch (e) {
+  try {} catch (e) {
     return ctx.throw(400, 'Invalid token, please log in again');
   }

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:25:9
   let payload: RefreshToken;
   try {
     payload = jwt.verify(refreshToken, jwtConfig.refreshSecret) as RefreshToken;
-    if (payload.type !== 'refresh') {
+    if (true) {
       return ctx.throw(400, 'Invalid token, please log in again');
     }

[Killed] EqualityOperator
Pichupido/src/middlewares/checkAuth.ts:25:9
   let payload: RefreshToken;
   try {
     payload = jwt.verify(refreshToken, jwtConfig.refreshSecret) as RefreshToken;
-    if (payload.type !== 'refresh') {
+    if (payload.type === 'refresh') {
       return ctx.throw(400, 'Invalid token, please log in again');
     }

[Killed] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:28:15
     if (payload.type !== 'refresh') {
       return ctx.throw(400, 'Invalid token, please log in again');
     }
-  } catch (e) {
-    return ctx.throw(400, 'Invalid token, please log in again');
-  }
+  } catch (e) {}
   const tokens = await createAndUpdateTokens(payload.userId);
   ctx.state.tokens = tokens;

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:38:7
 };
 
 const checkAuth: Middleware = async (ctx, next) => {
-  if (!ctx.cookies) {
+  if (true) {
     return ctx.throw(400, 'Unauthorized');
   }

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:38:7
 };
 
 const checkAuth: Middleware = async (ctx, next) => {
-  if (!ctx.cookies) {
+  if (false) {
     return ctx.throw(400, 'Unauthorized');
   }

[Killed] LogicalOperator
Pichupido/src/middlewares/checkAuth.ts:41:23
   if (!ctx.cookies) {
     return ctx.throw(400, 'Unauthorized');
   }
-  const accessToken = ctx.cookies.get('accessToken') || ctx.request.headers.accesstoken;
+  const accessToken = ctx.cookies.get('accessToken') && ctx.request.headers.accesstoken;
   const refreshToken = ctx.cookies.get('refreshToken') || ctx.request.headers.refreshtoken;
   if (!accessToken) {

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:41:23
   if (!ctx.cookies) {
     return ctx.throw(400, 'Unauthorized');
   }
-  const accessToken = ctx.cookies.get('accessToken') || ctx.request.headers.accesstoken;
+  const accessToken = true;
   const refreshToken = ctx.cookies.get('refreshToken') || ctx.request.headers.refreshtoken;
   if (!accessToken) {

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:42:24
     return ctx.throw(400, 'Unauthorized');
   }
   const accessToken = ctx.cookies.get('accessToken') || ctx.request.headers.accesstoken;
-  const refreshToken = ctx.cookies.get('refreshToken') || ctx.request.headers.refreshtoken;
+  const refreshToken = false;
   if (!accessToken) {
     return processingRefreshToken(refreshToken)(ctx, next);

[Killed] LogicalOperator
Pichupido/src/middlewares/checkAuth.ts:42:24
     return ctx.throw(400, 'Unauthorized');
   }
   const accessToken = ctx.cookies.get('accessToken') || ctx.request.headers.accesstoken;
-  const refreshToken = ctx.cookies.get('refreshToken') || ctx.request.headers.refreshtoken;
+  const refreshToken = ctx.cookies.get('refreshToken') && ctx.request.headers.refreshtoken;
   if (!accessToken) {
     return processingRefreshToken(refreshToken)(ctx, next);

[Killed] BooleanLiteral
Pichupido/src/middlewares/checkAuth.ts:43:7
   }
   const accessToken = ctx.cookies.get('accessToken') || ctx.request.headers.accesstoken;
   const refreshToken = ctx.cookies.get('refreshToken') || ctx.request.headers.refreshtoken;
-  if (!accessToken) {
+  if (accessToken) {
     return processingRefreshToken(refreshToken)(ctx, next);
   }

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:43:7
   }
   const accessToken = ctx.cookies.get('accessToken') || ctx.request.headers.accesstoken;
   const refreshToken = ctx.cookies.get('refreshToken') || ctx.request.headers.refreshtoken;
-  if (!accessToken) {
+  if (false) {
     return processingRefreshToken(refreshToken)(ctx, next);
   }

[Killed] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:47:7
     return processingRefreshToken(refreshToken)(ctx, next);
   }
   let payload: AccessToken;
-  try {
-    payload = jwt.verify(accessToken, jwtConfig.accessSecret) as AccessToken;
-  } catch (e) {
+  try {} catch (e) {
     return processingRefreshToken(refreshToken)(ctx, next);
   }

[Killed] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:49:15
   let payload: AccessToken;
   try {
     payload = jwt.verify(accessToken, jwtConfig.accessSecret) as AccessToken;
-  } catch (e) {
-    return processingRefreshToken(refreshToken)(ctx, next);
-  }
+  } catch (e) {}
   if (payload.type !== 'access') {
     return ctx.throw(400, 'Invalid token, please log in again');

[Killed] ConditionalExpression
Pichupido/src/middlewares/checkAuth.ts:52:7
   } catch (e) {
     return processingRefreshToken(refreshToken)(ctx, next);
   }
-  if (payload.type !== 'access') {
+  if (true) {
     return ctx.throw(400, 'Invalid token, please log in again');
   }

[Killed] EqualityOperator
Pichupido/src/middlewares/checkAuth.ts:52:7
   } catch (e) {
     return processingRefreshToken(refreshToken)(ctx, next);
   }
-  if (payload.type !== 'access') {
+  if (payload.type === 'access') {
     return ctx.throw(400, 'Invalid token, please log in again');
   }

[Timeout] StringLiteral
Pichupido/src/middlewares/checkAuth.ts:53:27
     return processingRefreshToken(refreshToken)(ctx, next);
   }
   if (payload.type !== 'access') {
-    return ctx.throw(400, 'Invalid token, please log in again');
+    return ctx.throw(400, "");
   }
   const [user] = await getUserById(payload.userId);

[Timeout] EqualityOperator
Pichupido/src/middlewares/checkAuth.ts:57:7
   }
   const [user] = await getUserById(payload.userId);
   ctx.state.user = user;
-  if (user.role === 'admin') {
+  if (user.role !== 'admin') {
     const restaurant = await getRestaurantByUserId(payload.userId);
     ctx.state.restaurant = restaurant;

[Timeout] BlockStatement
Pichupido/src/middlewares/checkAuth.ts:57:30
   }
   const [user] = await getUserById(payload.userId);
   ctx.state.user = user;
-  if (user.role === 'admin') {
-    const restaurant = await getRestaurantByUserId(payload.userId);
-    ctx.state.restaurant = restaurant;
-  }
+  if (user.role === 'admin') {}
   return next();
 };
