[Timeout] BlockStatement
Pichupido/src/utils/passwords.ts:11:15
   inputPassword: string,
   passwordFromDb: string,
   salt: string
-): boolean => {
-  if (!inputPassword || !passwordFromDb) return false;
-  return (
-    crypto
-      .pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, 'sha1')
-      .toString('base64') === passwordFromDb
-  );
-};
+): boolean => {};
 
 export const genSalt = (): string => crypto

[Killed] BooleanLiteral
Pichupido/src/utils/passwords.ts:12:7
   passwordFromDb: string,
   salt: string
 ): boolean => {
-  if (!inputPassword || !passwordFromDb) return false;
+  if (inputPassword || !passwordFromDb) return false;
   return (
     crypto

[Killed] BooleanLiteral
Pichupido/src/utils/passwords.ts:12:25
   passwordFromDb: string,
   salt: string
 ): boolean => {
-  if (!inputPassword || !passwordFromDb) return false;
+  if (!inputPassword || passwordFromDb) return false;
   return (
     crypto

[Killed] ConditionalExpression
Pichupido/src/utils/passwords.ts:14:5
 ): boolean => {
   if (!inputPassword || !passwordFromDb) return false;
   return (
-    crypto
-      .pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, 'sha1')
-      .toString('base64') === passwordFromDb
+    false
   );
 };

[Killed] EqualityOperator
Pichupido/src/utils/passwords.ts:14:5
 ): boolean => {
   if (!inputPassword || !passwordFromDb) return false;
   return (
-    crypto
-      .pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, 'sha1')
-      .toString('base64') === passwordFromDb
+    crypto.pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, 'sha1').toString('base64') !== passwordFromDb
   );
 };

[Killed] StringLiteral
Pichupido/src/utils/passwords.ts:15:70
   if (!inputPassword || !passwordFromDb) return false;
   return (
     crypto
-      .pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, 'sha1')
+      .pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, "")
       .toString('base64') === passwordFromDb
   );

[Killed] StringLiteral
Pichupido/src/utils/passwords.ts:16:17
   return (
     crypto
       .pbkdf2Sync(inputPassword, salt, hash.iterations, hash.length, 'sha1')
-      .toString('base64') === passwordFromDb
+      .toString("") === passwordFromDb
   );
 };

[Killed] ArrowFunction
Pichupido/src/utils/passwords.ts:20:24
   );
 };
 
-export const genSalt = (): string => crypto
-  .randomBytes(salt.length)
-  .toString('base64');
+export const genSalt = () => undefined;
 
 export const genHash = (password: string, salt: string): string => crypto

[Killed] ArrowFunction
Pichupido/src/utils/passwords.ts:24:24
   .randomBytes(salt.length)
   .toString('base64');
 
-export const genHash = (password: string, salt: string): string => crypto
-  .pbkdf2Sync(password, salt, hash.iterations, hash.length, 'sha1')
-  .toString('base64');
+export const genHash = () => undefined;
 
 

[Killed] StringLiteral
Pichupido/src/utils/passwords.ts:26:13
 
 export const genHash = (password: string, salt: string): string => crypto
   .pbkdf2Sync(password, salt, hash.iterations, hash.length, 'sha1')
-  .toString('base64');
+  .toString("");
 
 
