[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:9:52
 const jwtConfig: JwtConfig = config.get('tokens'); 
 
 export class AccountsController {
-  static async signIn(ctx: Context): Promise<void> {
-    try {
-      const { accessToken, refreshToken, user } = await AccountsServices.signIn(ctx.request.body);
-      ctx.cookies.set('accessToken', accessToken, { maxAge: jwtConfig.accessExpiresIn });
-      ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
-      ctx.body = { user };
-    } catch (error) {
-      return ctx.throw(400, error);
-    }
-  }
+  static async signIn(ctx: Context): Promise<void> {}
 
   static async signUp(ctx: Context): Promise<void> {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:10:9
 
 export class AccountsController {
   static async signIn(ctx: Context): Promise<void> {
-    try {
-      const { accessToken, refreshToken, user } = await AccountsServices.signIn(ctx.request.body);
-      ctx.cookies.set('accessToken', accessToken, { maxAge: jwtConfig.accessExpiresIn });
-      ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
-      ctx.body = { user };
-    } catch (error) {
+    try {} catch (error) {
       return ctx.throw(400, error);
     }

[Killed] StringLiteral
Pichupido/src/accounts/accounts.controllers.ts:13:23
     try {
       const { accessToken, refreshToken, user } = await AccountsServices.signIn(ctx.request.body);
       ctx.cookies.set('accessToken', accessToken, { maxAge: jwtConfig.accessExpiresIn });
-      ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
+      ctx.cookies.set("", refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
       ctx.body = { user };
     } catch (error) {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:15:21
       ctx.cookies.set('accessToken', accessToken, { maxAge: jwtConfig.accessExpiresIn });
       ctx.cookies.set('refreshToken', refreshToken, { maxAge: jwtConfig.refreshExpiresIn });
       ctx.body = { user };
-    } catch (error) {
-      return ctx.throw(400, error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:20:52
     }
   }
 
-  static async signUp(ctx: Context): Promise<void> {
-    try {
-      ctx.body = await AccountsServices.signUp(ctx.request.body);
-    } catch (error) {
-      return ctx.throw(400, error);
-    }
-  }
+  static async signUp(ctx: Context): Promise<void> {}
 
   static async profile(ctx: Context): Promise<void> {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:21:9
   }
 
   static async signUp(ctx: Context): Promise<void> {
-    try {
-      ctx.body = await AccountsServices.signUp(ctx.request.body);
-    } catch (error) {
+    try {} catch (error) {
       return ctx.throw(400, error);
     }

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:23:21
   static async signUp(ctx: Context): Promise<void> {
     try {
       ctx.body = await AccountsServices.signUp(ctx.request.body);
-    } catch (error) {
-      return ctx.throw(400, error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:28:53
     }
   }
 
-  static async profile(ctx: Context): Promise<void> {
-    try {
-      ctx.body = await AccountsServices.profile(ctx.state.user);
-    } catch (e) {
-      return ctx.throw(400, e);
-    }
-  }
+  static async profile(ctx: Context): Promise<void> {}
 
   static async deleteProfile(ctx: Context): Promise<void> {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:29:9
   }
 
   static async profile(ctx: Context): Promise<void> {
-    try {
-      ctx.body = await AccountsServices.profile(ctx.state.user);
-    } catch (e) {
+    try {} catch (e) {
       return ctx.throw(400, e);
     }

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:31:17
   static async profile(ctx: Context): Promise<void> {
     try {
       ctx.body = await AccountsServices.profile(ctx.state.user);
-    } catch (e) {
-      return ctx.throw(400, e);
-    }
+    } catch (e) {}
   }
 

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:36:59
     }
   }
 
-  static async deleteProfile(ctx: Context): Promise<void> {
-    try {
-      await AccountsServices.deleteProfile(ctx.state.user);
-      ctx.status = 204;
-    } catch (e) {
-      return ctx.throw(400, e);
-    }
-  }
+  static async deleteProfile(ctx: Context): Promise<void> {}
 }

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:37:9
   }
 
   static async deleteProfile(ctx: Context): Promise<void> {
-    try {
-      await AccountsServices.deleteProfile(ctx.state.user);
-      ctx.status = 204;
-    } catch (e) {
+    try {} catch (e) {
       return ctx.throw(400, e);
     }

[Killed] BlockStatement
Pichupido/src/accounts/accounts.controllers.ts:40:17
     try {
       await AccountsServices.deleteProfile(ctx.state.user);
       ctx.status = 204;
-    } catch (e) {
-      return ctx.throw(400, e);
-    }
+    } catch (e) {}
   }
 }
