[Killed] StringLiteral
Pichupido/src/accounts/accounts.queries.ts:7:25
 
 const userProps = {
   email: {},
-  firstName: { dbAlias: 'first_name' },
+  firstName: { dbAlias: "" },
   lastName: { dbAlias: 'last_name' },
   role: {},

[Killed] StringLiteral
Pichupido/src/accounts/accounts.queries.ts:8:24
 const userProps = {
   email: {},
   firstName: { dbAlias: 'first_name' },
-  lastName: { dbAlias: 'last_name' },
+  lastName: { dbAlias: "" },
   role: {},
   password: {},

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.queries.ts:8:13
 const userProps = {
   email: {},
   firstName: { dbAlias: 'first_name' },
-  lastName: { dbAlias: 'last_name' },
+  lastName: {},
   role: {},
   password: {},

[Killed] BlockStatement
Pichupido/src/accounts/accounts.queries.ts:14:64
   salt: {},
 };
 
-export async function getUserById(id: number): Promise<User[]> {
-  const selectClause = getSelectClause({ ...userProps, id: {} });
-  return (await query(`SELECT ${selectClause} FROM "User" WHERE id = $1`, [id])).rows;
-}
+export async function getUserById(id: number): Promise<User[]> {}
 
 export async function getUserByEmail(email: string): Promise<User[]> {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.queries.ts:19:70
   return (await query(`SELECT ${selectClause} FROM "User" WHERE id = $1`, [id])).rows;
 }
 
-export async function getUserByEmail(email: string): Promise<User[]> {
-  const selectClause = getSelectClause({ ...userProps, id: {} });
-  return (await query(`SELECT ${selectClause} FROM "User" WHERE email = $1`, [email])).rows;
-}
+export async function getUserByEmail(email: string): Promise<User[]> {}
 
 export async function insertNewUser(user: HashedCredentials & UserData): Promise<UserId> {

[Killed] StringLiteral
Pichupido/src/accounts/accounts.queries.ts:21:23
 
 export async function getUserByEmail(email: string): Promise<User[]> {
   const selectClause = getSelectClause({ ...userProps, id: {} });
-  return (await query(`SELECT ${selectClause} FROM "User" WHERE email = $1`, [email])).rows;
+  return (await query(``, [email])).rows;
 }
 

[Killed] BlockStatement
Pichupido/src/accounts/accounts.queries.ts:24:90
   return (await query(`SELECT ${selectClause} FROM "User" WHERE email = $1`, [email])).rows;
 }
 
-export async function insertNewUser(user: HashedCredentials & UserData): Promise<UserId> {
-  const [props, values, valueIdxs] = getInsertClauses(user, userProps);
-  return (await query(`INSERT INTO "User"(${props}) VALUES (${valueIdxs})`, values)).rows[0];
-}
+export async function insertNewUser(user: HashedCredentials & UserData): Promise<UserId> {}
 
 export async function deleteUserById(id: number): Promise<void> {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.queries.ts:29:65
   return (await query(`INSERT INTO "User"(${props}) VALUES (${valueIdxs})`, values)).rows[0];
 }
 
-export async function deleteUserById(id: number): Promise<void> {
-  await query(`
-  DELETE FROM "User"
-  WHERE id = $1
-  `, [id]);
-}
+export async function deleteUserById(id: number): Promise<void> {}
