[Killed] StringLiteral
Pichupido/src/accounts/accounts.routers.ts:15:3
 );
 
 accountsRouter.post(
-  '/accounts/sign-up',
+  "",
   AccountsValidator.signUp,
   AccountsController.signUp,

[Killed] StringLiteral
Pichupido/src/accounts/accounts.routers.ts:21:3
 );
 
 accountsRouter.get(
-  '/accounts/profile',
+  "",
   AccountsValidator.getProfile,
   checkAuth,

[Timeout] StringLiteral
Pichupido/src/accounts/accounts.routers.ts:28:3
 );
 
 accountsRouter.delete(
-  '/accounts/profile',
+  "",
   AccountsValidator.deleteProfile,
   checkAuth,
