[Timeout] BlockStatement
Pichupido/src/accounts/accounts.service.ts:8:138
 
 
 export class AccountsServices {
-  static async signIn({ password, email }: Credentials): Promise<{ user: UserData & UserId, accessToken: string, refreshToken: string }> {
-    const [user] = await queries.getUserByEmail(email);
-    if (!user || !checkPassword(password, user.password, user.salt)) {
-      throw new Error('Email or password is incorrect');
-    }
-
-    const { accessToken, refreshToken } = await createAndUpdateTokens(user.id);
-    const { id, firstName, lastName, role } = user;
-    return {
-      user: {
-        id,
-        firstName,
-        lastName,
-        role,
-      },
-      accessToken,
-      refreshToken,
-    }
-  }
+  static async signIn({ password, email }: Credentials): Promise<{ user: UserData & UserId, accessToken: string, refreshToken: string }> {}
 
   static async signUp({ email, password, ...rest }: UserData & Credentials): Promise<void> {

[Timeout] BooleanLiteral
Pichupido/src/accounts/accounts.service.ts:10:9
 export class AccountsServices {
   static async signIn({ password, email }: Credentials): Promise<{ user: UserData & UserId, accessToken: string, refreshToken: string }> {
     const [user] = await queries.getUserByEmail(email);
-    if (!user || !checkPassword(password, user.password, user.salt)) {
+    if (user || !checkPassword(password, user.password, user.salt)) {
       throw new Error('Email or password is incorrect');
     }

[Timeout] BooleanLiteral
Pichupido/src/accounts/accounts.service.ts:10:18
 export class AccountsServices {
   static async signIn({ password, email }: Credentials): Promise<{ user: UserData & UserId, accessToken: string, refreshToken: string }> {
     const [user] = await queries.getUserByEmail(email);
-    if (!user || !checkPassword(password, user.password, user.salt)) {
+    if (!user || checkPassword(password, user.password, user.salt)) {
       throw new Error('Email or password is incorrect');
     }

[Timeout] ObjectLiteral
Pichupido/src/accounts/accounts.service.ts:17:13
     const { accessToken, refreshToken } = await createAndUpdateTokens(user.id);
     const { id, firstName, lastName, role } = user;
     return {
-      user: {
-        id,
-        firstName,
-        lastName,
-        role,
-      },
+      user: {},
       accessToken,
       refreshToken,

[Killed] BlockStatement
Pichupido/src/accounts/accounts.service.ts:28:92
     }
   }
 
-  static async signUp({ email, password, ...rest }: UserData & Credentials): Promise<void> {
-    const [user] = await queries.getUserByEmail(email);
-    if (user) {
-      throw new Error('User with this email already exist');
-    }
-
-    const salt = genSalt();
-    const passwordHash = genHash(password, salt);
-    await queries.insertNewUser({
-      password: passwordHash,
-      email,
-      salt,
-      ...rest,
-    });
-  }
+  static async signUp({ email, password, ...rest }: UserData & Credentials): Promise<void> {}
 
   static async profile({ id }: UserId): Promise<UserData> {

[Killed] ConditionalExpression
Pichupido/src/accounts/accounts.service.ts:30:9
 
   static async signUp({ email, password, ...rest }: UserData & Credentials): Promise<void> {
     const [user] = await queries.getUserByEmail(email);
-    if (user) {
+    if (false) {
       throw new Error('User with this email already exist');
     }

[Killed] BlockStatement
Pichupido/src/accounts/accounts.service.ts:30:15
 
   static async signUp({ email, password, ...rest }: UserData & Credentials): Promise<void> {
     const [user] = await queries.getUserByEmail(email);
-    if (user) {
-      throw new Error('User with this email already exist');
-    }
+    if (user) {}
 
     const salt = genSalt();

[Killed] BlockStatement
Pichupido/src/accounts/accounts.service.ts:44:59
     });
   }
 
-  static async profile({ id }: UserId): Promise<UserData> {
-    const [{ password, salt, ...rest }] = await queries.getUserById(id);
-    return rest;
-  }
+  static async profile({ id }: UserId): Promise<UserData> {}
 
   static async deleteProfile({ id }: UserId): Promise<void> {

[Killed] BlockStatement
Pichupido/src/accounts/accounts.service.ts:49:61
     return rest;
   }
 
-  static async deleteProfile({ id }: UserId): Promise<void> {
-    await queries.deleteUserById(id);
-  }
+  static async deleteProfile({ id }: UserId): Promise<void> {}
 }
 
