[Killed] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:2:96
 import * as Router from 'koa-joi-router';
-export const PASSWORD_PATTERN = new RegExp('^(?=.*[a-z])(?=.*[0-9])(?=.*[!@#$%^&*])(?=.{6,})', 'i');
+export const PASSWORD_PATTERN = new RegExp('^(?=.*[a-z])(?=.*[0-9])(?=.*[!@#$%^&*])(?=.{6,})', "");
 
 const joi = Router.Joi;

[Killed] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:12:18
   static signIn: Router.Config = {
     meta: {
       swagger: {
-        summary: 'User sign in',
+        summary: "",
         description: 'Sign in user by email and password',
         tags: ['accounts'],

[Killed] ArrayDeclaration
Pichupido/src/accounts/accounts.validators.ts:14:15
       swagger: {
         summary: 'User sign in',
         description: 'Sign in user by email and password',
-        tags: ['accounts'],
+        tags: [],
       },
     },

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:19:13
     },
     validate: {
       type: 'json',
-      body: {
-        email: joi.string().email().required(),
-        password: joiPassword,
-      },
+      body: {},
       output: {
         200: {

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:23:15
         email: joi.string().email().required(),
         password: joiPassword,
       },
-      output: {
-        200: {
-          body: {
-            user: {
-              id: joi.number(),
-              firstName: joi.string(),
-              lastName: joi.string(),
-              role: joi.string().allow(null),
-            },
-          },
-        },
-      },
+      output: {},
     },
   };

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:26:19
       output: {
         200: {
           body: {
-            user: {
-              id: joi.number(),
-              firstName: joi.string(),
-              lastName: joi.string(),
-              role: joi.string().allow(null),
-            },
+            user: {},
           },
         },

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:39:11
   };
 
   static signUp: Router.Config = {
-    meta: {
-      swagger: {
-        summary: 'User sign up',
-        description: 'User registration',
-        tags: ['accounts'],
-      },
-    },
+    meta: {},
     validate: {
       type: 'json',

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:40:16
 
   static signUp: Router.Config = {
     meta: {
-      swagger: {
-        summary: 'User sign up',
-        description: 'User registration',
-        tags: ['accounts'],
-      },
+      swagger: {},
     },
     validate: {

[Killed] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:41:18
   static signUp: Router.Config = {
     meta: {
       swagger: {
-        summary: 'User sign up',
+        summary: "",
         description: 'User registration',
         tags: ['accounts'],

[Killed] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:42:22
     meta: {
       swagger: {
         summary: 'User sign up',
-        description: 'User registration',
+        description: "",
         tags: ['accounts'],
       },

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:51:97
       body: {
         email: joi.string().email().required(),
         password: joiPassword,
-        confirmPassword: joi.string().valid(joi.ref('password')).required().options({ language: { any: { allowOnly: 'must match password' } } }),
+        confirmPassword: joi.string().valid(joi.ref('password')).required().options({ language: {} }),
         firstName: joi.string(),
         lastName: joi.string(),

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:51:104
       body: {
         email: joi.string().email().required(),
         password: joiPassword,
-        confirmPassword: joi.string().valid(joi.ref('password')).required().options({ language: { any: { allowOnly: 'must match password' } } }),
+        confirmPassword: joi.string().valid(joi.ref('password')).required().options({ language: { any: {} } }),
         firstName: joi.string(),
         lastName: joi.string(),

[Killed] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:54:34
         confirmPassword: joi.string().valid(joi.ref('password')).required().options({ language: { any: { allowOnly: 'must match password' } } }),
         firstName: joi.string(),
         lastName: joi.string(),
-        role: joi.string().valid('admin', 'employee'),
+        role: joi.string().valid("", 'employee'),
       },
       output: {

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:56:15
         lastName: joi.string(),
         role: joi.string().valid('admin', 'employee'),
       },
-      output: {
-        201: {
-          body: {
-            success: true,
-          },
-        },
-        401: {
-          body: {
-            success: false,
-            message: joi.string().required(),
-          },
-        },
-      },
+      output: {},
     },
   };

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:58:17
       },
       output: {
         201: {
-          body: {
-            success: true,
-          },
+          body: {},
         },
         401: {

[Killed] BooleanLiteral
Pichupido/src/accounts/accounts.validators.ts:59:22
       output: {
         201: {
           body: {
-            success: true,
+            success: false,
           },
         },

[Timeout] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:63:17
           },
         },
         401: {
-          body: {
-            success: false,
-            message: joi.string().required(),
-          },
+          body: {},
         },
       },

[Timeout] BooleanLiteral
Pichupido/src/accounts/accounts.validators.ts:64:22
         },
         401: {
           body: {
-            success: false,
+            success: true,
             message: joi.string().required(),
           },

[Timeout] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:75:18
   static getProfile: Router.Config = {
     meta: {
       swagger: {
-        summary: 'Get user profile',
+        summary: "",
         description: 'Get profile data of current user',
         tags: ['accounts'],

[Timeout] StringLiteral
Pichupido/src/accounts/accounts.validators.ts:76:22
     meta: {
       swagger: {
         summary: 'Get user profile',
-        description: 'Get profile data of current user',
+        description: "",
         tags: ['accounts'],
       },

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:103:16
 
   static deleteProfile: Router.Config = {
     meta: {
-      swagger: {
-        summary: 'Delete user profile',
-        description: 'Delete profile data of current user',
-        tags: ['accounts'],
-      },
+      swagger: {},
     },
     validate: {

[Killed] ObjectLiteral
Pichupido/src/accounts/accounts.validators.ts:109:15
         tags: ['accounts'],
       },
     },
-    validate: {
-      output: {
-        204: {
-          body: {}
-        },
-        400: {
-          body: {
-            success: false,
-            message: joi.string().required(),
-          },
-        },
-      },
-    },
+    validate: {},
   }
 }
