[Killed] BlockStatement
Repos/Pichupido/src/app.ts:33:19
 export async function start(app: Koa, cb: (server: Server) => void): Promise<Koa> {
   try {
    // await createConnection({ ...databaseConf });
-  } catch (error) {
-    console.log(`Database connection error: ${error}`);
-  }
+  } catch (error) {}
   const server = createServer(app.callback());
 

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:34:17
   try {
    // await createConnection({ ...databaseConf });
   } catch (error) {
-    console.log(`Database connection error: ${error}`);
+    console.log(``);
   }
   const server = createServer(app.callback());

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:57:15
     basePath: '/',
     tags: [
       {
-        name: 'accounts',
+        name: "",
         description: 'Group of API methods for managing user accounts',
       },

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:58:22
     tags: [
       {
         name: 'accounts',
-        description: 'Group of API methods for managing user accounts',
+        description: "",
       },
       {

[Killed] ObjectLiteral
Repos/Pichupido/src/app.ts:60:7
         name: 'accounts',
         description: 'Group of API methods for managing user accounts',
       },
-      {
-        name: 'restaurants',
-        description: 'Group of API methods for managing restaurants',
-      },
+      {},
       {
         name: 'menu',

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:70:22
       },
       {
         name: 'sections',
-        description: 'Group of API methods for managing sections',
+        description: "",
       },
       {

[Killed] BlockStatement
Repos/Pichupido/src/app.ts:81:42
     defaultResponses: {},
   });
 
-  router.get('/api.json', async (ctx) => {
-    ctx.body = JSON.stringify(spec, null, '  ');
-  });
+  router.get('/api.json', async (ctx) => {});
   app.use(httpLogger());
   app.use(errorCatcherMiddleware);

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:81:14
     defaultResponses: {},
   });
 
-  router.get('/api.json', async (ctx) => {
+  router.get("", async (ctx) => {
     ctx.body = JSON.stringify(spec, null, '  ');
   });

[Timeout] BooleanLiteral
Repos/Pichupido/src/app.ts:87:18
   app.use(httpLogger());
   app.use(errorCatcherMiddleware);
   app.use(cors({
-    credentials: true,
+    credentials: false,
   }));
   app.use(bodyParser({

[Timeout] BooleanLiteral
Repos/Pichupido/src/app.ts:90:16
     credentials: true,
   }));
   app.use(bodyParser({
-    multipart: true,
+    multipart: false,
     includeUnparsed: true,
     formLimit: 200 * 1024,

[Timeout] BooleanLiteral
Repos/Pichupido/src/app.ts:91:22
   }));
   app.use(bodyParser({
     multipart: true,
-    includeUnparsed: true,
+    includeUnparsed: false,
     formLimit: 200 * 1024,
   }));

[Timeout] ArithmeticOperator
Repos/Pichupido/src/app.ts:92:16
   app.use(bodyParser({
     multipart: true,
     includeUnparsed: true,
-    formLimit: 200 * 1024,
+    formLimit: 200 / 1024,
   }));
   app.use(helmet({

[Killed] BooleanLiteral
Repos/Pichupido/src/app.ts:95:28
     formLimit: 200 * 1024,
   }));
   app.use(helmet({
-    contentSecurityPolicy: false,
+    contentSecurityPolicy: true,
   }));
 

[Killed] BooleanLiteral
Repos/Pichupido/src/app.ts:101:19
   app.use(
     koaSwagger({
       routePrefix: '/docs',
-      hideTopbar: true,
+      hideTopbar: false,
       swaggerOptions: {
         url: `${config.get('server.baseUrl')}/api.json`,

[Killed] ObjectLiteral
Repos/Pichupido/src/app.ts:102:23
     koaSwagger({
       routePrefix: '/docs',
       hideTopbar: true,
-      swaggerOptions: {
-        url: `${config.get('server.baseUrl')}/api.json`,
-      },
+      swaggerOptions: {},
     }),
   );

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:103:14
       routePrefix: '/docs',
       hideTopbar: true,
       swaggerOptions: {
-        url: `${config.get('server.baseUrl')}/api.json`,
+        url: ``,
       },
     }),

[Killed] StringLiteral
Repos/Pichupido/src/app.ts:103:28
       routePrefix: '/docs',
       hideTopbar: true,
       swaggerOptions: {
-        url: `${config.get('server.baseUrl')}/api.json`,
+        url: `${config.get("")}/api.json`,
       },
     }),

[Killed] BlockStatement
Repos/Pichupido/src/app.ts:108:34
     }),
   );
 
-  router.get('/', async (ctx) => {
-    ctx.body = 'It works!';
-  });
+  router.get('/', async (ctx) => {});
   router.use(accountsRouter.middleware());
   router.use(restaurantsRouter.middleware());
