[Killed] BlockStatement
Repos/Pichupido/src/app.unit.ts:6:23
 import { app, start } from './app';
 
 let server: Koa;
-beforeAll(async () => {
-  jest.setTimeout(10000);
-  server = await start(app, function () { return });
-});
+beforeAll(async () => {});
 
 test('it works', async () => {

[Survived] BlockStatement
Repos/Pichupido/src/app.unit.ts:8:41
 let server: Koa;
 beforeAll(async () => {
   jest.setTimeout(10000);
-  server = await start(app, function () { return });
+  server = await start(app, function () {});
 });
 

[Survived] BlockStatement
Repos/Pichupido/src/app.unit.ts:11:30
   server = await start(app, function () { return });
 });
 
-test('it works', async () => {
-  const response = await request(server.callback()).get('/');
-
-  expect(response.status).toBe(200);
-  expect(response.type).toEqual('text/plain');
-  expect(response.body).toEqual({});
-});
+test('it works', async () => {});
 

[Killed] StringLiteral
Repos/Pichupido/src/app.unit.ts:15:33
   const response = await request(server.callback()).get('/');
 
   expect(response.status).toBe(200);
-  expect(response.type).toEqual('text/plain');
+  expect(response.type).toEqual("");
   expect(response.body).toEqual({});
 });
