[Survived] BlockStatement
src/dishes/__mocks__/dishes.queries.ts:12:86
 
 let getRestaurantIdByMenu: (menuId: number) => number;
 
-export const __setMenuRestaurantRelation = (fn: (menuId: number) => number): void => {
-  getRestaurantIdByMenu = fn;
-}
+export const __setMenuRestaurantRelation = (fn: (menuId: number) => number): void => {}
 export const __setDbData = db.__setDbData;
 

[Survived] BlockStatement
src/dishes/__mocks__/dishes.queries.ts:17:65
 }
 export const __setDbData = db.__setDbData;
 
-export const getDishById = async (id: number): Promise<Dish> => {
-  return await db.selectOne((dish) => dish.id === id);
-}
+export const getDishById = async (id: number): Promise<Dish> => {}
 
 export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {

[Survived] EqualityOperator
src/dishes/__mocks__/dishes.queries.ts:18:39
 export const __setDbData = db.__setDbData;
 
 export const getDishById = async (id: number): Promise<Dish> => {
-  return await db.selectOne((dish) => dish.id === id);
+  return await db.selectOne((dish) => dish.id !== id);
 }
 

[Survived] ArrowFunction
src/dishes/__mocks__/dishes.queries.ts:18:29
 export const __setDbData = db.__setDbData;
 
 export const getDishById = async (id: number): Promise<Dish> => {
-  return await db.selectOne((dish) => dish.id === id);
+  return await db.selectOne(() => undefined);
 }
 

[Survived] BlockStatement
src/dishes/__mocks__/dishes.queries.ts:21:87
   return await db.selectOne((dish) => dish.id === id);
 }
 
-export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
-  ));
-}
+export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {}
 
 export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {

[Survived] ArrowFunction
src/dishes/__mocks__/dishes.queries.ts:22:30
 }
 
 export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
-  ));
+  return await db.selectMany(() => undefined);
 }
 

[Survived] ConditionalExpression
src/dishes/__mocks__/dishes.queries.ts:23:5
 
 export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
+    false
   ));
 }

[Survived] EqualityOperator
src/dishes/__mocks__/dishes.queries.ts:23:5
 
 export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
+    getRestaurantIdByMenu(dish.menuId) !== restaurantId
   ));
 }

[Survived] BlockStatement
src/dishes/__mocks__/dishes.queries.ts:27:93
   ));
 }
 
-export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
-    && dish.isActive
-  ));
-}
+export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {}
 
 export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {

[Survived] ArrowFunction
src/dishes/__mocks__/dishes.queries.ts:28:30
 }
 
 export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
-    && dish.isActive
-  ));
+  return await db.selectMany(() => undefined);
 }
 

[Survived] ConditionalExpression
src/dishes/__mocks__/dishes.queries.ts:29:5
 
 export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    getRestaurantIdByMenu(dish.menuId) === restaurantId
-    && dish.isActive
+    false
   ));
 }

[Survived] BlockStatement
src/dishes/__mocks__/dishes.queries.ts:34:81
   ));
 }
 
-export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
-  ));
-}
+export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {}
 
 export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {

[Survived] ArrowFunction
src/dishes/__mocks__/dishes.queries.ts:35:30
 }
 
 export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
-  ));
+  return await db.selectMany(() => undefined);
 }
 

[Survived] ConditionalExpression
src/dishes/__mocks__/dishes.queries.ts:36:5
 
 export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
+    false
   ));
 }

[Survived] ConditionalExpression
src/dishes/__mocks__/dishes.queries.ts:36:5
 
 export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
+    true
   ));
 }

[Survived] BlockStatement
src/dishes/__mocks__/dishes.queries.ts:40:87
   ));
 }
 
-export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
-    && dish.isActive
-  ));
-}
+export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {}
 
 export const insertDish = db.insert;

[Survived] ArrowFunction
src/dishes/__mocks__/dishes.queries.ts:41:30
 }
 
 export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {
-  return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
-    && dish.isActive
-  ));
+  return await db.selectMany(() => undefined);
 }
 

[Survived] LogicalOperator
src/dishes/__mocks__/dishes.queries.ts:42:5
 
 export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
-    && dish.isActive
+    dish.sectionId === sectionId || dish.isActive
   ));
 }

[Survived] EqualityOperator
src/dishes/__mocks__/dishes.queries.ts:42:5
 
 export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {
   return await db.selectMany((dish) => (
-    dish.sectionId === sectionId
+    dish.sectionId !== sectionId
     && dish.isActive
   ));
