[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:4:55
 import { Middleware } from 'koa';
 import * as DishesServices from './dishes.service';
 
-export const getDishById: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getDishById(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getDishById: Middleware = async (ctx) => {};
 
 export const getDishesByRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:5:7
 import * as DishesServices from './dishes.service';
 
 export const getDishById: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getDishById(ctx.params.id);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:7:15
 export const getDishById: Middleware = async (ctx) => {
   try {
     ctx.body = await DishesServices.getDishById(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:12:65
   }
 };
 
-export const getDishesByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getDishesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getDishesByRestaurant: Middleware = async (ctx) => {};
 
 export const getActiveDishesByRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:13:7
 };
 
 export const getDishesByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getDishesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:15:15
 export const getDishesByRestaurant: Middleware = async (ctx) => {
   try {
     ctx.body = await DishesServices.getDishesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:20:71
   }
 };
 
-export const getActiveDishesByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getActiveDishesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getActiveDishesByRestaurant: Middleware = async (ctx) => {};
 
 export const getDishesBySection: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:21:7
 };
 
 export const getActiveDishesByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getActiveDishesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:23:15
 export const getActiveDishesByRestaurant: Middleware = async (ctx) => {
   try {
     ctx.body = await DishesServices.getActiveDishesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:28:62
   }
 };
 
-export const getDishesBySection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getDishesBySection(ctx.params.sectionId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getDishesBySection: Middleware = async (ctx) => {};
 
 export const getActiveDishesBySection: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:29:7
 };
 
 export const getDishesBySection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getDishesBySection(ctx.params.sectionId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:31:15
 export const getDishesBySection: Middleware = async (ctx) => {
   try {
     ctx.body = await DishesServices.getDishesBySection(ctx.params.sectionId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:36:68
   }
 };
 
-export const getActiveDishesBySection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getActiveDishesBySection(ctx.params.sectionId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getActiveDishesBySection: Middleware = async (ctx) => {};
 
 export const createDish: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:37:7
 };
 
 export const getActiveDishesBySection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.getActiveDishesBySection(ctx.params.sectionId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:39:15
 export const getActiveDishesBySection: Middleware = async (ctx) => {
   try {
     ctx.body = await DishesServices.getActiveDishesBySection(ctx.params.sectionId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:44:54
   }
 };
 
-export const createDish: Middleware = async (ctx) => {
-  try {
-    const id = await DishesServices.createDish(ctx.request.body, ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const createDish: Middleware = async (ctx) => {};
 
 export const updateDish: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:45:7
 };
 
 export const createDish: Middleware = async (ctx) => {
-  try {
-    const id = await DishesServices.createDish(ctx.request.body, ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:49:15
     const id = await DishesServices.createDish(ctx.request.body, ctx.state.restaurant.id);
     ctx.body = { id };
     ctx.status = 201;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:54:54
   }
 };
 
-export const updateDish: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.updateDish(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const updateDish: Middleware = async (ctx) => {};
 
 export const deleteDish: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:55:7
 };
 
 export const updateDish: Middleware = async (ctx) => {
-  try {
-    ctx.body = await DishesServices.updateDish(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:58:15
   try {
     ctx.body = await DishesServices.updateDish(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
     ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:63:54
   }
 };
 
-export const deleteDish: Middleware = async (ctx) => {
-  try {
-    await DishesServices.deleteDish(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const deleteDish: Middleware = async (ctx) => {};
 
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.conrollers.ts:64:7
 };
 
 export const deleteDish: Middleware = async (ctx) => {
-  try {
-    await DishesServices.deleteDish(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }
