[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.queries.ts:5:19
 import { query } from '../libs/db';
 import { Dish, DishData, DishDataOptional } from './dishes.types';
 
-const dishProps = {
-  id: { source: 'Dish' },
-  name: { source: 'Dish' },
-  description: { source: 'Dish' },
-  photo: { source: 'Dish' },
-  price: { source: 'Dish' },
-  discount: { source: 'Dish' },
-  sectionId: { dbAlias: 'section_id', source: 'Dish' },
-  sectionName: { dbAlias: 'name', source: 'Dish_section' },
-  menuId: { dbAlias: 'menu_id', source: 'Dish' },
-  menuName: { dbAlias: 'name', source: 'Menu' },
-};
+const dishProps = {};
 
 export const getDishById = async (id: number): Promise<Dish> => {

[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.queries.ts:8:16
 const dishProps = {
   id: { source: 'Dish' },
   name: { source: 'Dish' },
-  description: { source: 'Dish' },
+  description: {},
   photo: { source: 'Dish' },
   price: { source: 'Dish' },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.queries.ts:12:14
   photo: { source: 'Dish' },
   price: { source: 'Dish' },
   discount: { source: 'Dish' },
-  sectionId: { dbAlias: 'section_id', source: 'Dish' },
+  sectionId: {},
   sectionName: { dbAlias: 'name', source: 'Dish_section' },
   menuId: { dbAlias: 'menu_id', source: 'Dish' },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.queries.ts:13:16
   price: { source: 'Dish' },
   discount: { source: 'Dish' },
   sectionId: { dbAlias: 'section_id', source: 'Dish' },
-  sectionName: { dbAlias: 'name', source: 'Dish_section' },
+  sectionName: {},
   menuId: { dbAlias: 'menu_id', source: 'Dish' },
   menuName: { dbAlias: 'name', source: 'Menu' },

[Killed] StringLiteral
Pichupido/src/dishes/dishes.queries.ts:14:41
   discount: { source: 'Dish' },
   sectionId: { dbAlias: 'section_id', source: 'Dish' },
   sectionName: { dbAlias: 'name', source: 'Dish_section' },
-  menuId: { dbAlias: 'menu_id', source: 'Dish' },
+  menuId: { dbAlias: 'menu_id', source: "" },
   menuName: { dbAlias: 'name', source: 'Menu' },
 };

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.queries.ts:14:11
   discount: { source: 'Dish' },
   sectionId: { dbAlias: 'section_id', source: 'Dish' },
   sectionName: { dbAlias: 'name', source: 'Dish_section' },
-  menuId: { dbAlias: 'menu_id', source: 'Dish' },
+  menuId: {},
   menuName: { dbAlias: 'name', source: 'Menu' },
 };

[Killed] StringLiteral
Pichupido/src/dishes/dishes.queries.ts:15:40
   sectionId: { dbAlias: 'section_id', source: 'Dish' },
   sectionName: { dbAlias: 'name', source: 'Dish_section' },
   menuId: { dbAlias: 'menu_id', source: 'Dish' },
-  menuName: { dbAlias: 'name', source: 'Menu' },
+  menuName: { dbAlias: 'name', source: "" },
 };
 

[Killed] StringLiteral
Pichupido/src/dishes/dishes.queries.ts:15:24
   sectionId: { dbAlias: 'section_id', source: 'Dish' },
   sectionName: { dbAlias: 'name', source: 'Dish_section' },
   menuId: { dbAlias: 'menu_id', source: 'Dish' },
-  menuName: { dbAlias: 'name', source: 'Menu' },
+  menuName: { dbAlias: "", source: 'Menu' },
 };
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:18:65
   menuName: { dbAlias: 'name', source: 'Menu' },
 };
 
-export const getDishById = async (id: number): Promise<Dish> => {
-  const selectClause = getSelectClause(dishProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish
-  INNER JOIN Menu ON Dish.menu_id = Menu.id
-  INNER JOIN Dish_section ON Dish.section_id = Dish_section.id
-  WHERE Dish.id = $1
-  `, [id])).rows[0];
-}
+export const getDishById = async (id: number): Promise<Dish> => {}
 
 export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {

[Killed] ArrayDeclaration
Pichupido/src/dishes/dishes.queries.ts:26:6
   INNER JOIN Menu ON Dish.menu_id = Menu.id
   INNER JOIN Dish_section ON Dish.section_id = Dish_section.id
   WHERE Dish.id = $1
-  `, [id])).rows[0];
+  `, [])).rows[0];
 }
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:29:87
   `, [id])).rows[0];
 }
 
-export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
-  const selectClause = getSelectClause(dishProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish
-  INNER JOIN Menu ON Dish.menu_id = Menu.id
-  INNER JOIN Dish_section ON Dish.section_id = Dish_section.id
-  WHERE Menu.restaurant_id = $1
-  `, [restaurantId])).rows as Dish[];
-}
+export const getDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {}
 
 export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:40:93
   `, [restaurantId])).rows as Dish[];
 }
 
-export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {
-  const selectClause = getSelectClause(dishProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish
-  INNER JOIN Menu ON Dish.menu_id = Menu.id
-  INNER JOIN Dish_section ON Dish.section_id = Dish_section.id
-  WHERE Menu.restaurant_id = $1
-    AND Menu.active = TRUE
-  `, [restaurantId])).rows as Dish[];
-}
+export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dish[]> => {}
 
 export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:52:81
   `, [restaurantId])).rows as Dish[];
 }
 
-export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {
-  const selectClause = getSelectClause(dishProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish
-  INNER JOIN Menu ON Dish.menu_id = Menu.id
-  INNER JOIN Dish_section ON Dish.section_id = Dish_section.id
-  WHERE section_id = $1
-  `, [sectionId])).rows as Dish[];
-}
+export const getDishesBySection = async (sectionId: number): Promise<Dish[]> => {}
 
 export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:63:87
   `, [sectionId])).rows as Dish[];
 }
 
-export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {
-  const selectClause = getSelectClause(dishProps);
-  return (await query(`
-  SELECT ${selectClause}
-  FROM Dish
-  INNER JOIN Menu ON Dish.menu_id = Menu.id
-  INNER JOIN Dish_section ON Dish.section_id = Dish_section.id
-  WHERE Dish.section_id = $1
-    AND Menu.active = TRUE
-  `, [sectionId])).rows as Dish[];
-}
+export const getActiveDishesBySection = async (sectionId: number): Promise<Dish[]> => {}
 
 export const insertDish = async (dish: DishData): Promise<number> => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:75:70
   `, [sectionId])).rows as Dish[];
 }
 
-export const insertDish = async (dish: DishData): Promise<number> => {
-  const [props, values, valueIdxs] = getInsertClauses(dish, dishProps);
-  return (await query(`
-  INSERT INTO Dish(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
-}
+export const insertDish = async (dish: DishData): Promise<number> => {}
 
 

[Killed] StringLiteral
Pichupido/src/dishes/dishes.queries.ts:77:23
 
 export const insertDish = async (dish: DishData): Promise<number> => {
   const [props, values, valueIdxs] = getInsertClauses(dish, dishProps);
-  return (await query(`
-  INSERT INTO Dish(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
+  return (await query(``, values)).rows[0].id;
 }
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:85:88
 }
 
 
-export const updateDish = async (dish: DishDataOptional, id: number): Promise<void> => {
-  const [updateClause, values, nextIndx] = getUpdateClauses(dish, dishProps);
-  await query(`
-  UPDATE Dish 
-  SET ${updateClause}
-  WHERE id = $${nextIndx}
-  `, [...values, id]);
-}
+export const updateDish = async (dish: DishDataOptional, id: number): Promise<void> => {}
 
 export const deleteDish = async (id: number): Promise<void> => {

[Killed] StringLiteral
Pichupido/src/dishes/dishes.queries.ts:87:15
 
 export const updateDish = async (dish: DishDataOptional, id: number): Promise<void> => {
   const [updateClause, values, nextIndx] = getUpdateClauses(dish, dishProps);
-  await query(`
-  UPDATE Dish 
-  SET ${updateClause}
-  WHERE id = $${nextIndx}
-  `, [...values, id]);
+  await query(``, [...values, id]);
 }
 

[Killed] ArrayDeclaration
Pichupido/src/dishes/dishes.queries.ts:91:6
   UPDATE Dish 
   SET ${updateClause}
   WHERE id = $${nextIndx}
-  `, [...values, id]);
+  `, []);
 }
 

[Killed] BlockStatement
Pichupido/src/dishes/dishes.queries.ts:94:64
   `, [...values, id]);
 }
 
-export const deleteDish = async (id: number): Promise<void> => {
-  await query(`
-  DELETE FROM Dish
-  WHERE id = $1
-  `, [id]);
-}
+export const deleteDish = async (id: number): Promise<void> => {}
