[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:13:53
     sections: []
   };
   dishes.map((dish) => {
-    let section = result.sections.find((section) => section && section.id === dish.sectionId)
+    let section = result.sections.find((section) => true)
     if (!section) {
       result.sections.push({

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:13:64
     sections: []
   };
   dishes.map((dish) => {
-    let section = result.sections.find((section) => section && section.id === dish.sectionId)
+    let section = result.sections.find((section) => section && true)
     if (!section) {
       result.sections.push({

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:14:9
   };
   dishes.map((dish) => {
     let section = result.sections.find((section) => section && section.id === dish.sectionId)
-    if (!section) {
+    if (true) {
       result.sections.push({
         id: dish.sectionId,

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:14:19
   };
   dishes.map((dish) => {
     let section = result.sections.find((section) => section && section.id === dish.sectionId)
-    if (!section) {
-      result.sections.push({
-        id: dish.sectionId,
-        name: dish.sectionName,
-        menus: [],
-      });
-      section = result.sections[result.sections.length - 1];
-    }
+    if (!section) {}
 
     let menu = section.menus.find((menu) => menu && menu.id === dish.menuId);

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.service.ts:15:28
   dishes.map((dish) => {
     let section = result.sections.find((section) => section && section.id === dish.sectionId)
     if (!section) {
-      result.sections.push({
-        id: dish.sectionId,
-        name: dish.sectionName,
-        menus: [],
-      });
+      result.sections.push({});
       section = result.sections[result.sections.length - 1];
     }

[Killed] ArithmeticOperator
Pichupido/src/dishes/dishes.service.ts:20:33
         name: dish.sectionName,
         menus: [],
       });
-      section = result.sections[result.sections.length - 1];
+      section = result.sections[result.sections.length + 1];
     }
 

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:23:53
       section = result.sections[result.sections.length - 1];
     }
 
-    let menu = section.menus.find((menu) => menu && menu.id === dish.menuId);
+    let menu = section.menus.find((menu) => menu && true);
     if (!menu) {
       section.menus.push({

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:23:45
       section = result.sections[result.sections.length - 1];
     }
 
-    let menu = section.menus.find((menu) => menu && menu.id === dish.menuId);
+    let menu = section.menus.find((menu) => true);
     if (!menu) {
       section.menus.push({

[Killed] BooleanLiteral
Pichupido/src/dishes/dishes.service.ts:24:9
     }
 
     let menu = section.menus.find((menu) => menu && menu.id === dish.menuId);
-    if (!menu) {
+    if (menu) {
       section.menus.push({
         id: dish.menuId,

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:24:9
     }
 
     let menu = section.menus.find((menu) => menu && menu.id === dish.menuId);
-    if (!menu) {
+    if (true) {
       section.menus.push({
         id: dish.menuId,

[Killed] ArithmeticOperator
Pichupido/src/dishes/dishes.service.ts:30:28
         name: dish.menuName,
         dishes: [],
       })
-      menu = section.menus[section.menus.length - 1];
+      menu = section.menus[section.menus.length + 1];
     }
 

[Timeout] BlockStatement
Pichupido/src/dishes/dishes.service.ts:45:65
   return result;
 };
 
-export const getDishById = async (id: number): Promise<Dish> => {
-  const dish = await queries.getDishById(id);
-  if (!dish) {
-    throw ('There are no dishes with this id');
-  }
-  return dish;
-};
+export const getDishById = async (id: number): Promise<Dish> => {};
 
 export const getDishesByRestaurant = async (restaurantId: number): Promise<Dishes> => {

[Timeout] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:47:7
 
 export const getDishById = async (id: number): Promise<Dish> => {
   const dish = await queries.getDishById(id);
-  if (!dish) {
+  if (true) {
     throw ('There are no dishes with this id');
   }

[Timeout] BlockStatement
Pichupido/src/dishes/dishes.service.ts:47:14
 
 export const getDishById = async (id: number): Promise<Dish> => {
   const dish = await queries.getDishById(id);
-  if (!dish) {
-    throw ('There are no dishes with this id');
-  }
+  if (!dish) {}
   return dish;
 };

[Timeout] StringLiteral
Pichupido/src/dishes/dishes.service.ts:48:12
 export const getDishById = async (id: number): Promise<Dish> => {
   const dish = await queries.getDishById(id);
   if (!dish) {
-    throw ('There are no dishes with this id');
+    throw ("");
   }
   return dish;

[Timeout] BlockStatement
Pichupido/src/dishes/dishes.service.ts:53:87
   return dish;
 };
 
-export const getDishesByRestaurant = async (restaurantId: number): Promise<Dishes> => {
-  return formatDishArray(await queries.getDishesByRestaurant(restaurantId));
-};
+export const getDishesByRestaurant = async (restaurantId: number): Promise<Dishes> => {};
 
 export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dishes> => {

[Timeout] BlockStatement
Pichupido/src/dishes/dishes.service.ts:57:93
   return formatDishArray(await queries.getDishesByRestaurant(restaurantId));
 };
 
-export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dishes> => {
-  return formatDishArray(await queries.getActiveDishesByRestaurant(restaurantId));
-};
+export const getActiveDishesByRestaurant = async (restaurantId: number): Promise<Dishes> => {};
 
 export const getDishesBySection = async (sectionId: number): Promise<Dishes> => {

[Timeout] BlockStatement
Pichupido/src/dishes/dishes.service.ts:61:81
   return formatDishArray(await queries.getActiveDishesByRestaurant(restaurantId));
 };
 
-export const getDishesBySection = async (sectionId: number): Promise<Dishes> => {
-  return formatDishArray(await queries.getDishesBySection(sectionId));
-};
+export const getDishesBySection = async (sectionId: number): Promise<Dishes> => {};
 
 export const getActiveDishesBySection = async (sectionId: number): Promise<Dishes> => {

[Timeout] BlockStatement
Pichupido/src/dishes/dishes.service.ts:65:87
   return formatDishArray(await queries.getDishesBySection(sectionId));
 };
 
-export const getActiveDishesBySection = async (sectionId: number): Promise<Dishes> => {
-  return formatDishArray(await queries.getActiveDishesBySection(sectionId));
-};
+export const getActiveDishesBySection = async (sectionId: number): Promise<Dishes> => {};
 
 export const createDish = async (dish: DishData, restaurantId: number): Promise<number> => {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:69:92
   return formatDishArray(await queries.getActiveDishesBySection(sectionId));
 };
 
-export const createDish = async (dish: DishData, restaurantId: number): Promise<number> => {
-  const section = await getSectionById(dish.sectionId);
-  if (!section) {
-    throw ('Invalid section id');
-  }
-
-  const menu = await getMenuById(dish.menuId);
-  if (!menu) {
-    throw ('Invalid menu id');
-  }
-
-  if (restaurantId !== section.restaurantId || restaurantId !== menu.restaurantId) {
-    throw ('Section or menu does not belong to your restautant');
-  }
-
-  if (!checkImage(dish.photo)) {
-    throw ('Invalid photo');
-  }
-  dish.photo = await uploadImage(dish.photo);
-
-  return await queries.insertDish(dish);
-};
+export const createDish = async (dish: DishData, restaurantId: number): Promise<number> => {};
 
 export const updateDish = async (

[Killed] BooleanLiteral
Pichupido/src/dishes/dishes.service.ts:71:7
 
 export const createDish = async (dish: DishData, restaurantId: number): Promise<number> => {
   const section = await getSectionById(dish.sectionId);
-  if (!section) {
+  if (section) {
     throw ('Invalid section id');
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:71:17
 
 export const createDish = async (dish: DishData, restaurantId: number): Promise<number> => {
   const section = await getSectionById(dish.sectionId);
-  if (!section) {
-    throw ('Invalid section id');
-  }
+  if (!section) {}
 
   const menu = await getMenuById(dish.menuId);

[Killed] StringLiteral
Pichupido/src/dishes/dishes.service.ts:72:12
 export const createDish = async (dish: DishData, restaurantId: number): Promise<number> => {
   const section = await getSectionById(dish.sectionId);
   if (!section) {
-    throw ('Invalid section id');
+    throw ("");
   }
 

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:76:7
   }
 
   const menu = await getMenuById(dish.menuId);
-  if (!menu) {
+  if (false) {
     throw ('Invalid menu id');
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:76:14
   }
 
   const menu = await getMenuById(dish.menuId);
-  if (!menu) {
-    throw ('Invalid menu id');
-  }
+  if (!menu) {}
 
   if (restaurantId !== section.restaurantId || restaurantId !== menu.restaurantId) {

[Killed] StringLiteral
Pichupido/src/dishes/dishes.service.ts:77:12
 
   const menu = await getMenuById(dish.menuId);
   if (!menu) {
-    throw ('Invalid menu id');
+    throw ("");
   }
 

[Killed] EqualityOperator
Pichupido/src/dishes/dishes.service.ts:80:48
     throw ('Invalid menu id');
   }
 
-  if (restaurantId !== section.restaurantId || restaurantId !== menu.restaurantId) {
+  if (restaurantId !== section.restaurantId || restaurantId === menu.restaurantId) {
     throw ('Section or menu does not belong to your restautant');
   }

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:80:7
     throw ('Invalid menu id');
   }
 
-  if (restaurantId !== section.restaurantId || restaurantId !== menu.restaurantId) {
+  if (true) {
     throw ('Section or menu does not belong to your restautant');
   }

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:84:7
     throw ('Section or menu does not belong to your restautant');
   }
 
-  if (!checkImage(dish.photo)) {
+  if (true) {
     throw ('Invalid photo');
   }

[Killed] BooleanLiteral
Pichupido/src/dishes/dishes.service.ts:84:7
     throw ('Section or menu does not belong to your restautant');
   }
 
-  if (!checkImage(dish.photo)) {
+  if (checkImage(dish.photo)) {
     throw ('Invalid photo');
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:98:18
   dishId: number,
 ): Promise<void> => {
   const currDish = await queries.getDishById(dishId);
-  if (!currDish) {
-    throw ('There are no dishes with this id');
-  }
+  if (!currDish) {}
 
   if (dish.sectionId) {

[Killed] BooleanLiteral
Pichupido/src/dishes/dishes.service.ts:98:7
   dishId: number,
 ): Promise<void> => {
   const currDish = await queries.getDishById(dishId);
-  if (!currDish) {
+  if (currDish) {
     throw ('There are no dishes with this id');
   }

[Killed] StringLiteral
Pichupido/src/dishes/dishes.service.ts:99:12
 ): Promise<void> => {
   const currDish = await queries.getDishById(dishId);
   if (!currDish) {
-    throw ('There are no dishes with this id');
+    throw ("");
   }
 

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:102:7
     throw ('There are no dishes with this id');
   }
 
-  if (dish.sectionId) {
+  if (false) {
     const section = await getSectionById(dish.sectionId);
     if (!section || restaurantId !== section.restaurantId) {

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:102:7
     throw ('There are no dishes with this id');
   }
 
-  if (dish.sectionId) {
+  if (true) {
     const section = await getSectionById(dish.sectionId);
     if (!section || restaurantId !== section.restaurantId) {

[Killed] BooleanLiteral
Pichupido/src/dishes/dishes.service.ts:104:9
 
   if (dish.sectionId) {
     const section = await getSectionById(dish.sectionId);
-    if (!section || restaurantId !== section.restaurantId) {
+    if (section || restaurantId !== section.restaurantId) {
       throw ('Invalid section id');
     }

[Killed] LogicalOperator
Pichupido/src/dishes/dishes.service.ts:104:9
 
   if (dish.sectionId) {
     const section = await getSectionById(dish.sectionId);
-    if (!section || restaurantId !== section.restaurantId) {
+    if (!section && restaurantId !== section.restaurantId) {
       throw ('Invalid section id');
     }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:109:20
     }
   }
 
-  if (dish.menuId) {
-    const menu = await getMenuById(dish.menuId);
-    if (!menu || restaurantId !== menu.restaurantId) {
-      throw ('Invalid menu id');
-    }
-  }
+  if (dish.menuId) {}
 
   if (dish.photo) {

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:109:7
     }
   }
 
-  if (dish.menuId) {
+  if (false) {
     const menu = await getMenuById(dish.menuId);
     if (!menu || restaurantId !== menu.restaurantId) {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:111:54
 
   if (dish.menuId) {
     const menu = await getMenuById(dish.menuId);
-    if (!menu || restaurantId !== menu.restaurantId) {
-      throw ('Invalid menu id');
-    }
+    if (!menu || restaurantId !== menu.restaurantId) {}
   }
 

[Killed] LogicalOperator
Pichupido/src/dishes/dishes.service.ts:111:9
 
   if (dish.menuId) {
     const menu = await getMenuById(dish.menuId);
-    if (!menu || restaurantId !== menu.restaurantId) {
+    if (!menu && restaurantId !== menu.restaurantId) {
       throw ('Invalid menu id');
     }

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:116:7
     }
   }
 
-  if (dish.photo) {
+  if (true) {
     if (!checkImage(dish.photo)) {
       throw ('Invalid photo');

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:116:7
     }
   }
 
-  if (dish.photo) {
+  if (false) {
     if (!checkImage(dish.photo)) {
       throw ('Invalid photo');

[Killed] BooleanLiteral
Pichupido/src/dishes/dishes.service.ts:117:9
   }
 
   if (dish.photo) {
-    if (!checkImage(dish.photo)) {
+    if (checkImage(dish.photo)) {
       throw ('Invalid photo');
     }

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:117:9
   }
 
   if (dish.photo) {
-    if (!checkImage(dish.photo)) {
+    if (false) {
       throw ('Invalid photo');
     }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:127:90
   return await queries.updateDish(dish, dishId);
 };
 
-export const deleteDish = async (restaurantId: number, dishId: number): Promise<void> => {
-  const dish = await queries.getDishById(dishId);
-  if (!dish) {
-    throw ('There are no dishes with this id');
-  }
-  const section = await getSectionById(dish.sectionId);
-  if (restaurantId !== section.restaurantId) {
-    throw ('This dish doesn\'t belong to your restaurant');
-  }
-
-  await deleteImage(dish.photo);
-  await queries.deleteDish(dishId);
-}
+export const deleteDish = async (restaurantId: number, dishId: number): Promise<void> => {}
 

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:129:7
 
 export const deleteDish = async (restaurantId: number, dishId: number): Promise<void> => {
   const dish = await queries.getDishById(dishId);
-  if (!dish) {
+  if (true) {
     throw ('There are no dishes with this id');
   }

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:129:14
 
 export const deleteDish = async (restaurantId: number, dishId: number): Promise<void> => {
   const dish = await queries.getDishById(dishId);
-  if (!dish) {
-    throw ('There are no dishes with this id');
-  }
+  if (!dish) {}
   const section = await getSectionById(dish.sectionId);
   if (restaurantId !== section.restaurantId) {

[Killed] BlockStatement
Pichupido/src/dishes/dishes.service.ts:133:46
     throw ('There are no dishes with this id');
   }
   const section = await getSectionById(dish.sectionId);
-  if (restaurantId !== section.restaurantId) {
-    throw ('This dish doesn\'t belong to your restaurant');
-  }
+  if (restaurantId !== section.restaurantId) {}
 
   await deleteImage(dish.photo);

[Killed] ConditionalExpression
Pichupido/src/dishes/dishes.service.ts:133:7
     throw ('There are no dishes with this id');
   }
   const section = await getSectionById(dish.sectionId);
-  if (restaurantId !== section.restaurantId) {
+  if (true) {
     throw ('This dish doesn\'t belong to your restaurant');
   }
