[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:6:9
 const joi = Router.Joi;
 
 export const createDish: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Add dish',
-      tags: ['dishes'],
-    },
-  },
+  meta: {},
   validate: {
     type: 'json',

[Killed] StringLiteral
Pichupido/src/dishes/dishes.validators.ts:8:16
 export const createDish: Router.Config = {
   meta: {
     swagger: {
-      summary: 'Add dish',
+      summary: "",
       tags: ['dishes'],
     },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:12:13
       tags: ['dishes'],
     },
   },
-  validate: {
-    type: 'json',
-    body: {
-      name: joi.string(),
-      photo: joi.string(),
-      description: joi.string(),
-      price: joi.string(),
-      sectionId: joi.number(),
-      menuId: joi.number(),
-    },
-    output: {
-      201: {
-        body: {
-          id: joi.number(),
-        },
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
+  validate: {},
 };
 

[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:39:14
 
 export const getDishById: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Get dish by id',
-      tags: ['dishes'],
-    },
+    swagger: {},
   },
   validate: {

[Timeout] ArrayDeclaration
Pichupido/src/dishes/dishes.validators.ts:41:13
   meta: {
     swagger: {
       summary: 'Get dish by id',
-      tags: ['dishes'],
+      tags: [],
     },
   },

[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:48:13
     params: {
       id: joi.number(),
     },
-    output: {
-      200: {
-        body: {
-          id: joi.number(),
-          restaurantId: joi.number(),
-          name: joi.string(),
-          photo: joi.string(),
-          description: joi.string(),
-          price: joi.string(),
-          discount: joi.number(),
-          sectionId: joi.number(),
-          menuId: joi.number(),
-          sectionName: joi.string(),
-          menuName: joi.string(),
-        },
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:49:12
       id: joi.number(),
     },
     output: {
-      200: {
-        body: {
-          id: joi.number(),
-          restaurantId: joi.number(),
-          name: joi.string(),
-          photo: joi.string(),
-          description: joi.string(),
-          price: joi.string(),
-          discount: joi.number(),
-          sectionId: joi.number(),
-          menuId: joi.number(),
-          sectionName: joi.string(),
-          menuName: joi.string(),
-        },
-      },
+      200: {},
       400: {
         body: {

[Killed] StringLiteral
Pichupido/src/dishes/dishes.validators.ts:76:16
 export const getDishesBySection: Router.Config = {
   meta: {
     swagger: {
-      summary: 'Get dishes by section',
+      summary: "",
       tags: ['dishes'],
     },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:106:15
         },
       },
       400: {
-        body: {
-          error: joi.string(),
-        },
+        body: {},
       },
     },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:134:41
             menus: joi.array().items({
               id: joi.number(),
               name: joi.string(),
-              dishes: joi.array().items({
-                id: joi.number(),
-                name: joi.string(),
-                description: joi.string(),
-                photo: joi.string(),
-                price: joi.string(),
-                discount: joi.number(),
-              })
+              dishes: joi.array().items({})
             })
           })

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:157:14
 
 export const getDishesByRestaurant: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Get dishes by restaurant',
-      tags: ['dishes'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] StringLiteral
Pichupido/src/dishes/dishes.validators.ts:158:16
 export const getDishesByRestaurant: Router.Config = {
   meta: {
     swagger: {
-      summary: 'Get dishes by restaurant',
+      summary: "",
       tags: ['dishes'],
     },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:163:13
     },
   },
   validate: {
-    params: {
-      restaurantId: joi.number(),
-    },
+    params: {},
     output: {
       200: {

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:169:39
     output: {
       200: {
         body: {
-          sections: joi.array().items({
-            id: joi.number(),
-            name: joi.string(),
-            menus: joi.array().items({
-              id: joi.number(),
-              name: joi.string(),
-              dishes: joi.array().items({
-                id: joi.number(),
-                name: joi.string(),
-                description: joi.string(),
-                photo: joi.string(),
-                price: joi.string(),
-                discount: joi.number(),
-              })
-            })
-          })
+          sections: joi.array().items({})
         },
       },

[Killed] ArrayDeclaration
Pichupido/src/dishes/dishes.validators.ts:200:13
   meta: {
     swagger: {
       summary: 'Get dishes by restaurant, that are contained in active menus',
-      tags: ['dishes'],
+      tags: [],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:239:9
 
 
 export const updateDish: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Update dish',
-      tags: ['dishes'],
-    },
-  },
+  meta: {},
   validate: {
     type: 'json',

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:259:13
     params: {
       id: joi.number(),
     },
-    output: {
-      204: {
-        body: {},
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 }

[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:272:42
   },
 }
 
-export const deleteDish: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Delete dish',
-      tags: ['dishes'],
-    },
-  },
-  validate: {
-    params: {
-      id: joi.number(),
-    },
-    output: {
-      204: {
-        body: {},
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
-}
+export const deleteDish: Router.Config = {}
 
 

[Timeout] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:273:9
 }
 
 export const deleteDish: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Delete dish',
-      tags: ['dishes'],
-    },
-  },
+  meta: {},
   validate: {
     params: {

[Timeout] StringLiteral
Pichupido/src/dishes/dishes.validators.ts:275:16
 export const deleteDish: Router.Config = {
   meta: {
     swagger: {
-      summary: 'Delete dish',
+      summary: "",
       tags: ['dishes'],
     },

[Killed] ObjectLiteral
Pichupido/src/dishes/dishes.validators.ts:279:13
       tags: ['dishes'],
     },
   },
-  validate: {
-    params: {
-      id: joi.number(),
-    },
-    output: {
-      204: {
-        body: {},
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
+  validate: {},
 }
 
