[Killed] StringLiteral
src/libs/db/escaping.ts:6:11
 }
 
 const escapeMap: StrMap<string> = {
-  "\0":   "\\0",
+  "\0":   "",
   "\x08": "\\b",
   "\x09": "\\t",

[Killed] StringLiteral
src/libs/db/escaping.ts:10:11
   "\x08": "\\b",
   "\x09": "\\t",
   "\x1a": "\\z",
-  "\n":   "\\n",
+  "\n":   "",
   "\r":   "\\r",
   "\"":   "\\\"",

[Killed] BlockStatement
src/libs/db/escaping.ts:18:64
   "%":    "\\%",
 };
 
-export function escapeIdentifier<T>(x: string | T): string | T {
-  if (typeof x === 'string') {
-    // eslint-disable-next-line no-control-regex
-    return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {
-      const escaped: string = escapeMap[char];
-      return escaped || char;
-    })
-  } else {
-    return x;
-  }
-}
+export function escapeIdentifier<T>(x: string | T): string | T {}
 
 export function escapeArray(arr: Array<unknown>): Array<unknown> {

[Killed] ConditionalExpression
src/libs/db/escaping.ts:19:7
 };
 
 export function escapeIdentifier<T>(x: string | T): string | T {
-  if (typeof x === 'string') {
+  if (true) {
     // eslint-disable-next-line no-control-regex
     return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {

[Killed] BlockStatement
src/libs/db/escaping.ts:19:30
 };
 
 export function escapeIdentifier<T>(x: string | T): string | T {
-  if (typeof x === 'string') {
-    // eslint-disable-next-line no-control-regex
-    return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {
-      const escaped: string = escapeMap[char];
-      return escaped || char;
-    })
-  } else {
+  if (typeof x === 'string') {} else {
     return x;
   }

[Killed] BlockStatement
src/libs/db/escaping.ts:21:72
 export function escapeIdentifier<T>(x: string | T): string | T {
   if (typeof x === 'string') {
     // eslint-disable-next-line no-control-regex
-    return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {
-      const escaped: string = escapeMap[char];
-      return escaped || char;
-    })
+    return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {})
   } else {
     return x;

[Killed] ConditionalExpression
src/libs/db/escaping.ts:23:14
     // eslint-disable-next-line no-control-regex
     return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {
       const escaped: string = escapeMap[char];
-      return escaped || char;
+      return true;
     })
   } else {

[Killed] ConditionalExpression
src/libs/db/escaping.ts:23:14
     // eslint-disable-next-line no-control-regex
     return (x as string).replace(/[\0\x08\x09\x1a\n\r"'\\%]/g, char => {
       const escaped: string = escapeMap[char];
-      return escaped || char;
+      return false;
     })
   } else {

[Killed] BlockStatement
src/libs/db/escaping.ts:25:10
       const escaped: string = escapeMap[char];
       return escaped || char;
     })
-  } else {
-    return x;
-  }
+  } else {}
 }
 

[Killed] BlockStatement
src/libs/db/escaping.ts:30:66
   }
 }
 
-export function escapeArray(arr: Array<unknown>): Array<unknown> {
-  return arr.map(escapeIdentifier)
-}
+export function escapeArray(arr: Array<unknown>): Array<unknown> {}
