[Killed] ArrowFunction
src/libs/db/index.ts:7:15
 const databaseConf: PoolConfig = config.get('database');
 
 const pool = new Pool(databaseConf);
-const query = (text: string | QueryConfig, params?: Array<unknown>): Promise<QueryResult> => (
-  pool.query(text, params && escapeArray(params))
-);
+const query = () => undefined;
 
 export { query };

[Killed] ConditionalExpression
src/libs/db/index.ts:8:20
 
 const pool = new Pool(databaseConf);
 const query = (text: string | QueryConfig, params?: Array<unknown>): Promise<QueryResult> => (
-  pool.query(text, params && escapeArray(params))
+  pool.query(text, true)
 );
 

[Killed] LogicalOperator
src/libs/db/index.ts:8:20
 
 const pool = new Pool(databaseConf);
 const query = (text: string | QueryConfig, params?: Array<unknown>): Promise<QueryResult> => (
-  pool.query(text, params && escapeArray(params))
+  pool.query(text, params || escapeArray(params))
 );
 
