[Killed] BlockStatement
src/libs/db/typeMapping.ts:16:11
 
 export function getSelectClause<T, K extends keyof T = keyof T>(
   propInfo: PropsProcessors<T>,
-): string {
-  return (Object.entries(propInfo) as [K, PropInfo<T[K]>][])
-    .map(([property, { json, source, dbAlias = property }]) => {
-      if (!json && !source) {
-        return `${OFFSET}${dbAlias} as "${property}"`;
-
-      }
-      const path = source ? `${source}.${dbAlias}` : dbAlias;
-      const dbProp = json ? `to_json(${path})` : path;
-      return `${OFFSET}${dbProp} as "${property}"`;
-    })
-    .join(',\n');
-}
+): string {}
 
 export function getInsertClauses<T>(

[Killed] BlockStatement
src/libs/db/typeMapping.ts:18:64
   propInfo: PropsProcessors<T>,
 ): string {
   return (Object.entries(propInfo) as [K, PropInfo<T[K]>][])
-    .map(([property, { json, source, dbAlias = property }]) => {
-      if (!json && !source) {
-        return `${OFFSET}${dbAlias} as "${property}"`;
-
-      }
-      const path = source ? `${source}.${dbAlias}` : dbAlias;
-      const dbProp = json ? `to_json(${path})` : path;
-      return `${OFFSET}${dbProp} as "${property}"`;
-    })
+    .map(([property, { json, source, dbAlias = property }]) => {})
     .join(',\n');
 }

[Killed] BlockStatement
src/libs/db/typeMapping.ts:19:29
 ): string {
   return (Object.entries(propInfo) as [K, PropInfo<T[K]>][])
     .map(([property, { json, source, dbAlias = property }]) => {
-      if (!json && !source) {
-        return `${OFFSET}${dbAlias} as "${property}"`;
-
-      }
+      if (!json && !source) {}
       const path = source ? `${source}.${dbAlias}` : dbAlias;
       const dbProp = json ? `to_json(${path})` : path;

[Killed] BooleanLiteral
src/libs/db/typeMapping.ts:19:11
 ): string {
   return (Object.entries(propInfo) as [K, PropInfo<T[K]>][])
     .map(([property, { json, source, dbAlias = property }]) => {
-      if (!json && !source) {
+      if (json && !source) {
         return `${OFFSET}${dbAlias} as "${property}"`;
 

[Killed] StringLiteral
src/libs/db/typeMapping.ts:25:14
       }
       const path = source ? `${source}.${dbAlias}` : dbAlias;
       const dbProp = json ? `to_json(${path})` : path;
-      return `${OFFSET}${dbProp} as "${property}"`;
+      return ``;
     })
     .join(',\n');

[Killed] BlockStatement
src/libs/db/typeMapping.ts:33:32
 export function getInsertClauses<T>(
   entry: T,
   propInfo: PropsProcessors<T>,
-): [string, unknown[], string] {
-  const keys = Object
-    .keys(propInfo)
-    .filter((prop) => Object.prototype.hasOwnProperty.call(entry, prop)) as Array<keyof T>;
-  const props = keys
-    .map((prop: keyof T) => (propInfo[prop].dbAlias ?? prop))
-    .join(', ');
-  const values = keys.map((key) => {
-    const { json } = propInfo[key];
-    const serialize = propInfo[key].serialize ?? (json ? JSON.stringify : undefined);
-
-    return serialize?.(entry[key]) ?? entry[key];
-  });
-  const valueIdxs = keys.map((_, idx) => `$${idx + 1}`).join(', ');
-  return [props, values, valueIdxs];
-}
+): [string, unknown[], string] {}
 
 export function getUpdateClauses<T>(

[Timeout] ArrowFunction
src/libs/db/typeMapping.ts:38:10
     .keys(propInfo)
     .filter((prop) => Object.prototype.hasOwnProperty.call(entry, prop)) as Array<keyof T>;
   const props = keys
-    .map((prop: keyof T) => (propInfo[prop].dbAlias ?? prop))
+    .map(() => undefined)
     .join(', ');
   const values = keys.map((key) => {

[Killed] BlockStatement
src/libs/db/typeMapping.ts:40:36
   const props = keys
     .map((prop: keyof T) => (propInfo[prop].dbAlias ?? prop))
     .join(', ');
-  const values = keys.map((key) => {
-    const { json } = propInfo[key];
-    const serialize = propInfo[key].serialize ?? (json ? JSON.stringify : undefined);
-
-    return serialize?.(entry[key]) ?? entry[key];
-  });
+  const values = keys.map((key) => {});
   const valueIdxs = keys.map((_, idx) => `$${idx + 1}`).join(', ');
   return [props, values, valueIdxs];

[Killed] ArithmeticOperator
src/libs/db/typeMapping.ts:46:46
 
     return serialize?.(entry[key]) ?? entry[key];
   });
-  const valueIdxs = keys.map((_, idx) => `$${idx + 1}`).join(', ');
+  const valueIdxs = keys.map((_, idx) => `$${idx - 1}`).join(', ');
   return [props, values, valueIdxs];
 }

[Timeout] ArrowFunction
src/libs/db/typeMapping.ts:46:30
 
     return serialize?.(entry[key]) ?? entry[key];
   });
-  const valueIdxs = keys.map((_, idx) => `$${idx + 1}`).join(', ');
+  const valueIdxs = keys.map(() => undefined).join(', ');
   return [props, values, valueIdxs];
 }

[Timeout] ArrayDeclaration
src/libs/db/typeMapping.ts:47:10
     return serialize?.(entry[key]) ?? entry[key];
   });
   const valueIdxs = keys.map((_, idx) => `$${idx + 1}`).join(', ');
-  return [props, values, valueIdxs];
+  return [];
 }
 

[Killed] BlockStatement
src/libs/db/typeMapping.ts:53:32
 export function getUpdateClauses<T>(
   entry: T,
   propInfo: PropsProcessors<T>,
-): [string, unknown[], number] {
-  const keys = Object
-    .keys(propInfo)
-    .filter((prop) => Object.prototype.hasOwnProperty.call(entry, prop)) as Array<keyof T>;
-  const props = keys
-    .map((prop: keyof T) => (propInfo[prop].dbAlias ?? prop));
-    const values = keys.map((key) => {
-    const { json } = propInfo[key];
-    const serialize = propInfo[key].serialize ?? (json ? JSON.stringify : undefined);
-
-    return serialize?.(entry[key]) ?? entry[key];
-  });
-  const valueIdxs = keys.map((_, idx) => `$${idx + 1}`);
-  const updateClause = props.map((prop, indx) => (
-    `${prop} = ${valueIdxs[indx]}`
-  )).join(',\n');
-  const nextIndx = valueIdxs.length + 1;
-  return [updateClause, values, nextIndx];
-}
+): [string, unknown[], number] {}

[Killed] ArrowFunction
src/libs/db/typeMapping.ts:58:10
     .keys(propInfo)
     .filter((prop) => Object.prototype.hasOwnProperty.call(entry, prop)) as Array<keyof T>;
   const props = keys
-    .map((prop: keyof T) => (propInfo[prop].dbAlias ?? prop));
+    .map(() => undefined);
     const values = keys.map((key) => {
     const { json } = propInfo[key];

[Timeout] BlockStatement
src/libs/db/typeMapping.ts:59:38
     .filter((prop) => Object.prototype.hasOwnProperty.call(entry, prop)) as Array<keyof T>;
   const props = keys
     .map((prop: keyof T) => (propInfo[prop].dbAlias ?? prop));
-    const values = keys.map((key) => {
-    const { json } = propInfo[key];
-    const serialize = propInfo[key].serialize ?? (json ? JSON.stringify : undefined);
-
-    return serialize?.(entry[key]) ?? entry[key];
-  });
+    const values = keys.map((key) => {});
   const valueIdxs = keys.map((_, idx) => `$${idx + 1}`);
   const updateClause = props.map((prop, indx) => (

[Killed] ArrowFunction
src/libs/db/typeMapping.ts:65:30
 
     return serialize?.(entry[key]) ?? entry[key];
   });
-  const valueIdxs = keys.map((_, idx) => `$${idx + 1}`);
+  const valueIdxs = keys.map(() => undefined);
   const updateClause = props.map((prop, indx) => (
     `${prop} = ${valueIdxs[indx]}`

[Killed] ArithmeticOperator
src/libs/db/typeMapping.ts:65:46
 
     return serialize?.(entry[key]) ?? entry[key];
   });
-  const valueIdxs = keys.map((_, idx) => `$${idx + 1}`);
+  const valueIdxs = keys.map((_, idx) => `$${idx - 1}`);
   const updateClause = props.map((prop, indx) => (
     `${prop} = ${valueIdxs[indx]}`

[Killed] ArrowFunction
src/libs/db/typeMapping.ts:66:34
     return serialize?.(entry[key]) ?? entry[key];
   });
   const valueIdxs = keys.map((_, idx) => `$${idx + 1}`);
-  const updateClause = props.map((prop, indx) => (
-    `${prop} = ${valueIdxs[indx]}`
-  )).join(',\n');
+  const updateClause = props.map(() => undefined).join(',\n');
   const nextIndx = valueIdxs.length + 1;
   return [updateClause, values, nextIndx];

[Killed] ArithmeticOperator
src/libs/db/typeMapping.ts:69:20
   const updateClause = props.map((prop, indx) => (
     `${prop} = ${valueIdxs[indx]}`
   )).join(',\n');
-  const nextIndx = valueIdxs.length + 1;
+  const nextIndx = valueIdxs.length - 1;
   return [updateClause, values, nextIndx];
 }
