[Survived] BlockStatement
src/menu/__mocks__/menu.queries.ts:8:103
 const db = new DefaultDbMock<Menu, MenuData &  { restaurantId: number }, MenuDataOptional>();
 export const __setDbData = db.__setDbData;
 
-export const getMenuByName = async (name: string, restaurantId: number): Promise<Menu | undefined> => {
-  return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
-  );
-};
+export const getMenuByName = async (name: string, restaurantId: number): Promise<Menu | undefined> => {};
 
 export const getMenuById = async (id: number): Promise<Menu | undefined> => {

[Survived] ArrowFunction
src/menu/__mocks__/menu.queries.ts:9:29
 export const __setDbData = db.__setDbData;
 
 export const getMenuByName = async (name: string, restaurantId: number): Promise<Menu | undefined> => {
-  return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
+  return await db.selectOne(() => undefined
   );
 };

[Survived] ConditionalExpression
src/menu/__mocks__/menu.queries.ts:10:5
 
 export const getMenuByName = async (name: string, restaurantId: number): Promise<Menu | undefined> => {
   return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
+    false
   );
 };

[Survived] ConditionalExpression
src/menu/__mocks__/menu.queries.ts:10:5
 
 export const getMenuByName = async (name: string, restaurantId: number): Promise<Menu | undefined> => {
   return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
+    false && section.restaurantId === restaurantId
   );
 };

[Survived] BlockStatement
src/menu/__mocks__/menu.queries.ts:14:77
   );
 };
 
-export const getMenuById = async (id: number): Promise<Menu | undefined> => {
-  return await db.selectOne((section) =>
-    section.id === id
-  );
-}
+export const getMenuById = async (id: number): Promise<Menu | undefined> => {}
 
 export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {

[Survived] ArrowFunction
src/menu/__mocks__/menu.queries.ts:15:29
 };
 
 export const getMenuById = async (id: number): Promise<Menu | undefined> => {
-  return await db.selectOne((section) =>
-    section.id === id
+  return await db.selectOne(() => undefined
   );
 }

[Survived] ConditionalExpression
src/menu/__mocks__/menu.queries.ts:16:5
 
 export const getMenuById = async (id: number): Promise<Menu | undefined> => {
   return await db.selectOne((section) =>
-    section.id === id
+    false
   );
 }

[Survived] ConditionalExpression
src/menu/__mocks__/menu.queries.ts:16:5
 
 export const getMenuById = async (id: number): Promise<Menu | undefined> => {
   return await db.selectOne((section) =>
-    section.id === id
+    true
   );
 }

[Survived] BlockStatement
src/menu/__mocks__/menu.queries.ts:20:86
   );
 }
 
-export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {
-  return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
-  );
-}
+export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {}
 
 export const insertMenu = db.insert;

[Survived] ArrowFunction
src/menu/__mocks__/menu.queries.ts:21:30
 }
 
 export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {
-  return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
+  return await db.selectMany(() => undefined
   );
 }

[Survived] ConditionalExpression
src/menu/__mocks__/menu.queries.ts:22:5
 
 export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {
   return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
+    true
   );
 }

[Survived] ConditionalExpression
src/menu/__mocks__/menu.queries.ts:22:5
 
 export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {
   return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
+    false
   );
 }
