[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:4:51
 import { Middleware } from 'koa';
 import * as MenuServices from './menu.service';
 
-export const getMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.getMenu(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getMenu: Middleware = async (ctx) => {};
 
 export const getMenusByRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:5:7
 import * as MenuServices from './menu.service';
 
 export const getMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.getMenu(ctx.params.id);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:7:15
 export const getMenu: Middleware = async (ctx) => {
   try {
     ctx.body = await MenuServices.getMenu(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:12:64
   }
 };
 
-export const getMenusByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.getMenusByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getMenusByRestaurant: Middleware = async (ctx) => {};
 
 export const createMenu: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:13:7
 };
 
 export const getMenusByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.getMenusByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:15:15
 export const getMenusByRestaurant: Middleware = async (ctx) => {
   try {
     ctx.body = await MenuServices.getMenusByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:20:54
   }
 };
 
-export const createMenu: Middleware = async (ctx) => {
-  try {
-    const id = await MenuServices.createMenu(ctx.request.body, ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const createMenu: Middleware = async (ctx) => {};
 
 export const updateMenu: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:21:7
 };
 
 export const createMenu: Middleware = async (ctx) => {
-  try {
-    const id = await MenuServices.createMenu(ctx.request.body, ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:30:54
   }
 };
 
-export const updateMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.updateMenu(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const updateMenu: Middleware = async (ctx) => {};
 
 export const deleteMenu: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:31:7
 };
 
 export const updateMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.updateMenu(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:39:54
   }
 };
 
-export const deleteMenu: Middleware = async (ctx) => {
-  try {
-    await MenuServices.deleteMenu(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const deleteMenu: Middleware = async (ctx) => {};
 
 export const activateMenu: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:40:7
 };
 
 export const deleteMenu: Middleware = async (ctx) => {
-  try {
-    await MenuServices.deleteMenu(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:48:56
   }
 };
 
-export const activateMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.updateMenu({ isActive: true }, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const activateMenu: Middleware = async (ctx) => {};
 
 

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:49:7
 };
 
 export const activateMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.updateMenu({ isActive: true }, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BooleanLiteral
Pichupido/src/menu/menu.conrollers.ts:50:58
 
 export const activateMenu: Middleware = async (ctx) => {
   try {
-    ctx.body = await MenuServices.updateMenu({ isActive: true }, ctx.state.restaurant.id, ctx.params.id);
+    ctx.body = await MenuServices.updateMenu({ isActive: false }, ctx.state.restaurant.id, ctx.params.id);
     ctx.status = 204;
   } catch (e) {

[Killed] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:58:58
 };
 
 
-export const deactivateMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.updateMenu({ isActive: false }, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const deactivateMenu: Middleware = async (ctx) => {};
 

[Timeout] BlockStatement
Pichupido/src/menu/menu.conrollers.ts:59:7
 
 
 export const deactivateMenu: Middleware = async (ctx) => {
-  try {
-    ctx.body = await MenuServices.updateMenu({ isActive: false }, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Timeout] BooleanLiteral
Pichupido/src/menu/menu.conrollers.ts:60:58
 
 export const deactivateMenu: Middleware = async (ctx) => {
   try {
-    ctx.body = await MenuServices.updateMenu({ isActive: false }, ctx.state.restaurant.id, ctx.params.id);
+    ctx.body = await MenuServices.updateMenu({ isActive: true }, ctx.state.restaurant.id, ctx.params.id);
     ctx.status = 204;
   } catch (e) {

[Timeout] ObjectLiteral
Pichupido/src/menu/menu.conrollers.ts:60:46
 
 export const deactivateMenu: Middleware = async (ctx) => {
   try {
-    ctx.body = await MenuServices.updateMenu({ isActive: false }, ctx.state.restaurant.id, ctx.params.id);
+    ctx.body = await MenuServices.updateMenu({}, ctx.state.restaurant.id, ctx.params.id);
     ctx.status = 204;
   } catch (e) {
