[Timeout] StringLiteral
Pichupido/src/menu/menu.queries.ts:8:28
 const menuProps = {
   id: {},
   name: {},
-  restaurantId: { dbAlias: 'restaurant_id' },
+  restaurantId: { dbAlias: "" },
   isActive: { dbAlias: 'active' }
 };

[Timeout] BlockStatement
Pichupido/src/menu/menu.queries.ts:12:90
   isActive: { dbAlias: 'active' }
 };
 
-export const getMenuByName = async(name: string, restaurantId: number): Promise<Menu> => {
-  const selectClause = getSelectClause(menuProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Menu
-  WHERE name = $1
-  AND restaurant_id = $2
-  `, [name, restaurantId])).rows[0];
-}
+export const getMenuByName = async(name: string, restaurantId: number): Promise<Menu> => {}
 
 export const getMenuById = async(id: number): Promise<Menu> => {

[Killed] BlockStatement
Pichupido/src/menu/menu.queries.ts:22:64
   `, [name, restaurantId])).rows[0];
 }
 
-export const getMenuById = async(id: number): Promise<Menu> => {
-  const selectClause = getSelectClause(menuProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Menu
-  WHERE id = $1
-  `, [id])).rows[0];
-}
+export const getMenuById = async(id: number): Promise<Menu> => {}
 
 export const getMenusByRestaurant = async(restaurantId: number): Promise<Menu[]> => {

[Killed] BlockStatement
Pichupido/src/menu/menu.queries.ts:31:85
   `, [id])).rows[0];
 }
 
-export const getMenusByRestaurant = async(restaurantId: number): Promise<Menu[]> => {
-  const selectClause = getSelectClause(menuProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Menu
-  WHERE restaurant_id = $1
-  `, [restaurantId])).rows;
-}
+export const getMenusByRestaurant = async(restaurantId: number): Promise<Menu[]> => {}
 
 export const insertMenu = async(menu: MenuData & { restaurantId: number }): Promise<number> => {

[Killed] BlockStatement
Pichupido/src/menu/menu.queries.ts:40:96
   `, [restaurantId])).rows;
 }
 
-export const insertMenu = async(menu: MenuData & { restaurantId: number }): Promise<number> => {
-  const [props, values, valueIdxs] = getInsertClauses(menu, menuProps);
-  return (await query(`
-  INSERT INTO Menu(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
-}
+export const insertMenu = async(menu: MenuData & { restaurantId: number }): Promise<number> => {}
 
 

[Killed] BlockStatement
Pichupido/src/menu/menu.queries.ts:50:87
 }
 
 
-export const updateMenu = async(menu: MenuDataOptional, id: number): Promise<void> => {
-  const [updateClause, values, nextIndx] = getUpdateClauses(menu, menuProps);
-  await query(`
-  UPDATE Menu 
-  SET ${updateClause}
-  WHERE id = $${nextIndx}
-  `, [...values, id]);
-}
+export const updateMenu = async(menu: MenuDataOptional, id: number): Promise<void> => {}
 
 export const deleteMenu = async(id: number): Promise<void> => {

[Killed] BlockStatement
Pichupido/src/menu/menu.queries.ts:59:63
   `, [...values, id]);
 }
 
-export const deleteMenu = async(id: number): Promise<void> => {
-  await query(`
-  DELETE FROM Menu
-  WHERE id = $1
-  `, [id]);
-}
+export const deleteMenu = async(id: number): Promise<void> => {}
