[Killed] StringLiteral
Pichupido/src/menu/menu.routers.ts:16:3
 );
 
 menuRouter.get(
-  '/menu/:id',
+  "",
   MenuValidator.getMenu,
   MenuConroller.getMenu,

[Killed] StringLiteral
Pichupido/src/menu/menu.routers.ts:22:3
 );
 
 menuRouter.post(
-  '/menu/',
+  "",
   MenuValidator.createMenu,
   checkAuth,

[Killed] StringLiteral
Pichupido/src/menu/menu.routers.ts:30:3
 );
 
 menuRouter.put(
-  '/menu/:id',
+  "",
   MenuValidator.updateMenu,
   checkAuth,

[Killed] StringLiteral
Pichupido/src/menu/menu.routers.ts:33:15
   '/menu/:id',
   MenuValidator.updateMenu,
   checkAuth,
-  checkAccess('admin'),
+  checkAccess(""),
   MenuConroller.updateMenu,
 );
