[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:4:92
 import * as queries from './menu.queries';
 import { Menu, MenuData, MenuDataOptional } from './menu.types';
 
-export const createMenu = async (menu: MenuData, restaurantId: number): Promise<number> => {
-  const currMenu = await queries.getMenuByName(menu.name, restaurantId);
-  if (currMenu) {
-    throw('There is already menu with this name')
-  }
-  return await queries.insertMenu({ ...menu, restaurantId })
-}
+export const createMenu = async (menu: MenuData, restaurantId: number): Promise<number> => {}
 
 export const getMenu = async (id: number): Promise<Menu> => {

[Killed] ConditionalExpression
Pichupido/src/menu/menu.service.ts:6:7
 
 export const createMenu = async (menu: MenuData, restaurantId: number): Promise<number> => {
   const currMenu = await queries.getMenuByName(menu.name, restaurantId);
-  if (currMenu) {
+  if (false) {
     throw('There is already menu with this name')
   }

[Killed] ConditionalExpression
Pichupido/src/menu/menu.service.ts:6:7
 
 export const createMenu = async (menu: MenuData, restaurantId: number): Promise<number> => {
   const currMenu = await queries.getMenuByName(menu.name, restaurantId);
-  if (currMenu) {
+  if (true) {
     throw('There is already menu with this name')
   }

[Killed] ObjectLiteral
Pichupido/src/menu/menu.service.ts:9:35
   if (currMenu) {
     throw('There is already menu with this name')
   }
-  return await queries.insertMenu({ ...menu, restaurantId })
+  return await queries.insertMenu({})
 }
 

[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:12:61
   return await queries.insertMenu({ ...menu, restaurantId })
 }
 
-export const getMenu = async (id: number): Promise<Menu> => {
-  const menu = await queries.getMenuById(id);
-  if (!menu) {
-    throw('There is no menu with this id');
-  }
-  return menu;
-}
+export const getMenu = async (id: number): Promise<Menu> => {}
 
 export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {

[Killed] BooleanLiteral
Pichupido/src/menu/menu.service.ts:14:7
 
 export const getMenu = async (id: number): Promise<Menu> => {
   const menu = await queries.getMenuById(id);
-  if (!menu) {
+  if (menu) {
     throw('There is no menu with this id');
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:14:14
 
 export const getMenu = async (id: number): Promise<Menu> => {
   const menu = await queries.getMenuById(id);
-  if (!menu) {
-    throw('There is no menu with this id');
-  }
+  if (!menu) {}
   return menu;
 }

[Killed] StringLiteral
Pichupido/src/menu/menu.service.ts:15:11
 export const getMenu = async (id: number): Promise<Menu> => {
   const menu = await queries.getMenuById(id);
   if (!menu) {
-    throw('There is no menu with this id');
+    throw("");
   }
   return menu;

[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:20:86
   return menu;
 }
 
-export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {
-  return await queries.getMenusByRestaurant(restaurantId);
-}
+export const getMenusByRestaurant = async (restaurantId: number): Promise<Menu[]> => {}
 
 export const updateMenu = async (

[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:28:21
   menu: MenuDataOptional,
   restaurantId: number,
   menuId: number,
-): Promise<void> => {
-  const currMenu = await queries.getMenuById(menuId);
-  if (!currMenu) {
-    throw('There is no menu with this id');
-  }
-  if (currMenu.restaurantId !== restaurantId) {
-    throw('This menu does not belong to your restaurant');
-  }
-  await queries.updateMenu(menu, menuId);
-};
+): Promise<void> => {};
 
 export const deleteMenu = async(restaurantId: number, menuId: number): Promise<void> => {

[Killed] ConditionalExpression
Pichupido/src/menu/menu.service.ts:30:7
   menuId: number,
 ): Promise<void> => {
   const currMenu = await queries.getMenuById(menuId);
-  if (!currMenu) {
+  if (true) {
     throw('There is no menu with this id');
   }

[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:30:18
   menuId: number,
 ): Promise<void> => {
   const currMenu = await queries.getMenuById(menuId);
-  if (!currMenu) {
-    throw('There is no menu with this id');
-  }
+  if (!currMenu) {}
   if (currMenu.restaurantId !== restaurantId) {
     throw('This menu does not belong to your restaurant');

[Killed] EqualityOperator
Pichupido/src/menu/menu.service.ts:33:7
   if (!currMenu) {
     throw('There is no menu with this id');
   }
-  if (currMenu.restaurantId !== restaurantId) {
+  if (currMenu.restaurantId === restaurantId) {
     throw('This menu does not belong to your restaurant');
   }

[Killed] ConditionalExpression
Pichupido/src/menu/menu.service.ts:33:7
   if (!currMenu) {
     throw('There is no menu with this id');
   }
-  if (currMenu.restaurantId !== restaurantId) {
+  if (false) {
     throw('This menu does not belong to your restaurant');
   }

[Killed] StringLiteral
Pichupido/src/menu/menu.service.ts:34:11
     throw('There is no menu with this id');
   }
   if (currMenu.restaurantId !== restaurantId) {
-    throw('This menu does not belong to your restaurant');
+    throw("");
   }
   await queries.updateMenu(menu, menuId);

[Killed] BlockStatement
Pichupido/src/menu/menu.service.ts:39:89
   await queries.updateMenu(menu, menuId);
 };
 
-export const deleteMenu = async(restaurantId: number, menuId: number): Promise<void> => {
-  const currMenu = await queries.getMenuById(menuId);
-  if (!currMenu) {
-    throw('There is no menu with this id');
-  }
-  if (currMenu.restaurantId !== restaurantId) {
-    throw('This menu does not belong to your restaurant');
-  }
-  await queries.deleteMenu(menuId);
-}
+export const deleteMenu = async(restaurantId: number, menuId: number): Promise<void> => {}
 

[Killed] StringLiteral
Pichupido/src/menu/menu.service.ts:42:11
 export const deleteMenu = async(restaurantId: number, menuId: number): Promise<void> => {
   const currMenu = await queries.getMenuById(menuId);
   if (!currMenu) {
-    throw('There is no menu with this id');
+    throw("");
   }
   if (currMenu.restaurantId !== restaurantId) {
