[Killed] ArrayDeclaration
Pichupido/src/menu/menu.validators.ts:9:13
   meta: {
     swagger: {
       summary: 'Add menu',
-      tags: ['menu'],
+      tags: [],
     },
   },

[Killed] StringLiteral
Pichupido/src/menu/menu.validators.ts:9:14
   meta: {
     swagger: {
       summary: 'Add menu',
-      tags: ['menu'],
+      tags: [""],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/menu/menu.validators.ts:33:9
 };
 
 export const getMenu: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Get menu by id',
-      tags: ['menu'],
-    },
-  },
+  meta: {},
   validate: {
     params: {

[Killed] StringLiteral
Pichupido/src/menu/menu.validators.ts:36:14
   meta: {
     swagger: {
       summary: 'Get menu by id',
-      tags: ['menu'],
+      tags: [""],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/menu/menu.validators.ts:63:14
 
 export const getMenusByRestaurant: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Get menus by restaurant',
-      tags: ['menu'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] StringLiteral
Pichupido/src/menu/menu.validators.ts:65:14
   meta: {
     swagger: {
       summary: 'Get menus by restaurant',
-      tags: ['menu'],
+      tags: [""],
     },
   },

[Timeout] ObjectLiteral
Pichupido/src/menu/menu.validators.ts:120:14
 
 export const deleteMenu: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Delete menu',
-      tags: ['menu'],
-    },
+    swagger: {},
   },
   validate: {

[Timeout] ArrayDeclaration
Pichupido/src/menu/menu.validators.ts:122:13
   meta: {
     swagger: {
       summary: 'Delete menu',
-      tags: ['menu'],
+      tags: [],
     },
   },

[Timeout] ObjectLiteral
Pichupido/src/menu/menu.validators.ts:133:12
       204: {
         body: {},
       },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
+      400: {},
     },
   },

[Killed] ObjectLiteral
Pichupido/src/menu/menu.validators.ts:144:14
 
 export const activateMenu: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Set menu status to active',
-      tags: ['menu'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] ObjectLiteral
Pichupido/src/menu/menu.validators.ts:166:46
   },
 }
 
-export const deactivateMenu: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Set menu status to non-active',
-      tags: ['menu'],
-    },
-  },
-  validate: {
-    params: {
-      id: joi.number(),
-    },
-    output: {
-      204: {
-        body: {},
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
-}
+export const deactivateMenu: Router.Config = {}
 
 

[Killed] ArrayDeclaration
Pichupido/src/menu/menu.validators.ts:170:13
   meta: {
     swagger: {
       summary: 'Set menu status to non-active',
-      tags: ['menu'],
+      tags: [],
     },
   },
