[Killed] BlockStatement
Pichupido/src/middlewares/checkAccess.ts:3:90
 import { Middleware } from "koa";
 
-export const checkAccess:  ((role: string) => Middleware) = role => async (ctx, next) => {
-  if (ctx.state.user.role !== role) {
-    return ctx.throw(403, `You must login as ${role} for doing this`);
-  }
-  return next();
-};
+export const checkAccess:  ((role: string) => Middleware) = role => async (ctx, next) => {};
 
 

[Killed] BlockStatement
Pichupido/src/middlewares/checkAccess.ts:4:37
 import { Middleware } from "koa";
 
 export const checkAccess:  ((role: string) => Middleware) = role => async (ctx, next) => {
-  if (ctx.state.user.role !== role) {
-    return ctx.throw(403, `You must login as ${role} for doing this`);
-  }
+  if (ctx.state.user.role !== role) {}
   return next();
 };

[Killed] EqualityOperator
Pichupido/src/middlewares/checkAccess.ts:4:7
 import { Middleware } from "koa";
 
 export const checkAccess:  ((role: string) => Middleware) = role => async (ctx, next) => {
-  if (ctx.state.user.role !== role) {
+  if (ctx.state.user.role === role) {
     return ctx.throw(403, `You must login as ${role} for doing this`);
   }

[Killed] StringLiteral
Pichupido/src/middlewares/checkAccess.ts:5:27
 
 export const checkAccess:  ((role: string) => Middleware) = role => async (ctx, next) => {
   if (ctx.state.user.role !== role) {
-    return ctx.throw(403, `You must login as ${role} for doing this`);
+    return ctx.throw(403, ``);
   }
   return next();
