[Timeout] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:7:7
 const logger = pino({ name: 'server' });
 
 export default async (ctx: Koa.Context, next: () => Promise<void>): Promise<void> => {
-  try {
-    await next();
-  } catch (e) {
+  try {} catch (e) {
     if (process.env.NODE_ENV !== 'test') {
       console.log('ERROR HANDLER: ', e);

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:10:9
   try {
     await next();
   } catch (e) {
-    if (process.env.NODE_ENV !== 'test') {
+    if (true) {
       console.log('ERROR HANDLER: ', e);
     }

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:10:42
   try {
     await next();
   } catch (e) {
-    if (process.env.NODE_ENV !== 'test') {
-      console.log('ERROR HANDLER: ', e);
-    }
+    if (process.env.NODE_ENV !== 'test') {}
     ctx.status = 500;
     switch (true) {

[Killed] BooleanLiteral
Pichupido/src/middlewares/errorCatcher.ts:14:13
       console.log('ERROR HANDLER: ', e);
     }
     ctx.status = 500;
-    switch (true) {
+    switch (false) {
       case e.isJoi && e.status === 500: {
         ctx.status = 400;

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:15:23
     }
     ctx.status = 500;
     switch (true) {
-      case e.isJoi && e.status === 500: {
+      case e.isJoi && false: {
         ctx.status = 400;
         ctx.body = { error: e.message, type: 'OUTPUT_VALIDATION_ERROR' };

[Killed] LogicalOperator
Pichupido/src/middlewares/errorCatcher.ts:15:12
     }
     ctx.status = 500;
     switch (true) {
-      case e.isJoi && e.status === 500: {
+      case e.isJoi || e.status === 500: {
         ctx.status = 400;
         ctx.body = { error: e.message, type: 'OUTPUT_VALIDATION_ERROR' };

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:21:21
         return;
       }
 
-      case e.isJoi: {
-        ctx.body = { error: e.details[0].message, type: 'VALIDATION_ERROR' };
-        ctx.status = 400;
-        break;
-      }
+      case e.isJoi: {}
 
       case e.isPassport: {

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:21:7
         return;
       }
 
-      case e.isJoi: {
-        ctx.body = { error: e.details[0].message, type: 'VALIDATION_ERROR' };
-        ctx.status = 400;
-        break;
-      }
+      case e.isJoi:
 
       case e.isPassport: {

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:27:26
         break;
       }
 
-      case e.isPassport: {
-        ctx.body = { error: e.message, type: 'AUTHENTICATION_SERVICE_ERROR' };
-        ctx.status = 401;
-        break;
-      }
+      case e.isPassport: {}
 
       case e.isCustom: {

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:27:7
         break;
       }
 
-      case e.isPassport: {
-        ctx.body = { error: e.message, type: 'AUTHENTICATION_SERVICE_ERROR' };
-        ctx.status = 401;
-        break;
-      }
+      case e.isPassport:
 
       case e.isCustom: {

[Killed] ObjectLiteral
Pichupido/src/middlewares/errorCatcher.ts:28:20
       }
 
       case e.isPassport: {
-        ctx.body = { error: e.message, type: 'AUTHENTICATION_SERVICE_ERROR' };
+        ctx.body = {};
         ctx.status = 401;
         break;

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:33:7
         break;
       }
 
-      case e.isCustom: {
-        ctx.body = { error: e.message, type: 'CUSTOM_ERROR' };
-        ctx.status = 418;
-        break;
-      }
+      case e.isCustom:
 
       case Array.isArray(e): {

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:33:24
         break;
       }
 
-      case e.isCustom: {
-        ctx.body = { error: e.message, type: 'CUSTOM_ERROR' };
-        ctx.status = 418;
-        break;
-      }
+      case e.isCustom: {}
 
       case Array.isArray(e): {

[Killed] ObjectLiteral
Pichupido/src/middlewares/errorCatcher.ts:34:20
       }
 
       case e.isCustom: {
-        ctx.body = { error: e.message, type: 'CUSTOM_ERROR' };
+        ctx.body = {};
         ctx.status = 418;
         break;

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:39:30
         break;
       }
 
-      case Array.isArray(e): {
-        const fields: {
-          field: string,
-          message: string,
-        }[] = [];
-
-        // eslint-disable-next-line @typescript-eslint/no-explicit-any
-        e.forEach((elem: any) => {
-          fields.push({
-            field: elem.property,
-            message: Object.keys(elem.constraints).map(key => elem.constraints[key])[0],
-          });
-        });
-
-        ctx.body = { error: fields };
-        break;
-      }
+      case Array.isArray(e): {}
 
       case Boolean(e.status): {

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:39:7
         break;
       }
 
-      case Array.isArray(e): {
-        const fields: {
-          field: string,
-          message: string,
-        }[] = [];
-
-        // eslint-disable-next-line @typescript-eslint/no-explicit-any
-        e.forEach((elem: any) => {
-          fields.push({
-            field: elem.property,
-            message: Object.keys(elem.constraints).map(key => elem.constraints[key])[0],
-          });
-        });
-
-        ctx.body = { error: fields };
-        break;
-      }
+      case Array.isArray(e):
 
       case Boolean(e.status): {

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:46:34
         }[] = [];
 
         // eslint-disable-next-line @typescript-eslint/no-explicit-any
-        e.forEach((elem: any) => {
-          fields.push({
-            field: elem.property,
-            message: Object.keys(elem.constraints).map(key => elem.constraints[key])[0],
-          });
-        });
+        e.forEach((elem: any) => {});
 
         ctx.body = { error: fields };

[Killed] ObjectLiteral
Pichupido/src/middlewares/errorCatcher.ts:47:23
 
         // eslint-disable-next-line @typescript-eslint/no-explicit-any
         e.forEach((elem: any) => {
-          fields.push({
-            field: elem.property,
-            message: Object.keys(elem.constraints).map(key => elem.constraints[key])[0],
-          });
+          fields.push({});
         });
 

[Killed] ArrowFunction
Pichupido/src/middlewares/errorCatcher.ts:49:56
         e.forEach((elem: any) => {
           fields.push({
             field: elem.property,
-            message: Object.keys(elem.constraints).map(key => elem.constraints[key])[0],
+            message: Object.keys(elem.constraints).map(() => undefined)[0],
           });
         });

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:57:31
         break;
       }
 
-      case Boolean(e.status): {
-        ctx.status = e.status;
-        ctx.body = { error: e.message };
-        return;
-      }
+      case Boolean(e.status): {}
 
       default: {

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:57:7
         break;
       }
 
-      case Boolean(e.status): {
-        ctx.status = e.status;
-        ctx.body = { error: e.message };
-        return;
-      }
+      case Boolean(e.status):
 
       default: {

[Killed] ObjectLiteral
Pichupido/src/middlewares/errorCatcher.ts:59:20
 
       case Boolean(e.status): {
         ctx.status = e.status;
-        ctx.body = { error: e.message };
+        ctx.body = {};
         return;
       }

[Killed] BlockStatement
Pichupido/src/middlewares/errorCatcher.ts:63:16
         return;
       }
 
-      default: {
-        logger.error(e.message);
-        ctx.app.emit('error', e, ctx);
-        ctx.body = { error: e.message, type: 'UNHANDLED_ERROR' };
-      }
+      default: {}
     }
   }

[Killed] ConditionalExpression
Pichupido/src/middlewares/errorCatcher.ts:63:7
         return;
       }
 
-      default: {
-        logger.error(e.message);
-        ctx.app.emit('error', e, ctx);
-        ctx.body = { error: e.message, type: 'UNHANDLED_ERROR' };
-      }
+      default:
     }
   }

[Killed] ObjectLiteral
Pichupido/src/middlewares/errorCatcher.ts:66:20
       default: {
         logger.error(e.message);
         ctx.app.emit('error', e, ctx);
-        ctx.body = { error: e.message, type: 'UNHANDLED_ERROR' };
+        ctx.body = {};
       }
     }
