[Survived] BlockStatement
src/restaurants/__mocks__/restaurants.queries.ts:8:85
 const db = new DefaultDbMock<Restaurant, RestaurantData & { adminId: number }, RestaurantDataOptional>();
 export const __setDbData = db.__setDbData;
 
-export const getRestaurantByUserId = async (userId: number): Promise<Restaurant> => {
-  return await db.selectOne((restaurant) =>
-    restaurant.adminId === userId
-  );
-}
+export const getRestaurantByUserId = async (userId: number): Promise<Restaurant> => {}
 
 export const getRestaurantById = async (id: number): Promise<Restaurant> => {

[Survived] ArrowFunction
src/restaurants/__mocks__/restaurants.queries.ts:9:29
 export const __setDbData = db.__setDbData;
 
 export const getRestaurantByUserId = async (userId: number): Promise<Restaurant> => {
-  return await db.selectOne((restaurant) =>
-    restaurant.adminId === userId
+  return await db.selectOne(() => undefined
   );
 }

[Survived] ConditionalExpression
src/restaurants/__mocks__/restaurants.queries.ts:10:5
 
 export const getRestaurantByUserId = async (userId: number): Promise<Restaurant> => {
   return await db.selectOne((restaurant) =>
-    restaurant.adminId === userId
+    true
   );
 }

[Survived] ConditionalExpression
src/restaurants/__mocks__/restaurants.queries.ts:10:5
 
 export const getRestaurantByUserId = async (userId: number): Promise<Restaurant> => {
   return await db.selectOne((restaurant) =>
-    restaurant.adminId === userId
+    false
   );
 }

[Survived] BlockStatement
src/restaurants/__mocks__/restaurants.queries.ts:14:77
   );
 }
 
-export const getRestaurantById = async (id: number): Promise<Restaurant> => {
-  return await db.selectOne((restaurant) =>
-    restaurant.id === id
-  );
-}
+export const getRestaurantById = async (id: number): Promise<Restaurant> => {}
 
 export const getAllRestaurants = async (): Promise<Restaurant[]> => {

[Survived] ArrowFunction
src/restaurants/__mocks__/restaurants.queries.ts:15:29
 }
 
 export const getRestaurantById = async (id: number): Promise<Restaurant> => {
-  return await db.selectOne((restaurant) =>
-    restaurant.id === id
+  return await db.selectOne(() => undefined
   );
 }

[Survived] ConditionalExpression
src/restaurants/__mocks__/restaurants.queries.ts:16:5
 
 export const getRestaurantById = async (id: number): Promise<Restaurant> => {
   return await db.selectOne((restaurant) =>
-    restaurant.id === id
+    false
   );
 }

[Survived] EqualityOperator
src/restaurants/__mocks__/restaurants.queries.ts:16:5
 
 export const getRestaurantById = async (id: number): Promise<Restaurant> => {
   return await db.selectOne((restaurant) =>
-    restaurant.id === id
+    restaurant.id !== id
   );
 }

[Survived] BlockStatement
src/restaurants/__mocks__/restaurants.queries.ts:20:69
   );
 }
 
-export const getAllRestaurants = async (): Promise<Restaurant[]> => {
-  return await db.selectMany((_restaurant) => true);
-}
+export const getAllRestaurants = async (): Promise<Restaurant[]> => {}
 
 export const insertRestaurant = db.insert;

[Survived] BooleanLiteral
src/restaurants/__mocks__/restaurants.queries.ts:21:47
 }
 
 export const getAllRestaurants = async (): Promise<Restaurant[]> => {
-  return await db.selectMany((_restaurant) => true);
+  return await db.selectMany((_restaurant) => false);
 }
 

[Survived] ArrowFunction
src/restaurants/__mocks__/restaurants.queries.ts:21:30
 }
 
 export const getAllRestaurants = async (): Promise<Restaurant[]> => {
-  return await db.selectMany((_restaurant) => true);
+  return await db.selectMany(() => undefined);
 }
 
