[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:4:57
 import { Middleware } from 'koa';
 import * as RestaurantsServices from './restaurants.service';
 
-export const getRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await RestaurantsServices.getRestaurant(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getRestaurant: Middleware = async (ctx) => {};
 
 export const getAllRestaurants: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:5:7
 import * as RestaurantsServices from './restaurants.service';
 
 export const getRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await RestaurantsServices.getRestaurant(ctx.params.id);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:7:15
 export const getRestaurant: Middleware = async (ctx) => {
   try {
     ctx.body = await RestaurantsServices.getRestaurant(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:12:61
   }
 };
 
-export const getAllRestaurants: Middleware = async (ctx) => {
-  try {
-    ctx.body = await RestaurantsServices.getAllRestaurants();
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getAllRestaurants: Middleware = async (ctx) => {};
 
 export const createRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:13:7
 };
 
 export const getAllRestaurants: Middleware = async (ctx) => {
-  try {
-    ctx.body = await RestaurantsServices.getAllRestaurants();
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:15:15
 export const getAllRestaurants: Middleware = async (ctx) => {
   try {
     ctx.body = await RestaurantsServices.getAllRestaurants();
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:20:60
   }
 };
 
-export const createRestaurant: Middleware = async (ctx) => {
-  try {
-    const id = await RestaurantsServices.createRestaurant(ctx.request.body, ctx.state.user.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const createRestaurant: Middleware = async (ctx) => {};
 
 export const updateRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:21:7
 };
 
 export const createRestaurant: Middleware = async (ctx) => {
-  try {
-    const id = await RestaurantsServices.createRestaurant(ctx.request.body, ctx.state.user.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.conrollers.ts:23:16
 export const createRestaurant: Middleware = async (ctx) => {
   try {
     const id = await RestaurantsServices.createRestaurant(ctx.request.body, ctx.state.user.id);
-    ctx.body = { id };
+    ctx.body = {};
     ctx.status = 201;
   } catch (e) {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:30:60
   }
 };
 
-export const updateRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await RestaurantsServices.updateRestaurant(ctx.request.body, ctx.state.user.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const updateRestaurant: Middleware = async (ctx) => {};
 
 export const deleteRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:31:7
 };
 
 export const updateRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await RestaurantsServices.updateRestaurant(ctx.request.body, ctx.state.user.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:39:60
   }
 };
 
-export const deleteRestaurant: Middleware = async (ctx) => {
-  try {
-    await RestaurantsServices.deleteRestaurant(ctx.state.user.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const deleteRestaurant: Middleware = async (ctx) => {};
 
 

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.conrollers.ts:40:7
 };
 
 export const deleteRestaurant: Middleware = async (ctx) => {
-  try {
-    await RestaurantsServices.deleteRestaurant(ctx.state.user.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }
