[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.queries.ts:9:17
   id: {},
   name: {},
   location: {},
-  workingHours: { dbAlias: 'working_hours' },
+  workingHours: {},
   logo: { dbAlias: 'logo_url' },
   cover: { dbAlias: 'cover_url' },

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.queries.ts:10:9
   name: {},
   location: {},
   workingHours: { dbAlias: 'working_hours' },
-  logo: { dbAlias: 'logo_url' },
+  logo: {},
   cover: { dbAlias: 'cover_url' },
   adminId: { dbAlias: 'admin_id' },

[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.queries.ts:12:23
   workingHours: { dbAlias: 'working_hours' },
   logo: { dbAlias: 'logo_url' },
   cover: { dbAlias: 'cover_url' },
-  adminId: { dbAlias: 'admin_id' },
+  adminId: { dbAlias: "" },
   description: {},
 };

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.queries.ts:16:84
   description: {},
 };
 
-export const getRestaurantByUserId = async(userId: number): Promise<Restaurant> => {
-  const selectClause = getSelectClause(restaurantProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Restaurant
-  WHERE admin_id = $1
-  `, [userId])).rows[0];
-}
+export const getRestaurantByUserId = async(userId: number): Promise<Restaurant> => {}
 
 export const getAllRestaurants = async(): Promise<Restaurant[]> => {

[Timeout] StringLiteral
Pichupido/src/restaurants/restaurants.queries.ts:18:23
 
 export const getRestaurantByUserId = async(userId: number): Promise<Restaurant> => {
   const selectClause = getSelectClause(restaurantProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Restaurant
-  WHERE admin_id = $1
-  `, [userId])).rows[0];
+  return (await query(``, [userId])).rows[0];
 }
 

[Timeout] BlockStatement
Pichupido/src/restaurants/restaurants.queries.ts:25:68
   `, [userId])).rows[0];
 }
 
-export const getAllRestaurants = async(): Promise<Restaurant[]> => {
-  const selectClause = getSelectClause(restaurantProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Restaurant
-  `)).rows;
-}
+export const getAllRestaurants = async(): Promise<Restaurant[]> => {}
 
 export const getRestaurantById = async(id: number): Promise<Restaurant> => {

[Timeout] BlockStatement
Pichupido/src/restaurants/restaurants.queries.ts:33:76
   `)).rows;
 }
 
-export const getRestaurantById = async(id: number): Promise<Restaurant> => {
-  const selectClause = getSelectClause(restaurantProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Restaurant
-  WHERE id = $1
-  `, [id])).rows[0];
-}
+export const getRestaurantById = async(id: number): Promise<Restaurant> => {}
 
 export const insertRestaurant = async(restaurant: RestaurantData & { adminId: number }): Promise<number> => {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.queries.ts:42:109
   `, [id])).rows[0];
 }
 
-export const insertRestaurant = async(restaurant: RestaurantData & { adminId: number }): Promise<number> => {
-  const [props, values, valueIdxs] = getInsertClauses(restaurant, restaurantProps);
-  return (await query(`
-  INSERT INTO Restaurant(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
-}
+export const insertRestaurant = async(restaurant: RestaurantData & { adminId: number }): Promise<number> => {}
 
 

[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.queries.ts:44:23
 
 export const insertRestaurant = async(restaurant: RestaurantData & { adminId: number }): Promise<number> => {
   const [props, values, valueIdxs] = getInsertClauses(restaurant, restaurantProps);
-  return (await query(`
-  INSERT INTO Restaurant(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
+  return (await query(``, values)).rows[0].id;
 }
 

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.queries.ts:52:105
 }
 
 
-export const updateRestaurant = async(restaurant: RestaurantDataOptional, id: number): Promise<void> => {
-  const [updateClause, values, nextIndx] = getUpdateClauses(restaurant, restaurantProps);
-  await query(`
-  UPDATE Restaurant 
-  SET ${updateClause}
-  WHERE id = $${nextIndx}
-  `, [...values, id]);
-}
+export const updateRestaurant = async(restaurant: RestaurantDataOptional, id: number): Promise<void> => {}
 
 export const deleteRestaurant = async(id: number): Promise<void> => {

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.queries.ts:61:69
   `, [...values, id]);
 }
 
-export const deleteRestaurant = async(id: number): Promise<void> => {
-  await query(`
-  DELETE FROM Restaurant
-  WHERE id = $1
-  `, [id]);
-}
+export const deleteRestaurant = async(id: number): Promise<void> => {}

[Killed] ArrayDeclaration
Pichupido/src/restaurants/restaurants.queries.ts:65:6
   await query(`
   DELETE FROM Restaurant
   WHERE id = $1
-  `, [id]);
+  `, []);
 }
