[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:6:105
 import { checkImage } from '../utils/checkImg';
 import { uploadImage, deleteImage } from '../utils/s3';
 
-export const createRestaurant = async (restaurant: RestaurantData, adminId: number): Promise<number> => {
-  if (await queries.getRestaurantByUserId(adminId)) {
-    throw ('There already is restaurant with this admin');
-  }
-  if (!checkImage(restaurant.logo) || !checkImage(restaurant.cover)) {
-    throw ('Invalid image');
-  }
-  restaurant.cover = await uploadImage(restaurant.cover);
-  restaurant.logo = await uploadImage(restaurant.logo);
-
-  return await queries.insertRestaurant({ ...restaurant, adminId });
-};
+export const createRestaurant = async (restaurant: RestaurantData, adminId: number): Promise<number> => {};
 
 export const getRestaurant = async (id: number): Promise<Restaurant> => {

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:7:7
 import { uploadImage, deleteImage } from '../utils/s3';
 
 export const createRestaurant = async (restaurant: RestaurantData, adminId: number): Promise<number> => {
-  if (await queries.getRestaurantByUserId(adminId)) {
+  if (false) {
     throw ('There already is restaurant with this admin');
   }

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:7:7
 import { uploadImage, deleteImage } from '../utils/s3';
 
 export const createRestaurant = async (restaurant: RestaurantData, adminId: number): Promise<number> => {
-  if (await queries.getRestaurantByUserId(adminId)) {
+  if (true) {
     throw ('There already is restaurant with this admin');
   }

[Killed] BooleanLiteral
Pichupido/src/restaurants/restaurants.service.ts:10:7
   if (await queries.getRestaurantByUserId(adminId)) {
     throw ('There already is restaurant with this admin');
   }
-  if (!checkImage(restaurant.logo) || !checkImage(restaurant.cover)) {
+  if (checkImage(restaurant.logo) || !checkImage(restaurant.cover)) {
     throw ('Invalid image');
   }

[Killed] LogicalOperator
Pichupido/src/restaurants/restaurants.service.ts:10:7
   if (await queries.getRestaurantByUserId(adminId)) {
     throw ('There already is restaurant with this admin');
   }
-  if (!checkImage(restaurant.logo) || !checkImage(restaurant.cover)) {
+  if (!checkImage(restaurant.logo) && !checkImage(restaurant.cover)) {
     throw ('Invalid image');
   }

[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.service.ts:11:12
     throw ('There already is restaurant with this admin');
   }
   if (!checkImage(restaurant.logo) || !checkImage(restaurant.cover)) {
-    throw ('Invalid image');
+    throw ("");
   }
   restaurant.cover = await uploadImage(restaurant.cover);

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:19:73
   return await queries.insertRestaurant({ ...restaurant, adminId });
 };
 
-export const getRestaurant = async (id: number): Promise<Restaurant> => {
-  const restaurant = await queries.getRestaurantById(id);
-  if (!restaurant) throw ('There are no restaurants with this id');
-  return restaurant;
-}
+export const getRestaurant = async (id: number): Promise<Restaurant> => {}
 
 export const getAllRestaurants = async (): Promise<Restaurant[]> => {

[Killed] BooleanLiteral
Pichupido/src/restaurants/restaurants.service.ts:21:7
 
 export const getRestaurant = async (id: number): Promise<Restaurant> => {
   const restaurant = await queries.getRestaurantById(id);
-  if (!restaurant) throw ('There are no restaurants with this id');
+  if (restaurant) throw ('There are no restaurants with this id');
   return restaurant;
 }

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:21:7
 
 export const getRestaurant = async (id: number): Promise<Restaurant> => {
   const restaurant = await queries.getRestaurantById(id);
-  if (!restaurant) throw ('There are no restaurants with this id');
+  if (false) throw ('There are no restaurants with this id');
   return restaurant;
 }

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:25:69
   return restaurant;
 }
 
-export const getAllRestaurants = async (): Promise<Restaurant[]> => {
-  return await queries.getAllRestaurants();
-}
+export const getAllRestaurants = async (): Promise<Restaurant[]> => {}
 
 export const updateRestaurant = async (restaurant: RestaurantDataOptional,

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:32:21
 export const updateRestaurant = async (restaurant: RestaurantDataOptional,
   adminId: number,
   restaurantId: number,
-): Promise<void> => {
-  const currRestaurant = await queries.getRestaurantById(restaurantId)
-  if (!currRestaurant) {
-    throw ('There are no restaurants with this id');
-  }
-  if (currRestaurant.adminId !== adminId) {
-    throw ('Only restaurant admin can update restaurant info');
-  }
-
-  if (restaurant.logo) {
-    if (!checkImage(restaurant.logo)) throw ('Invalid image');
-    restaurant.logo = await uploadImage(restaurant.logo);
-    await deleteImage(currRestaurant.logo);
-  }
-  if (restaurant.cover) {
-    if (!checkImage(restaurant.cover)) throw ('Invalid image');
-    restaurant.cover = await uploadImage(restaurant.cover);
-    await deleteImage(currRestaurant.cover);
-  }
-
-  await queries.updateRestaurant(restaurant, restaurantId);
-};
+): Promise<void> => {};
 
 export const deleteRestaurant = async(adminId: number, restaurantId: number): Promise<void> => {

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:34:7
   restaurantId: number,
 ): Promise<void> => {
   const currRestaurant = await queries.getRestaurantById(restaurantId)
-  if (!currRestaurant) {
+  if (false) {
     throw ('There are no restaurants with this id');
   }

[Killed] BooleanLiteral
Pichupido/src/restaurants/restaurants.service.ts:34:7
   restaurantId: number,
 ): Promise<void> => {
   const currRestaurant = await queries.getRestaurantById(restaurantId)
-  if (!currRestaurant) {
+  if (currRestaurant) {
     throw ('There are no restaurants with this id');
   }

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:37:7
   if (!currRestaurant) {
     throw ('There are no restaurants with this id');
   }
-  if (currRestaurant.adminId !== adminId) {
+  if (false) {
     throw ('Only restaurant admin can update restaurant info');
   }

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:37:43
   if (!currRestaurant) {
     throw ('There are no restaurants with this id');
   }
-  if (currRestaurant.adminId !== adminId) {
-    throw ('Only restaurant admin can update restaurant info');
-  }
+  if (currRestaurant.adminId !== adminId) {}
 
   if (restaurant.logo) {

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:41:7
     throw ('Only restaurant admin can update restaurant info');
   }
 
-  if (restaurant.logo) {
+  if (false) {
     if (!checkImage(restaurant.logo)) throw ('Invalid image');
     restaurant.logo = await uploadImage(restaurant.logo);

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:41:24
     throw ('Only restaurant admin can update restaurant info');
   }
 
-  if (restaurant.logo) {
-    if (!checkImage(restaurant.logo)) throw ('Invalid image');
-    restaurant.logo = await uploadImage(restaurant.logo);
-    await deleteImage(currRestaurant.logo);
-  }
+  if (restaurant.logo) {}
   if (restaurant.cover) {
     if (!checkImage(restaurant.cover)) throw ('Invalid image');

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:42:9
   }
 
   if (restaurant.logo) {
-    if (!checkImage(restaurant.logo)) throw ('Invalid image');
+    if (false) throw ('Invalid image');
     restaurant.logo = await uploadImage(restaurant.logo);
     await deleteImage(currRestaurant.logo);

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:42:9
   }
 
   if (restaurant.logo) {
-    if (!checkImage(restaurant.logo)) throw ('Invalid image');
+    if (true) throw ('Invalid image');
     restaurant.logo = await uploadImage(restaurant.logo);
     await deleteImage(currRestaurant.logo);

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:46:7
     restaurant.logo = await uploadImage(restaurant.logo);
     await deleteImage(currRestaurant.logo);
   }
-  if (restaurant.cover) {
+  if (false) {
     if (!checkImage(restaurant.cover)) throw ('Invalid image');
     restaurant.cover = await uploadImage(restaurant.cover);

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:46:7
     restaurant.logo = await uploadImage(restaurant.logo);
     await deleteImage(currRestaurant.logo);
   }
-  if (restaurant.cover) {
+  if (true) {
     if (!checkImage(restaurant.cover)) throw ('Invalid image');
     restaurant.cover = await uploadImage(restaurant.cover);

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:47:9
     await deleteImage(currRestaurant.logo);
   }
   if (restaurant.cover) {
-    if (!checkImage(restaurant.cover)) throw ('Invalid image');
+    if (false) throw ('Invalid image');
     restaurant.cover = await uploadImage(restaurant.cover);
     await deleteImage(currRestaurant.cover);

[Timeout] BooleanLiteral
Pichupido/src/restaurants/restaurants.service.ts:47:9
     await deleteImage(currRestaurant.logo);
   }
   if (restaurant.cover) {
-    if (!checkImage(restaurant.cover)) throw ('Invalid image');
+    if (checkImage(restaurant.cover)) throw ('Invalid image');
     restaurant.cover = await uploadImage(restaurant.cover);
     await deleteImage(currRestaurant.cover);

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:55:96
   await queries.updateRestaurant(restaurant, restaurantId);
 };
 
-export const deleteRestaurant = async(adminId: number, restaurantId: number): Promise<void> => {
-  const restaurant = await queries.getRestaurantById(restaurantId)
-  if (!restaurant) {
-    throw ('There are no restaurants with this id');
-  }
-  if (restaurant.adminId !== adminId) {
-    throw ('Only restaurant admin can delete restaurant');
-  }
-
-  await deleteImage(restaurant.logo);
-  await deleteImage(restaurant.cover);
-  await queries.deleteRestaurant(restaurantId);
-}
+export const deleteRestaurant = async(adminId: number, restaurantId: number): Promise<void> => {}
 

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:57:20
 
 export const deleteRestaurant = async(adminId: number, restaurantId: number): Promise<void> => {
   const restaurant = await queries.getRestaurantById(restaurantId)
-  if (!restaurant) {
-    throw ('There are no restaurants with this id');
-  }
+  if (!restaurant) {}
   if (restaurant.adminId !== adminId) {
     throw ('Only restaurant admin can delete restaurant');

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:57:7
 
 export const deleteRestaurant = async(adminId: number, restaurantId: number): Promise<void> => {
   const restaurant = await queries.getRestaurantById(restaurantId)
-  if (!restaurant) {
+  if (true) {
     throw ('There are no restaurants with this id');
   }

[Killed] ConditionalExpression
Pichupido/src/restaurants/restaurants.service.ts:60:7
   if (!restaurant) {
     throw ('There are no restaurants with this id');
   }
-  if (restaurant.adminId !== adminId) {
+  if (false) {
     throw ('Only restaurant admin can delete restaurant');
   }

[Killed] BlockStatement
Pichupido/src/restaurants/restaurants.service.ts:60:39
   if (!restaurant) {
     throw ('There are no restaurants with this id');
   }
-  if (restaurant.adminId !== adminId) {
-    throw ('Only restaurant admin can delete restaurant');
-  }
+  if (restaurant.adminId !== adminId) {}
 
   await deleteImage(restaurant.logo);

[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.service.ts:61:12
     throw ('There are no restaurants with this id');
   }
   if (restaurant.adminId !== adminId) {
-    throw ('Only restaurant admin can delete restaurant');
+    throw ("");
   }
 
