[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.validators.ts:9:14
   meta: {
     swagger: {
       summary: 'Add restaurant',
-      tags: ['restaurants'],
+      tags: [""],
     },
   },

[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.validators.ts:41:14
   meta: {
     swagger: {
       summary: 'Get restaurant by id',
-      tags: ['restaurants'],
+      tags: [""],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.validators.ts:48:13
     params: {
       id: joi.number(),
     },
-    output: {
-      200: {
-        body: {
-          id: joi.number(),
-          name: joi.string(),
-          adminId: joi.number(),
-          logo: joi.string(),
-          cover: joi.string(),
-          workingHours: joi.string(),
-          location: joi.string(),
-          description: joi.string(),
-        },
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Killed] StringLiteral
Pichupido/src/restaurants/restaurants.validators.ts:74:14
   meta: {
     swagger: {
       summary: 'Get all restaurants',
-      tags: ['restaurants'],
+      tags: [""],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.validators.ts:81:13
     params: {
       id: joi.number(),
     },
-    output: {
-      200: {
-        body: joi.array().items({
-          id: joi.number(),
-          name: joi.string(),
-          adminId: joi.number(),
-          logo: joi.string(),
-          cover: joi.string(),
-          workingHours: joi.string(),
-          location: joi.string(),
-          description: joi.string(),
-        }),
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.validators.ts:83:33
     },
     output: {
       200: {
-        body: joi.array().items({
-          id: joi.number(),
-          name: joi.string(),
-          adminId: joi.number(),
-          logo: joi.string(),
-          cover: joi.string(),
-          workingHours: joi.string(),
-          location: joi.string(),
-          description: joi.string(),
-        }),
+        body: joi.array().items({}),
       },
       400: {

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.validators.ts:104:9
 };
 
 export const updateRestaurant: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Update restaurant',
-      tags: ['restaurants'],
-    },
-  },
+  meta: {},
   validate: {
     type: 'json',

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.validators.ts:105:14
 
 export const updateRestaurant: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Update restaurant',
-      tags: ['restaurants'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] ArrayDeclaration
Pichupido/src/restaurants/restaurants.validators.ts:107:13
   meta: {
     swagger: {
       summary: 'Update restaurant',
-      tags: ['restaurants'],
+      tags: [],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/restaurants/restaurants.validators.ts:112:11
   },
   validate: {
     type: 'json',
-    body: {
-      name: joi.string(),
-      logo: joi.string(),
-      cover: joi.string(),
-      workingHours: joi.string(),
-      location: joi.string(),
-      description: joi.string(),
-    },
+    body: {},
     params: {
       id: joi.number(),
