[Survived] BlockStatement
src/sections/__mocks__/sections.queries.ts:8:97
 const db = new DefaultDbMock<Section, SectionData & { restaurantId: number }, SectionDataOptional>();
 export const __setDbData = db.__setDbData;
 
-export const getSectionByName = async (name: string, restaurantId: number): Promise<Section> => {
-  return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
-  );
-};
+export const getSectionByName = async (name: string, restaurantId: number): Promise<Section> => {};
 
 export const getSectionById = async (id: number): Promise<Section> => {

[Survived] ArrowFunction
src/sections/__mocks__/sections.queries.ts:9:29
 export const __setDbData = db.__setDbData;
 
 export const getSectionByName = async (name: string, restaurantId: number): Promise<Section> => {
-  return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
+  return await db.selectOne(() => undefined
   );
 };

[Survived] EqualityOperator
src/sections/__mocks__/sections.queries.ts:10:30
 
 export const getSectionByName = async (name: string, restaurantId: number): Promise<Section> => {
   return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
+    section.name === name && section.restaurantId !== restaurantId
   );
 };

[Survived] EqualityOperator
src/sections/__mocks__/sections.queries.ts:10:5
 
 export const getSectionByName = async (name: string, restaurantId: number): Promise<Section> => {
   return await db.selectOne((section) =>
-    section.name === name && section.restaurantId === restaurantId
+    section.name !== name && section.restaurantId === restaurantId
   );
 };

[Survived] BlockStatement
src/sections/__mocks__/sections.queries.ts:14:71
   );
 };
 
-export const getSectionById = async (id: number): Promise<Section> => {
-  return await db.selectOne((section) =>
-    section.id === id
-  );
-}
+export const getSectionById = async (id: number): Promise<Section> => {}
 
 export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {

[Survived] ArrowFunction
src/sections/__mocks__/sections.queries.ts:15:29
 };
 
 export const getSectionById = async (id: number): Promise<Section> => {
-  return await db.selectOne((section) =>
-    section.id === id
+  return await db.selectOne(() => undefined
   );
 }

[Survived] EqualityOperator
src/sections/__mocks__/sections.queries.ts:16:5
 
 export const getSectionById = async (id: number): Promise<Section> => {
   return await db.selectOne((section) =>
-    section.id === id
+    section.id !== id
   );
 }

[Survived] BlockStatement
src/sections/__mocks__/sections.queries.ts:20:91
   );
 }
 
-export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {
-  return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
-  );
-}
+export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {}
 
 export const insertSection = db.insert;

[Survived] ArrowFunction
src/sections/__mocks__/sections.queries.ts:21:30
 }
 
 export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {
-  return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
+  return await db.selectMany(() => undefined
   );
 }

[Survived] EqualityOperator
src/sections/__mocks__/sections.queries.ts:22:5
 
 export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {
   return await db.selectMany((section) =>
-    section.restaurantId === restaurantId
+    section.restaurantId !== restaurantId
   );
 }
