[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:4:54
 import { Middleware } from 'koa';
 import * as SectionsServices from './sections.service';
 
-export const getSection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await SectionsServices.getSection(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getSection: Middleware = async (ctx) => {};
 
 export const getSectionByRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:5:7
 import * as SectionsServices from './sections.service';
 
 export const getSection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await SectionsServices.getSection(ctx.params.id);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:7:15
 export const getSection: Middleware = async (ctx) => {
   try {
     ctx.body = await SectionsServices.getSection(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:12:66
   }
 };
 
-export const getSectionByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await SectionsServices.getSectionByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getSectionByRestaurant: Middleware = async (ctx) => {};
 
 export const createSection: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:13:7
 };
 
 export const getSectionByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await SectionsServices.getSectionByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:15:15
 export const getSectionByRestaurant: Middleware = async (ctx) => {
   try {
     ctx.body = await SectionsServices.getSectionByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:20:57
   }
 };
 
-export const createSection: Middleware = async (ctx) => {
-  try {
-    const id = await SectionsServices.createSection(ctx.request.body, ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const createSection: Middleware = async (ctx) => {};
 
 export const updateSection: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:21:7
 };
 
 export const createSection: Middleware = async (ctx) => {
-  try {
-    const id = await SectionsServices.createSection(ctx.request.body, ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:30:57
   }
 };
 
-export const updateSection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await SectionsServices.updateSection(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const updateSection: Middleware = async (ctx) => {};
 
 export const deleteSection: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:31:7
 };
 
 export const updateSection: Middleware = async (ctx) => {
-  try {
-    ctx.body = await SectionsServices.updateSection(ctx.request.body, ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:39:57
   }
 };
 
-export const deleteSection: Middleware = async (ctx) => {
-  try {
-    await SectionsServices.deleteSection(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const deleteSection: Middleware = async (ctx) => {};
 
 

[Killed] BlockStatement
Pichupido/src/sections/sections.controllers.ts:40:7
 };
 
 export const deleteSection: Middleware = async (ctx) => {
-  try {
-    await SectionsServices.deleteSection(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }
