[Killed] ObjectLiteral
Pichupido/src/sections/sections.queries.ts:8:17
 const sectionProps = {
   id: {},
   name: {},
-  restaurantId: { dbAlias: 'restaurant_id' },
+  restaurantId: {},
 };
 

[Killed] BlockStatement
Pichupido/src/sections/sections.queries.ts:11:96
   restaurantId: { dbAlias: 'restaurant_id' },
 };
 
-export const getSectionByName = async(name: string, restaurantId: number): Promise<Section> => {
-  const selectClause = getSelectClause(sectionProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish_section
-  WHERE name = $1
-  AND restaurant_id = $2
-  `, [name, restaurantId])).rows[0];
-}
+export const getSectionByName = async(name: string, restaurantId: number): Promise<Section> => {}
 
 export const getSectionById = async(id: number): Promise<Section> => {

[Killed] StringLiteral
Pichupido/src/sections/sections.queries.ts:13:23
 
 export const getSectionByName = async(name: string, restaurantId: number): Promise<Section> => {
   const selectClause = getSelectClause(sectionProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish_section
-  WHERE name = $1
-  AND restaurant_id = $2
-  `, [name, restaurantId])).rows[0];
+  return (await query(``, [name, restaurantId])).rows[0];
 }
 

[Killed] BlockStatement
Pichupido/src/sections/sections.queries.ts:21:70
   `, [name, restaurantId])).rows[0];
 }
 
-export const getSectionById = async(id: number): Promise<Section> => {
-  const selectClause = getSelectClause(sectionProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish_section
-  WHERE id = $1
-  `, [id])).rows[0];
-}
+export const getSectionById = async(id: number): Promise<Section> => {}
 
 export const getSectionByRestaurant = async(restaurantId: number): Promise<Section[]> => {

[Killed] BlockStatement
Pichupido/src/sections/sections.queries.ts:30:90
   `, [id])).rows[0];
 }
 
-export const getSectionByRestaurant = async(restaurantId: number): Promise<Section[]> => {
-  const selectClause = getSelectClause(sectionProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM Dish_section
-  WHERE restaurant_id = $1
-  `, [restaurantId])).rows;
-}
+export const getSectionByRestaurant = async(restaurantId: number): Promise<Section[]> => {}
 
 export const insertSection = async(section: SectionData & { restaurantId: number }): Promise<number> => {

[Killed] BlockStatement
Pichupido/src/sections/sections.queries.ts:39:105
   `, [restaurantId])).rows;
 }
 
-export const insertSection = async(section: SectionData & { restaurantId: number }): Promise<number> => {
-  const [props, values, valueIdxs] = getInsertClauses(section, sectionProps);
-  return (await query(`
-  INSERT INTO Dish_section(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
-}
+export const insertSection = async(section: SectionData & { restaurantId: number }): Promise<number> => {}
 
 

[Killed] BlockStatement
Pichupido/src/sections/sections.queries.ts:49:96
 }
 
 
-export const updateSection = async(section: SectionDataOptional, id: number): Promise<void> => {
-  const [updateClause, values, nextIndx] = getUpdateClauses(section, sectionProps);
-  await query(`
-  UPDATE Dish_section 
-  SET ${updateClause}
-  WHERE id = $${nextIndx}
-  `, [...values, id]);
-}
+export const updateSection = async(section: SectionDataOptional, id: number): Promise<void> => {}
 
 export const deleteSection = async(id: number): Promise<void> => {

[Timeout] BlockStatement
Pichupido/src/sections/sections.queries.ts:58:66
   `, [...values, id]);
 }
 
-export const deleteSection = async(id: number): Promise<void> => {
-  await query(`
-  DELETE FROM Dish_section
-  WHERE id = $1
-  `, [id]);
-}
+export const deleteSection = async(id: number): Promise<void> => {}
