[Killed] StringLiteral
Pichupido/src/sections/sections.routers.ts:10:3
 const sectionsRouter = Router();
 
 sectionsRouter.get(
-  '/restaurants/:restaurantId/sections',
+  "",
   SectionsValidator.getSectionByRestaurant,
   SectionsControllers.getSectionByRestaurant,
