[Killed] BlockStatement
Pichupido/src/sections/sections.service.ts:4:101
 import * as queries from './sections.queries';
 import { Section, SectionData, SectionDataOptional } from './sections.types';
 
-export const createSection = async (section: SectionData, restaurantId: number): Promise<number> => {
-  const currSection = await queries.getSectionByName(section.name, restaurantId);
-  if (currSection) {
-    throw('There is already section with this name')
-  }
-  return await queries.insertSection({ ...section, restaurantId })
-}
+export const createSection = async (section: SectionData, restaurantId: number): Promise<number> => {}
 
 export const getSection = async (id: number): Promise<Section> => {

[Killed] ConditionalExpression
Pichupido/src/sections/sections.service.ts:6:7
 
 export const createSection = async (section: SectionData, restaurantId: number): Promise<number> => {
   const currSection = await queries.getSectionByName(section.name, restaurantId);
-  if (currSection) {
+  if (true) {
     throw('There is already section with this name')
   }

[Killed] ConditionalExpression
Pichupido/src/sections/sections.service.ts:6:7
 
 export const createSection = async (section: SectionData, restaurantId: number): Promise<number> => {
   const currSection = await queries.getSectionByName(section.name, restaurantId);
-  if (currSection) {
+  if (false) {
     throw('There is already section with this name')
   }

[Killed] StringLiteral
Pichupido/src/sections/sections.service.ts:7:11
 export const createSection = async (section: SectionData, restaurantId: number): Promise<number> => {
   const currSection = await queries.getSectionByName(section.name, restaurantId);
   if (currSection) {
-    throw('There is already section with this name')
+    throw("")
   }
   return await queries.insertSection({ ...section, restaurantId })

[Killed] BlockStatement
Pichupido/src/sections/sections.service.ts:12:67
   return await queries.insertSection({ ...section, restaurantId })
 }
 
-export const getSection = async (id: number): Promise<Section> => {
-  const section = await queries.getSectionById(id);
-  if (!section) {
-    throw('There is no section with this id');
-  }
-  return section;
-}
+export const getSection = async (id: number): Promise<Section> => {}
 
 export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {

[Killed] BlockStatement
Pichupido/src/sections/sections.service.ts:14:17
 
 export const getSection = async (id: number): Promise<Section> => {
   const section = await queries.getSectionById(id);
-  if (!section) {
-    throw('There is no section with this id');
-  }
+  if (!section) {}
   return section;
 }

[Killed] ConditionalExpression
Pichupido/src/sections/sections.service.ts:14:7
 
 export const getSection = async (id: number): Promise<Section> => {
   const section = await queries.getSectionById(id);
-  if (!section) {
+  if (false) {
     throw('There is no section with this id');
   }

[Killed] StringLiteral
Pichupido/src/sections/sections.service.ts:15:11
 export const getSection = async (id: number): Promise<Section> => {
   const section = await queries.getSectionById(id);
   if (!section) {
-    throw('There is no section with this id');
+    throw("");
   }
   return section;

[Killed] BlockStatement
Pichupido/src/sections/sections.service.ts:20:91
   return section;
 }
 
-export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {
-  return await queries.getSectionByRestaurant(restaurantId);
-}
+export const getSectionByRestaurant = async (restaurantId: number): Promise<Section[]> => {}
 
 export const updateSection = async (

[Killed] BlockStatement
Pichupido/src/sections/sections.service.ts:28:21
   section: SectionDataOptional,
   restaurantId: number,
   sectionId: number,
-): Promise<void> => {
-  const currSection = await queries.getSectionById(sectionId);
-  if (!currSection) {
-    throw('There is no section with this id');
-  }
-  if (currSection.restaurantId !== restaurantId) {
-    throw('This section does not belong to your restaurant');
-  }
-  await queries.updateSection(section, sectionId);
-};
+): Promise<void> => {};
 
 export const deleteSection = async(restaurantId: number, sectionId: number): Promise<void> => {

[Timeout] ConditionalExpression
Pichupido/src/sections/sections.service.ts:30:7
   sectionId: number,
 ): Promise<void> => {
   const currSection = await queries.getSectionById(sectionId);
-  if (!currSection) {
+  if (true) {
     throw('There is no section with this id');
   }

[Timeout] ConditionalExpression
Pichupido/src/sections/sections.service.ts:30:7
   sectionId: number,
 ): Promise<void> => {
   const currSection = await queries.getSectionById(sectionId);
-  if (!currSection) {
+  if (false) {
     throw('There is no section with this id');
   }

[Timeout] StringLiteral
Pichupido/src/sections/sections.service.ts:31:11
 ): Promise<void> => {
   const currSection = await queries.getSectionById(sectionId);
   if (!currSection) {
-    throw('There is no section with this id');
+    throw("");
   }
   if (currSection.restaurantId !== restaurantId) {

[Timeout] ConditionalExpression
Pichupido/src/sections/sections.service.ts:33:7
   if (!currSection) {
     throw('There is no section with this id');
   }
-  if (currSection.restaurantId !== restaurantId) {
+  if (false) {
     throw('This section does not belong to your restaurant');
   }

[Timeout] BlockStatement
Pichupido/src/sections/sections.service.ts:33:50
   if (!currSection) {
     throw('There is no section with this id');
   }
-  if (currSection.restaurantId !== restaurantId) {
-    throw('This section does not belong to your restaurant');
-  }
+  if (currSection.restaurantId !== restaurantId) {}
   await queries.updateSection(section, sectionId);
 };

[Timeout] StringLiteral
Pichupido/src/sections/sections.service.ts:34:11
     throw('There is no section with this id');
   }
   if (currSection.restaurantId !== restaurantId) {
-    throw('This section does not belong to your restaurant');
+    throw("");
   }
   await queries.updateSection(section, sectionId);

[Timeout] BlockStatement
Pichupido/src/sections/sections.service.ts:39:95
   await queries.updateSection(section, sectionId);
 };
 
-export const deleteSection = async(restaurantId: number, sectionId: number): Promise<void> => {
-  const currSection = await queries.getSectionById(sectionId);
-  if (!currSection) {
-    throw('There is no section with this id');
-  }
-  if (currSection.restaurantId !== restaurantId) {
-    throw('This section does not belong to your restaurant');
-  }
-  await queries.deleteSection(sectionId);
-}
+export const deleteSection = async(restaurantId: number, sectionId: number): Promise<void> => {}
 

[Killed] BooleanLiteral
Pichupido/src/sections/sections.service.ts:41:7
 
 export const deleteSection = async(restaurantId: number, sectionId: number): Promise<void> => {
   const currSection = await queries.getSectionById(sectionId);
-  if (!currSection) {
+  if (currSection) {
     throw('There is no section with this id');
   }

[Killed] ConditionalExpression
Pichupido/src/sections/sections.service.ts:44:7
   if (!currSection) {
     throw('There is no section with this id');
   }
-  if (currSection.restaurantId !== restaurantId) {
+  if (true) {
     throw('This section does not belong to your restaurant');
   }
