[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:7:14
 
 export const createSection: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Add section',
-      tags: ['sections'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:33:9
 };
 
 export const getSection: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Get section by id',
-      tags: ['sections'],
-    },
-  },
+  meta: {},
   validate: {
     params: {

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:40:13
     },
   },
   validate: {
-    params: {
-      id: joi.number(),
-    },
+    params: {},
     output: {
       200: {

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:43:13
     params: {
       id: joi.number(),
     },
-    output: {
-      200: {
-        body: {
-          id: joi.number(),
-          restaurantId: joi.number(),
-          name: joi.string(),
-        },
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:62:14
 
 export const getSectionByRestaurant: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Get section by restaurant',
-      tags: ['sections'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] StringLiteral
Pichupido/src/sections/sections.validators.ts:64:14
   meta: {
     swagger: {
       summary: 'Get section by restaurant',
-      tags: ['sections'],
+      tags: [""],
     },
   },

[Killed] ArrayDeclaration
Pichupido/src/sections/sections.validators.ts:64:13
   meta: {
     swagger: {
       summary: 'Get section by restaurant',
-      tags: ['sections'],
+      tags: [],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:67:13
       tags: ['sections'],
     },
   },
-  validate: {
-    params: {
-      restaurantId: joi.number(),
-    },
-    output: {
-      200: {
-        body: joi.array().items({
-          id: joi.number(),
-          restaurantId: joi.number(),
-          name: joi.string(),
-        }),
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
+  validate: {},
 };
 

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:73:33
     },
     output: {
       200: {
-        body: joi.array().items({
-          id: joi.number(),
-          restaurantId: joi.number(),
-          name: joi.string(),
-        }),
+        body: joi.array().items({}),
       },
       400: {

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:90:14
 
 export const updateSection: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Update section',
-      tags: ['sections'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:95:13
       tags: ['sections'],
     },
   },
-  validate: {
-    type: 'json',
-    body: {
-      name: joi.string(),
-    },
-    params: {
-      id: joi.number(),
-    },
-    output: {
-      204: {
-        body: {},
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
+  validate: {},
 }
 

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:97:11
   },
   validate: {
     type: 'json',
-    body: {
-      name: joi.string(),
-    },
+    body: {},
     params: {
       id: joi.number(),

[Killed] ObjectLiteral
Pichupido/src/sections/sections.validators.ts:116:45
   },
 }
 
-export const deleteSection: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Delete section',
-      tags: ['sections'],
-    },
-  },
-  validate: {
-    params: {
-      id: joi.number(),
-    },
-    output: {
-      204: {
-        body: {},
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
-}
+export const deleteSection: Router.Config = {}
 
 

[Killed] StringLiteral
Pichupido/src/sections/sections.validators.ts:119:16
 export const deleteSection: Router.Config = {
   meta: {
     swagger: {
-      summary: 'Delete section',
+      summary: "",
       tags: ['sections'],
     },

[Killed] StringLiteral
Pichupido/src/sections/sections.validators.ts:120:14
   meta: {
     swagger: {
       summary: 'Delete section',
-      tags: ['sections'],
+      tags: [""],
     },
   },
