[Survived] StringLiteral
Repos/Pichupido/src/server.ts:4:25
 import config from 'config';
 
 import { app, start } from './app';
-const port = config.get('server.port');
+const port = config.get("");
 start(app, (server) => {
   server.listen(port, () => {

[Survived] BlockStatement
Repos/Pichupido/src/server.ts:5:24
 
 import { app, start } from './app';
 const port = config.get('server.port');
-start(app, (server) => {
-  server.listen(port, () => {
-    console.log(`Server running on port ${port}`);
-  });
-});
+start(app, (server) => {});
 

[Survived] BlockStatement
Repos/Pichupido/src/server.ts:6:29
 import { app, start } from './app';
 const port = config.get('server.port');
 start(app, (server) => {
-  server.listen(port, () => {
-    console.log(`Server running on port ${port}`);
-  });
+  server.listen(port, () => {});
 });
 

[Survived] StringLiteral
Repos/Pichupido/src/server.ts:7:17
 const port = config.get('server.port');
 start(app, (server) => {
   server.listen(port, () => {
-    console.log(`Server running on port ${port}`);
+    console.log(``);
   });
 });
