[Survived] BlockStatement
src/tables/__mocks__/tables.queries.ts:8:67
 const db = new DefaultDbMock<Table, { restaurantId: number }, { url?: string, qrCodeUrl?: string }>();
 export const __setDbData = db.__setDbData;
 
-export const getTableById = async (id: number): Promise<Table> => {
-  return await db.selectOne((table) =>
-    table.id === id
-  );
-}
+export const getTableById = async (id: number): Promise<Table> => {}
 
 export const getTableByRestaurant = async (restaurantId: number): Promise<Table[]> => {

[Survived] ArrowFunction
src/tables/__mocks__/tables.queries.ts:9:29
 export const __setDbData = db.__setDbData;
 
 export const getTableById = async (id: number): Promise<Table> => {
-  return await db.selectOne((table) =>
-    table.id === id
+  return await db.selectOne(() => undefined
   );
 }

[Survived] ConditionalExpression
src/tables/__mocks__/tables.queries.ts:10:5
 
 export const getTableById = async (id: number): Promise<Table> => {
   return await db.selectOne((table) =>
-    table.id === id
+    true
   );
 }

[Survived] EqualityOperator
src/tables/__mocks__/tables.queries.ts:10:5
 
 export const getTableById = async (id: number): Promise<Table> => {
   return await db.selectOne((table) =>
-    table.id === id
+    table.id !== id
   );
 }

[Survived] BlockStatement
src/tables/__mocks__/tables.queries.ts:14:87
   );
 }
 
-export const getTableByRestaurant = async (restaurantId: number): Promise<Table[]> => {
-  return await db.selectMany((table) =>
-    table.restaurantId === restaurantId
-  );
-}
+export const getTableByRestaurant = async (restaurantId: number): Promise<Table[]> => {}
 
 export const insertTable = db.insert;

[Survived] ArrowFunction
src/tables/__mocks__/tables.queries.ts:15:30
 }
 
 export const getTableByRestaurant = async (restaurantId: number): Promise<Table[]> => {
-  return await db.selectMany((table) =>
-    table.restaurantId === restaurantId
+  return await db.selectMany(() => undefined
   );
 }

[Survived] ConditionalExpression
src/tables/__mocks__/tables.queries.ts:16:5
 
 export const getTableByRestaurant = async (restaurantId: number): Promise<Table[]> => {
   return await db.selectMany((table) =>
-    table.restaurantId === restaurantId
+    true
   );
 }

[Survived] ConditionalExpression
src/tables/__mocks__/tables.queries.ts:16:5
 
 export const getTableByRestaurant = async (restaurantId: number): Promise<Table[]> => {
   return await db.selectMany((table) =>
-    table.restaurantId === restaurantId
+    false
   );
 }

[Survived] BlockStatement
src/tables/__mocks__/tables.queries.ts:22:100
 
 export const insertTable = db.insert;
 
-export const setUrl = async (_tableId: number, _url: string, _qrCodeUrl: string): Promise<void> => {
-  return;
-}
+export const setUrl = async (_tableId: number, _url: string, _qrCodeUrl: string): Promise<void> => {}
 
 export const deleteTable = db.delete;
