[Killed] BlockStatement
Pichupido/src/tables/tables.controllers.ts:4:52
 import { Middleware } from 'koa';
 import * as TablesServices from './tables.service';
 
-export const getTable: Middleware = async (ctx) => {
-  try {
-    ctx.body = await TablesServices.getTable(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getTable: Middleware = async (ctx) => {};
 
 export const getTablesByRestaurant: Middleware = async (ctx) => {

[Killed] BlockStatement
Pichupido/src/tables/tables.controllers.ts:5:7
 import * as TablesServices from './tables.service';
 
 export const getTable: Middleware = async (ctx) => {
-  try {
-    ctx.body = await TablesServices.getTable(ctx.params.id);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Killed] BlockStatement
Pichupido/src/tables/tables.controllers.ts:7:15
 export const getTable: Middleware = async (ctx) => {
   try {
     ctx.body = await TablesServices.getTable(ctx.params.id);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Killed] BlockStatement
Pichupido/src/tables/tables.controllers.ts:12:65
   }
 };
 
-export const getTablesByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await TablesServices.getTablesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const getTablesByRestaurant: Middleware = async (ctx) => {};
 
 export const createTable: Middleware = async (ctx) => {

[Timeout] BlockStatement
Pichupido/src/tables/tables.controllers.ts:13:7
 };
 
 export const getTablesByRestaurant: Middleware = async (ctx) => {
-  try {
-    ctx.body = await TablesServices.getTablesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Timeout] BlockStatement
Pichupido/src/tables/tables.controllers.ts:15:15
 export const getTablesByRestaurant: Middleware = async (ctx) => {
   try {
     ctx.body = await TablesServices.getTablesByRestaurant(ctx.params.restaurantId);
-  } catch (e) {
-    ctx.throw(400, e);
-  }
+  } catch (e) {}
 };
 

[Timeout] BlockStatement
Pichupido/src/tables/tables.controllers.ts:20:55
   }
 };
 
-export const createTable: Middleware = async (ctx) => {
-  try {
-    const id = await TablesServices.createTable(ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const createTable: Middleware = async (ctx) => {};
 
 export const deleteTable: Middleware = async (ctx) => {

[Timeout] BlockStatement
Pichupido/src/tables/tables.controllers.ts:21:7
 };
 
 export const createTable: Middleware = async (ctx) => {
-  try {
-    const id = await TablesServices.createTable(ctx.state.restaurant.id);
-    ctx.body = { id };
-    ctx.status = 201;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }

[Timeout] BlockStatement
Pichupido/src/tables/tables.controllers.ts:30:55
   }
 };
 
-export const deleteTable: Middleware = async (ctx) => {
-  try {
-    await TablesServices.deleteTable(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
-    ctx.throw(400, e);
-  }
-};
+export const deleteTable: Middleware = async (ctx) => {};

[Timeout] BlockStatement
Pichupido/src/tables/tables.controllers.ts:31:7
 };
 
 export const deleteTable: Middleware = async (ctx) => {
-  try {
-    await TablesServices.deleteTable(ctx.state.restaurant.id, ctx.params.id);
-    ctx.status = 204;
-  } catch (e) {
+  try {} catch (e) {
     ctx.throw(400, e);
   }
