[Timeout] ObjectLiteral
Pichupido/src/tables/tables.queries.ts:5:20
 import { query } from '../libs/db';
 import { Table } from './tables.types';
 
-const tableProps = {
-  id: {},
-  restaurantId: { dbAlias: 'restaurant_id' },
-  url: {},
-  qrCodeUrl: { dbAlias: 'qr_code_url' },
-};
+const tableProps = {};
 
 export const getTableById = async(id: number): Promise<Table> => {

[Timeout] ObjectLiteral
Pichupido/src/tables/tables.queries.ts:7:17
 
 const tableProps = {
   id: {},
-  restaurantId: { dbAlias: 'restaurant_id' },
+  restaurantId: {},
   url: {},
   qrCodeUrl: { dbAlias: 'qr_code_url' },

[Killed] BlockStatement
Pichupido/src/tables/tables.queries.ts:12:66
   qrCodeUrl: { dbAlias: 'qr_code_url' },
 };
 
-export const getTableById = async(id: number): Promise<Table> => {
-  const selectClause = getSelectClause(tableProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM "Table"
-  WHERE id = $1
-  `, [id])).rows[0];
-}
+export const getTableById = async(id: number): Promise<Table> => {}
 
 export const getTableByRestaurant = async(restaurantId: number): Promise<Table[]> => {

[Killed] StringLiteral
Pichupido/src/tables/tables.queries.ts:14:23
 
 export const getTableById = async(id: number): Promise<Table> => {
   const selectClause = getSelectClause(tableProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM "Table"
-  WHERE id = $1
-  `, [id])).rows[0];
+  return (await query(``, [id])).rows[0];
 }
 

[Killed] BlockStatement
Pichupido/src/tables/tables.queries.ts:21:86
   `, [id])).rows[0];
 }
 
-export const getTableByRestaurant = async(restaurantId: number): Promise<Table[]> => {
-  const selectClause = getSelectClause(tableProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM "Table"
-  WHERE restaurant_id = $1
-  `, [restaurantId])).rows;
-}
+export const getTableByRestaurant = async(restaurantId: number): Promise<Table[]> => {}
 
 export const insertTable = async(restaurantId: number): Promise<number> => {

[Killed] StringLiteral
Pichupido/src/tables/tables.queries.ts:23:23
 
 export const getTableByRestaurant = async(restaurantId: number): Promise<Table[]> => {
   const selectClause = getSelectClause(tableProps);
-  return (await query(`
-  SELECT ${selectClause} 
-  FROM "Table"
-  WHERE restaurant_id = $1
-  `, [restaurantId])).rows;
+  return (await query(``, [restaurantId])).rows;
 }
 

[Killed] ArrayDeclaration
Pichupido/src/tables/tables.queries.ts:27:6
   SELECT ${selectClause} 
   FROM "Table"
   WHERE restaurant_id = $1
-  `, [restaurantId])).rows;
+  `, [])).rows;
 }
 

[Killed] BlockStatement
Pichupido/src/tables/tables.queries.ts:30:76
   `, [restaurantId])).rows;
 }
 
-export const insertTable = async(restaurantId: number): Promise<number> => {
-  const [props, values, valueIdxs] = getInsertClauses({ restaurantId }, tableProps);
-  return (await query(`
-  INSERT INTO "Table"(${props})
-  VALUES(${valueIdxs})
-  RETURNING *
-  `, values)).rows[0].id;
-}
+export const insertTable = async(restaurantId: number): Promise<number> => {}
 
 

[Killed] BlockStatement
Pichupido/src/tables/tables.queries.ts:40:96
 }
 
 
-export const setUrl = async(tableId: number, url: string, qrCodeUrl: string): Promise<void> => {
-  const [updateClause, values, nextIndx] = getUpdateClauses({ url, qrCodeUrl }, tableProps);
-  await query(`
-  UPDATE "Table" 
-  SET ${updateClause}
-  WHERE id = $${nextIndx}
-  `, [...values, tableId]);
-}
+export const setUrl = async(tableId: number, url: string, qrCodeUrl: string): Promise<void> => {}
 
 export const deleteTable = async(id: number): Promise<void> => {

[Killed] ObjectLiteral
Pichupido/src/tables/tables.queries.ts:41:61
 
 
 export const setUrl = async(tableId: number, url: string, qrCodeUrl: string): Promise<void> => {
-  const [updateClause, values, nextIndx] = getUpdateClauses({ url, qrCodeUrl }, tableProps);
+  const [updateClause, values, nextIndx] = getUpdateClauses({}, tableProps);
   await query(`
   UPDATE "Table" 

[Killed] BlockStatement
Pichupido/src/tables/tables.queries.ts:49:64
   `, [...values, tableId]);
 }
 
-export const deleteTable = async(id: number): Promise<void> => {
-  await query(`
-  DELETE FROM "Table"
-  WHERE id = $1
-  `, [id]);
-}
+export const deleteTable = async(id: number): Promise<void> => {}

[Killed] StringLiteral
Pichupido/src/tables/tables.queries.ts:50:15
 }
 
 export const deleteTable = async(id: number): Promise<void> => {
-  await query(`
-  DELETE FROM "Table"
-  WHERE id = $1
-  `, [id]);
+  await query(``, [id]);
 }
