[Killed] ArrowFunction
Pichupido/src/tables/tables.service.ts:6:24
 import { Table } from './tables.types';
 import { uploadImage, deleteImage } from '../utils/s3';
 
-const createTableUrl = (tableId: number, restaurantId: number) => (
-  `https://pichupido-user.herokuapp.com/restaurants/${restaurantId}?tableNumber=${tableId}`
-)
+const createTableUrl = () => undefined
 
 export const createTable = async (restaurantId: number): Promise<number> => {

[Killed] StringLiteral
Pichupido/src/tables/tables.service.ts:7:3
 import { uploadImage, deleteImage } from '../utils/s3';
 
 const createTableUrl = (tableId: number, restaurantId: number) => (
-  `https://pichupido-user.herokuapp.com/restaurants/${restaurantId}?tableNumber=${tableId}`
+  ``
 )
 

[Killed] BlockStatement
Pichupido/src/tables/tables.service.ts:10:77
   `https://pichupido-user.herokuapp.com/restaurants/${restaurantId}?tableNumber=${tableId}`
 )
 
-export const createTable = async (restaurantId: number): Promise<number> => {
-  const tableId = await queries.insertTable(restaurantId);
-  const url = createTableUrl(tableId, restaurantId);
-  const qrCode = await getQrCode(url);
-  const qrCodeUrl = await uploadImage(qrCode);
-
-  queries.setUrl(tableId, url, qrCodeUrl);
-
-  return tableId;
-}
+export const createTable = async (restaurantId: number): Promise<number> => {}
 
 export const getTable = async (id: number): Promise<Table> => {

[Killed] BlockStatement
Pichupido/src/tables/tables.service.ts:21:63
   return tableId;
 }
 
-export const getTable = async (id: number): Promise<Table> => {
-  const table = await queries.getTableById(id);
-  if (!table) {
-    throw('There is no table with this id');
-  }
-  return table;
-}
+export const getTable = async (id: number): Promise<Table> => {}
 
 export const getTablesByRestaurant = async (restaurantId: number): Promise<Table[]> => {

[Killed] ConditionalExpression
Pichupido/src/tables/tables.service.ts:23:7
 
 export const getTable = async (id: number): Promise<Table> => {
   const table = await queries.getTableById(id);
-  if (!table) {
+  if (false) {
     throw('There is no table with this id');
   }

[Killed] BooleanLiteral
Pichupido/src/tables/tables.service.ts:23:7
 
 export const getTable = async (id: number): Promise<Table> => {
   const table = await queries.getTableById(id);
-  if (!table) {
+  if (table) {
     throw('There is no table with this id');
   }

[Killed] BlockStatement
Pichupido/src/tables/tables.service.ts:29:88
   return table;
 }
 
-export const getTablesByRestaurant = async (restaurantId: number): Promise<Table[]> => {
-  return await queries.getTableByRestaurant(restaurantId);
-}
+export const getTablesByRestaurant = async (restaurantId: number): Promise<Table[]> => {}
 
 export const deleteTable = async(restaurantId: number, tableId: number): Promise<void> => {

[Killed] BlockStatement
Pichupido/src/tables/tables.service.ts:33:91
   return await queries.getTableByRestaurant(restaurantId);
 }
 
-export const deleteTable = async(restaurantId: number, tableId: number): Promise<void> => {
-  const currTable = await queries.getTableById(tableId);
-  if (!currTable) {
-    throw('There is no table with this id');
-  }
-  if (currTable.restaurantId !== restaurantId) {
-    throw('This table does not belong to your restaurant');
-  }
-  await deleteImage(currTable.qrCodeUrl);
-  await queries.deleteTable(tableId);
-}
+export const deleteTable = async(restaurantId: number, tableId: number): Promise<void> => {}
 

[Killed] BooleanLiteral
Pichupido/src/tables/tables.service.ts:35:7
 
 export const deleteTable = async(restaurantId: number, tableId: number): Promise<void> => {
   const currTable = await queries.getTableById(tableId);
-  if (!currTable) {
+  if (currTable) {
     throw('There is no table with this id');
   }

[Killed] ConditionalExpression
Pichupido/src/tables/tables.service.ts:35:7
 
 export const deleteTable = async(restaurantId: number, tableId: number): Promise<void> => {
   const currTable = await queries.getTableById(tableId);
-  if (!currTable) {
+  if (false) {
     throw('There is no table with this id');
   }

[Killed] ConditionalExpression
Pichupido/src/tables/tables.service.ts:38:7
   if (!currTable) {
     throw('There is no table with this id');
   }
-  if (currTable.restaurantId !== restaurantId) {
+  if (true) {
     throw('This table does not belong to your restaurant');
   }

[Killed] ConditionalExpression
Pichupido/src/tables/tables.service.ts:38:7
   if (!currTable) {
     throw('There is no table with this id');
   }
-  if (currTable.restaurantId !== restaurantId) {
+  if (false) {
     throw('This table does not belong to your restaurant');
   }
