[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:6:9
 const joi = Router.Joi;
 
 export const createTable: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Add table',
-      tags: ['tables'],
-    },
-  },
+  meta: {},
   validate: {
     output: {

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:7:14
 
 export const createTable: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Add table',
-      tags: ['tables'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] StringLiteral
Pichupido/src/tables/tables.validators.ts:9:14
   meta: {
     swagger: {
       summary: 'Add table',
-      tags: ['tables'],
+      tags: [""],
     },
   },

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:13:13
     },
   },
   validate: {
-    output: {
-      201: {
-        body: {
-          id: joi.number(),
-        },
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:29:9
 };
 
 export const getTable: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Get table by id',
-      tags: ['tables'],
-    },
-  },
+  meta: {},
   validate: {
     params: {

[Killed] StringLiteral
Pichupido/src/tables/tables.validators.ts:31:16
 export const getTable: Router.Config = {
   meta: {
     swagger: {
-      summary: 'Get table by id',
+      summary: "",
       tags: ['tables'],
     },

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:39:13
     params: {
       id: joi.number(),
     },
-    output: {
-      200: {
-        body: {
-          id: joi.number(),
-          restaurantId: joi.number(),
-          url: joi.string(),
-          qrCodeUrl: joi.string(),
-        },
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:41:15
     },
     output: {
       200: {
-        body: {
-          id: joi.number(),
-          restaurantId: joi.number(),
-          url: joi.string(),
-          qrCodeUrl: joi.string(),
-        },
+        body: {},
       },
       400: {

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:64:13
       tags: ['tables'],
     },
   },
-  validate: {
-    params: {
-      restaurantId: joi.number(),
-    },
-    output: {
-      200: {
-        body: joi.array().items({
-          id: joi.number(),
-          restaurantId: joi.number(),
-          url: joi.string(),
-          qrCodeUrl: joi.string(),
-        }),
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
-  },
+  validate: {},
 };
 

[Killed] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:68:13
     params: {
       restaurantId: joi.number(),
     },
-    output: {
-      200: {
-        body: joi.array().items({
-          id: joi.number(),
-          restaurantId: joi.number(),
-          url: joi.string(),
-          qrCodeUrl: joi.string(),
-        }),
-      },
-      400: {
-        body: {
-          error: joi.string(),
-        },
-      },
-    },
+    output: {},
   },
 };

[Timeout] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:87:9
 };
 
 export const deleteTable: Router.Config = {
-  meta: {
-    swagger: {
-      summary: 'Delete table',
-      tags: ['tables'],
-    },
-  },
+  meta: {},
   validate: {
     params: {

[Timeout] ObjectLiteral
Pichupido/src/tables/tables.validators.ts:88:14
 
 export const deleteTable: Router.Config = {
   meta: {
-    swagger: {
-      summary: 'Delete table',
-      tags: ['tables'],
-    },
+    swagger: {},
   },
   validate: {

[Killed] ArrayDeclaration
Pichupido/src/tables/tables.validators.ts:90:13
   meta: {
     swagger: {
       summary: 'Delete table',
-      tags: ['tables'],
+      tags: [],
     },
   },

[Killed] StringLiteral
Pichupido/src/tables/tables.validators.ts:90:14
   meta: {
     swagger: {
       summary: 'Delete table',
-      tags: ['tables'],
+      tags: [""],
     },
   },
