[Survived] BlockStatement
Pichupido/src/testing.utils/dbMock.ts:6:38
 export class DefaultDbMock<T, TData, TOptional> {
   units: T[] = [];
 
-  __setDbData = (data: T[]): void => {
-    this.units = data;
-  }
+  __setDbData = (data: T[]): void => {}
 
   selectOne = (predicate: (unit: T) => boolean): Promise<T> => {

[Survived] BlockStatement
Pichupido/src/testing.utils/dbMock.ts:10:64
     this.units = data;
   }
 
-  selectOne = (predicate: (unit: T) => boolean): Promise<T> => {
-    return new Promise((resolve) =>
-      resolve(this.units.find(predicate))
-    );
-  }
+  selectOne = (predicate: (unit: T) => boolean): Promise<T> => {}
 
   selectMany = (predicate: (unit: T) => boolean): Promise<T[]> => {

[Survived] ArrowFunction
Pichupido/src/testing.utils/dbMock.ts:11:24
   }
 
   selectOne = (predicate: (unit: T) => boolean): Promise<T> => {
-    return new Promise((resolve) =>
-      resolve(this.units.find(predicate))
+    return new Promise(() => undefined
     );
   }

[Survived] BlockStatement
Pichupido/src/testing.utils/dbMock.ts:16:67
     );
   }
 
-  selectMany = (predicate: (unit: T) => boolean): Promise<T[]> => {
-    return new Promise((resolve) =>
-      resolve(this.units.filter(predicate))
-    );
-  }
+  selectMany = (predicate: (unit: T) => boolean): Promise<T[]> => {}
 
   insert = (_unit: TData): Promise<number> => {

[Survived] ArrowFunction
Pichupido/src/testing.utils/dbMock.ts:17:24
   }
 
   selectMany = (predicate: (unit: T) => boolean): Promise<T[]> => {
-    return new Promise((resolve) =>
-      resolve(this.units.filter(predicate))
+    return new Promise(() => undefined
     );
   }

[Survived] BlockStatement
Pichupido/src/testing.utils/dbMock.ts:22:47
     );
   }
 
-  insert = (_unit: TData): Promise<number> => {
-    return new Promise((resolve) => resolve(this.units.length + 1));
-  }
+  insert = (_unit: TData): Promise<number> => {}
 
   update = (_unit: TOptional, _id: number): Promise<void> => {

[Survived] ArithmeticOperator
Pichupido/src/testing.utils/dbMock.ts:23:45
   }
 
   insert = (_unit: TData): Promise<number> => {
-    return new Promise((resolve) => resolve(this.units.length + 1));
+    return new Promise((resolve) => resolve(this.units.length - 1));
   }
 

[Survived] ArrowFunction
Pichupido/src/testing.utils/dbMock.ts:23:24
   }
 
   insert = (_unit: TData): Promise<number> => {
-    return new Promise((resolve) => resolve(this.units.length + 1));
+    return new Promise(() => undefined);
   }
 

[Survived] BlockStatement
Pichupido/src/testing.utils/dbMock.ts:26:62
     return new Promise((resolve) => resolve(this.units.length + 1));
   }
 
-  update = (_unit: TOptional, _id: number): Promise<void> => {
-    return new Promise((resolve) => resolve());
-  }
+  update = (_unit: TOptional, _id: number): Promise<void> => {}
 
   delete = (_id: number): Promise<void> => {

[Survived] ArrowFunction
Pichupido/src/testing.utils/dbMock.ts:27:24
   }
 
   update = (_unit: TOptional, _id: number): Promise<void> => {
-    return new Promise((resolve) => resolve());
+    return new Promise(() => undefined);
   }
 

[Survived] BlockStatement
Pichupido/src/testing.utils/dbMock.ts:30:44
     return new Promise((resolve) => resolve());
   }
 
-  delete = (_id: number): Promise<void> => {
-    return new Promise((resolve) => resolve());
-  }
+  delete = (_id: number): Promise<void> => {}
 }
 

[Survived] ArrowFunction
Pichupido/src/testing.utils/dbMock.ts:31:24
   }
 
   delete = (_id: number): Promise<void> => {
-    return new Promise((resolve) => resolve());
+    return new Promise(() => undefined);
   }
 }
