[Killed] BlockStatement
Pichupido/src/testing.utils/tempResCreator.ts:9:28
 export class TemporaryResourseCreator {
   server: Koa;
 
-  constructor(server: Koa) {
-    this.server = server;
-  }
+  constructor(server: Koa) {}
 
 

[Killed] StringLiteral
Pichupido/src/testing.utils/tempResCreator.ts:16:22
 
   signIn = async (): Promise<string[]> => {
     const user = uuidv4();
-    const password = 'qwerty12345!'
+    const password = ""
     const email = `${user}@example.com`;
 

[Killed] StringLiteral
Pichupido/src/testing.utils/tempResCreator.ts:27:19
         password,
         confirmPassword: password,
         firstName: 'Ivan',
-        lastName: 'Petrenko',
+        lastName: "",
         role: 'admin'
       });

[Killed] ObjectLiteral
Pichupido/src/testing.utils/tempResCreator.ts:33:13
     const signInResponse = await request(this.server.callback())
       .post('/accounts/sign-in')
       .type('json')
-      .send({
-        email,
-        password,
-      });
+      .send({});
 
     const cookies = signInResponse.get('Set-Cookie');

[Killed] BlockStatement
Pichupido/src/testing.utils/tempResCreator.ts:42:59
     return cookies;
   };
 
-  deleteAcc = async (cookies: string[]): Promise<void> => {
-    await request(this.server.callback())
-      .delete('/accounts/profile')
-      .set('Cookie', cookies);
-  };
+  deleteAcc = async (cookies: string[]): Promise<void> => {};
 
   createRestaurant = async (cookies: string[]): Promise<number> => {

[Killed] StringLiteral
Pichupido/src/testing.utils/tempResCreator.ts:44:15
 
   deleteAcc = async (cookies: string[]): Promise<void> => {
     await request(this.server.callback())
-      .delete('/accounts/profile')
+      .delete("")
       .set('Cookie', cookies);
   };

[Killed] BlockStatement
Pichupido/src/testing.utils/tempResCreator.ts:48:68
       .set('Cookie', cookies);
   };
 
-  createRestaurant = async (cookies: string[]): Promise<number> => {
-    const restaurant = {
-      name: 'Restaurant',
-      logo: goodImg,
-      cover: goodImg,
-      workingHours: '15:00 - 23:00',
-      location: 'Kyiv',
-      description: 'Beautiful spot, good food'
-    };
-
-    const responsePost = await request(this.server.callback())
-      .post('/restaurants')
-      .type('json')
-      .set('Cookie', cookies)
-      .send(restaurant);
-
-    const { id } = responsePost.body;
-    return id;
-  };
+  createRestaurant = async (cookies: string[]): Promise<number> => {};
 
   deleteRestaurant = async (cookies: string[], id: number): Promise<void> => {

[Killed] StringLiteral
Pichupido/src/testing.utils/tempResCreator.ts:54:17
       logo: goodImg,
       cover: goodImg,
       workingHours: '15:00 - 23:00',
-      location: 'Kyiv',
+      location: "",
       description: 'Beautiful spot, good food'
     };

[Timeout] BlockStatement
Pichupido/src/testing.utils/tempResCreator.ts:68:78
     return id;
   };
 
-  deleteRestaurant = async (cookies: string[], id: number): Promise<void> => {
-    await request(this.server.callback())
-      .delete(`/restaurants/${id}`)
-      .set('Cookie', cookies);
-  }
+  deleteRestaurant = async (cookies: string[], id: number): Promise<void> => {}
 }
 

[Timeout] StringLiteral
Pichupido/src/testing.utils/tempResCreator.ts:70:15
 
   deleteRestaurant = async (cookies: string[], id: number): Promise<void> => {
     await request(this.server.callback())
-      .delete(`/restaurants/${id}`)
+      .delete(``)
       .set('Cookie', cookies);
   }
