[Timeout] BlockStatement
Pichupido/src/tokens/index.ts:13:49
 
 const jwtConf: JwtConfig = config.get('tokens');
 
-const generateAccessToken = (userId: number) => {
-  const payload = {
-    userId,
-    type: ACCESS_TOKEN,
-  };
-  const options = { expiresIn: jwtConf.accessExpiresIn };
-  return jwt.sign(payload, jwtConf.accessSecret, options);
-};
+const generateAccessToken = (userId: number) => {};
 
 const generateRefreshToken = (userId: number) => {

[Timeout] BlockStatement
Pichupido/src/tokens/index.ts:22:50
   return jwt.sign(payload, jwtConf.accessSecret, options);
 };
 
-const generateRefreshToken = (userId: number) => {
-  const tokenId = uuidv4().toString();
-  const payload = {
-    type: REFRESH_TOKEN,
-    tokenId,
-    userId,
-  };
-  const options = { expiresIn: jwtConf.refreshExpiresIn };
-  return {
-    refreshToken: jwt.sign(payload, jwtConf.refreshSecret, options),
-    tokenId,
-  };
-};
+const generateRefreshToken = (userId: number) => {};
 
 export const createAndUpdateTokens = async (userId: number): Promise<Tokens> => {

[Timeout] ObjectLiteral
Pichupido/src/tokens/index.ts:24:19
 
 const generateRefreshToken = (userId: number) => {
   const tokenId = uuidv4().toString();
-  const payload = {
-    type: REFRESH_TOKEN,
-    tokenId,
-    userId,
-  };
+  const payload = {};
   const options = { expiresIn: jwtConf.refreshExpiresIn };
   return {

[Timeout] ObjectLiteral
Pichupido/src/tokens/index.ts:29:19
     tokenId,
     userId,
   };
-  const options = { expiresIn: jwtConf.refreshExpiresIn };
+  const options = {};
   return {
     refreshToken: jwt.sign(payload, jwtConf.refreshSecret, options),

[Killed] ObjectLiteral
Pichupido/src/tokens/index.ts:30:10
     userId,
   };
   const options = { expiresIn: jwtConf.refreshExpiresIn };
-  return {
-    refreshToken: jwt.sign(payload, jwtConf.refreshSecret, options),
-    tokenId,
-  };
+  return {};
 };
 

[Killed] BlockStatement
Pichupido/src/tokens/index.ts:36:81
   };
 };
 
-export const createAndUpdateTokens = async (userId: number): Promise<Tokens> => {
-  try {
-    const accessToken = generateAccessToken(userId);
-    const { tokenId, refreshToken } = generateRefreshToken(userId);
-    const tokenFromDb = queries.getToken(userId);
-    const token = { userId, tokenId, updatedAt: new Date() };
-    if (tokenFromDb) {
-      await queries.updateToken(token);
-    } else {
-      await queries.insertToken(token);
-    }
-    return {
-      refreshToken,
-      accessToken,
-    };
-  } catch (e) {
-    throw Error(e.message);
-  }
-};
+export const createAndUpdateTokens = async (userId: number): Promise<Tokens> => {};
 

[Killed] BlockStatement
Pichupido/src/tokens/index.ts:37:7
 };
 
 export const createAndUpdateTokens = async (userId: number): Promise<Tokens> => {
-  try {
-    const accessToken = generateAccessToken(userId);
-    const { tokenId, refreshToken } = generateRefreshToken(userId);
-    const tokenFromDb = queries.getToken(userId);
-    const token = { userId, tokenId, updatedAt: new Date() };
-    if (tokenFromDb) {
-      await queries.updateToken(token);
-    } else {
-      await queries.insertToken(token);
-    }
-    return {
-      refreshToken,
-      accessToken,
-    };
-  } catch (e) {
+  try {} catch (e) {
     throw Error(e.message);
   }

[Killed] ConditionalExpression
Pichupido/src/tokens/index.ts:42:9
     const { tokenId, refreshToken } = generateRefreshToken(userId);
     const tokenFromDb = queries.getToken(userId);
     const token = { userId, tokenId, updatedAt: new Date() };
-    if (tokenFromDb) {
+    if (true) {
       await queries.updateToken(token);
     } else {

[Killed] ConditionalExpression
Pichupido/src/tokens/index.ts:42:9
     const { tokenId, refreshToken } = generateRefreshToken(userId);
     const tokenFromDb = queries.getToken(userId);
     const token = { userId, tokenId, updatedAt: new Date() };
-    if (tokenFromDb) {
+    if (false) {
       await queries.updateToken(token);
     } else {

[Killed] BlockStatement
Pichupido/src/tokens/index.ts:44:12
     const token = { userId, tokenId, updatedAt: new Date() };
     if (tokenFromDb) {
       await queries.updateToken(token);
-    } else {
-      await queries.insertToken(token);
-    }
+    } else {}
     return {
       refreshToken,

[Killed] ObjectLiteral
Pichupido/src/tokens/index.ts:47:12
     } else {
       await queries.insertToken(token);
     }
-    return {
-      refreshToken,
-      accessToken,
-    };
+    return {};
   } catch (e) {
     throw Error(e.message);

[Killed] BlockStatement
Pichupido/src/tokens/index.ts:51:15
       refreshToken,
       accessToken,
     };
-  } catch (e) {
-    throw Error(e.message);
-  }
+  } catch (e) {}
 };
 
