[Killed] ObjectLiteral
Pichupido/src/tokens/tokens.queries.ts:6:12
 import { Token } from './tokens.types';
 
 const tokenProps = {
-  tokenId: { dbAlias: 'id' },
+  tokenId: {},
   updatedAt: { dbAlias: 'updated_at' }
 };

[Killed] StringLiteral
Pichupido/src/tokens/tokens.queries.ts:6:23
 import { Token } from './tokens.types';
 
 const tokenProps = {
-  tokenId: { dbAlias: 'id' },
+  tokenId: { dbAlias: "" },
   updatedAt: { dbAlias: 'updated_at' }
 };

[Killed] StringLiteral
Pichupido/src/tokens/tokens.queries.ts:7:25
 
 const tokenProps = {
   tokenId: { dbAlias: 'id' },
-  updatedAt: { dbAlias: 'updated_at' }
+  updatedAt: { dbAlias: "" }
 };
 

[Killed] ObjectLiteral
Pichupido/src/tokens/tokens.queries.ts:7:14
 
 const tokenProps = {
   tokenId: { dbAlias: 'id' },
-  updatedAt: { dbAlias: 'updated_at' }
+  updatedAt: {}
 };
 

[Killed] StringLiteral
Pichupido/src/tokens/tokens.queries.ts:11:22
 };
 
 const tokenIdProp = {
-  userId: { dbAlias: 'user_id' },
+  userId: { dbAlias: "" },
 };
 

[Killed] ObjectLiteral
Pichupido/src/tokens/tokens.queries.ts:14:24
   userId: { dbAlias: 'user_id' },
 };
 
-const fullTokenProps = { ...tokenProps, ...tokenIdProp };
+const fullTokenProps = {};
 
 export async function getToken(userId: number): Promise<Token> {

[Killed] BlockStatement
Pichupido/src/tokens/tokens.queries.ts:16:64
 
 const fullTokenProps = { ...tokenProps, ...tokenIdProp };
 
-export async function getToken(userId: number): Promise<Token> {
-  const selectClause = getSelectClause(fullTokenProps)
-  return (await query(`
-    SELECT 
-      ${selectClause}
-    FROM Token WHERE user_id=$1`,
-    [userId])
-  ).rows[0];
-}
+export async function getToken(userId: number): Promise<Token> {}
 
 export async function updateToken({ userId, tokenId, updatedAt }: Token): Promise<void> {

[Killed] BlockStatement
Pichupido/src/tokens/tokens.queries.ts:26:89
   ).rows[0];
 }
 
-export async function updateToken({ userId, tokenId, updatedAt }: Token): Promise<void> {
-  const [updateClause, values, nextIndx] = getUpdateClauses({ tokenId, updatedAt }, tokenProps);
-  await query(`
-    UPDATE Token
-    SET 
-      ${updateClause}
-    WHERE user_id = $${nextIndx}`,
-    [...values, userId]
-  );
-}
+export async function updateToken({ userId, tokenId, updatedAt }: Token): Promise<void> {}
 
 export async function insertToken(token: Token): Promise<void> {

[Killed] ObjectLiteral
Pichupido/src/tokens/tokens.queries.ts:27:61
 }
 
 export async function updateToken({ userId, tokenId, updatedAt }: Token): Promise<void> {
-  const [updateClause, values, nextIndx] = getUpdateClauses({ tokenId, updatedAt }, tokenProps);
+  const [updateClause, values, nextIndx] = getUpdateClauses({}, tokenProps);
   await query(`
     UPDATE Token

[Killed] BlockStatement
Pichupido/src/tokens/tokens.queries.ts:37:64
   );
 }
 
-export async function insertToken(token: Token): Promise<void> {
-  const [props, values, valueIdxs] = getInsertClauses(token, fullTokenProps)
-  await query(`
-    INSERT INTO Token(${props})
-    VALUES (${valueIdxs})`,
-    values
-  );
-}
+export async function insertToken(token: Token): Promise<void> {}
 
