[Survived] StringLiteral
src/utils/__mocks__/s3.ts:3:27
 /* eslint-disable @typescript-eslint/no-unused-vars */
 
-export const defaultUrl = 'https://pichupido.s3.eu-north-1.amazonaws.com/7609305c-4979-44fe-be57-7c336bd7f6ac.png';
+export const defaultUrl = "";
 
 export const deleteImage = async (_url: string): Promise<void> => {

[Survived] BlockStatement
src/utils/__mocks__/s3.ts:5:67
 
 export const defaultUrl = 'https://pichupido.s3.eu-north-1.amazonaws.com/7609305c-4979-44fe-be57-7c336bd7f6ac.png';
 
-export const deleteImage = async (_url: string): Promise<void> => {
-  return;
-}
+export const deleteImage = async (_url: string): Promise<void> => {}
 
 export const uploadImage = async (_photo: string): Promise<string> => {

[Survived] BlockStatement
src/utils/__mocks__/s3.ts:9:71
   return;
 }
 
-export const uploadImage = async (_photo: string): Promise<string> => {
-  return defaultUrl;
-};
+export const uploadImage = async (_photo: string): Promise<string> => {};
 
