[Killed] ArrowFunction
Pichupido/src/utils/checkImg.ts:3:42
 import Jimp from 'jimp';
 
-const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
-  img.bitmap.height >= 128
-  && img.bitmap.height <= 1024
-  && img.bitmap.width >= 128
-  && img.bitmap.height <= 1024
-  && (byteLength / 1e6) <= 1
-  && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
+const checkHeightWidthSizeAndExtension = () => undefined;
 
 export const checkImage = async (imgBuffer: string): Promise<boolean> => {

[Killed] LogicalOperator
Pichupido/src/utils/checkImg.ts:4:3
 import Jimp from 'jimp';
 
 const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
-  img.bitmap.height >= 128
-  && img.bitmap.height <= 1024
-  && img.bitmap.width >= 128
-  && img.bitmap.height <= 1024
+  img.bitmap.height >= 128 && img.bitmap.height <= 1024 && img.bitmap.width >= 128 || img.bitmap.height <= 1024
   && (byteLength / 1e6) <= 1
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));

[Killed] LogicalOperator
Pichupido/src/utils/checkImg.ts:4:3
 import Jimp from 'jimp';
 
 const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
-  img.bitmap.height >= 128
-  && img.bitmap.height <= 1024
+  img.bitmap.height >= 128 || img.bitmap.height <= 1024
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024

[Killed] EqualityOperator
Pichupido/src/utils/checkImg.ts:5:6
 
 const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
   img.bitmap.height >= 128
-  && img.bitmap.height <= 1024
+  && img.bitmap.height > 1024
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024

[Killed] EqualityOperator
Pichupido/src/utils/checkImg.ts:5:6
 
 const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
   img.bitmap.height >= 128
-  && img.bitmap.height <= 1024
+  && img.bitmap.height < 1024
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024

[Killed] ConditionalExpression
Pichupido/src/utils/checkImg.ts:6:6
 const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
   img.bitmap.height >= 128
   && img.bitmap.height <= 1024
-  && img.bitmap.width >= 128
+  && false
   && img.bitmap.height <= 1024
   && (byteLength / 1e6) <= 1

[Killed] EqualityOperator
Pichupido/src/utils/checkImg.ts:6:6
 const checkHeightWidthSizeAndExtension = (img: Jimp, byteLength: number) => (
   img.bitmap.height >= 128
   && img.bitmap.height <= 1024
-  && img.bitmap.width >= 128
+  && img.bitmap.width < 128
   && img.bitmap.height <= 1024
   && (byteLength / 1e6) <= 1

[Killed] ConditionalExpression
Pichupido/src/utils/checkImg.ts:7:6
   img.bitmap.height >= 128
   && img.bitmap.height <= 1024
   && img.bitmap.width >= 128
-  && img.bitmap.height <= 1024
+  && false
   && (byteLength / 1e6) <= 1
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));

[Killed] ConditionalExpression
Pichupido/src/utils/checkImg.ts:7:6
   img.bitmap.height >= 128
   && img.bitmap.height <= 1024
   && img.bitmap.width >= 128
-  && img.bitmap.height <= 1024
+  && true
   && (byteLength / 1e6) <= 1
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));

[Killed] ConditionalExpression
Pichupido/src/utils/checkImg.ts:8:6
   && img.bitmap.height <= 1024
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024
-  && (byteLength / 1e6) <= 1
+  && true
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
 

[Killed] ConditionalExpression
Pichupido/src/utils/checkImg.ts:8:6
   && img.bitmap.height <= 1024
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024
-  && (byteLength / 1e6) <= 1
+  && false
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
 

[Killed] StringLiteral
Pichupido/src/utils/checkImg.ts:9:7
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024
   && (byteLength / 1e6) <= 1
-  && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
+  && ["", 'jpeg', 'jpg'].includes(img.getExtension()));
 
 export const checkImage = async (imgBuffer: string): Promise<boolean> => {

[Killed] StringLiteral
Pichupido/src/utils/checkImg.ts:9:22
   && img.bitmap.width >= 128
   && img.bitmap.height <= 1024
   && (byteLength / 1e6) <= 1
-  && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
+  && ['png', 'jpeg', ""].includes(img.getExtension()));
 
 export const checkImage = async (imgBuffer: string): Promise<boolean> => {

[Killed] BlockStatement
Pichupido/src/utils/checkImg.ts:11:74
   && (byteLength / 1e6) <= 1
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
 
-export const checkImage = async (imgBuffer: string): Promise<boolean> => {
-  const base64Data = Buffer.from(imgBuffer.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
-  try {
-    const img = await Jimp.read(base64Data);
-    return checkHeightWidthSizeAndExtension(img, base64Data.length); 
-  } catch (error) {
-    return false
-  }
-};
+export const checkImage = async (imgBuffer: string): Promise<boolean> => {};
 

[Killed] StringLiteral
Pichupido/src/utils/checkImg.ts:12:82
   && ['png', 'jpeg', 'jpg'].includes(img.getExtension()));
 
 export const checkImage = async (imgBuffer: string): Promise<boolean> => {
-  const base64Data = Buffer.from(imgBuffer.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
+  const base64Data = Buffer.from(imgBuffer.replace(/^ ?data:image\/\w+;base64,/, "Stryker was here!"), 'base64');
   try {
     const img = await Jimp.read(base64Data);

[Timeout] BlockStatement
Pichupido/src/utils/checkImg.ts:13:7
 
 export const checkImage = async (imgBuffer: string): Promise<boolean> => {
   const base64Data = Buffer.from(imgBuffer.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
-  try {
-    const img = await Jimp.read(base64Data);
-    return checkHeightWidthSizeAndExtension(img, base64Data.length); 
-  } catch (error) {
+  try {} catch (error) {
     return false
   }

[Timeout] BlockStatement
Pichupido/src/utils/checkImg.ts:16:19
   try {
     const img = await Jimp.read(base64Data);
     return checkHeightWidthSizeAndExtension(img, base64Data.length); 
-  } catch (error) {
-    return false
-  }
+  } catch (error) {}
 };
 

[Timeout] BooleanLiteral
Pichupido/src/utils/checkImg.ts:17:12
     const img = await Jimp.read(base64Data);
     return checkHeightWidthSizeAndExtension(img, base64Data.length); 
   } catch (error) {
-    return false
+    return true
   }
 };
