[Killed] BlockStatement
Pichupido/src/utils/s3.ts:14:66
   region: 'eu-north-1',
 });
 
-export const deleteImage = async (url: string): Promise<void> => {
-  const name = url
-    .split('/').pop();
-  if (!name) throw new Error('Invalid image url');
-  const params: DeleteObjectRequest = {
-    Bucket: s3conf.bucketName,
-    Key: name,
-  }
-  await s3.deleteObject(params).promise();
-}
+export const deleteImage = async (url: string): Promise<void> => {}
 
 export const uploadImage = async (photo: string): Promise<string> => {

[Killed] StringLiteral
Pichupido/src/utils/s3.ts:16:12
 
 export const deleteImage = async (url: string): Promise<void> => {
   const name = url
-    .split('/').pop();
+    .split("").pop();
   if (!name) throw new Error('Invalid image url');
   const params: DeleteObjectRequest = {

[Killed] ConditionalExpression
Pichupido/src/utils/s3.ts:17:7
 export const deleteImage = async (url: string): Promise<void> => {
   const name = url
     .split('/').pop();
-  if (!name) throw new Error('Invalid image url');
+  if (true) throw new Error('Invalid image url');
   const params: DeleteObjectRequest = {
     Bucket: s3conf.bucketName,

[Killed] ConditionalExpression
Pichupido/src/utils/s3.ts:17:7
 export const deleteImage = async (url: string): Promise<void> => {
   const name = url
     .split('/').pop();
-  if (!name) throw new Error('Invalid image url');
+  if (false) throw new Error('Invalid image url');
   const params: DeleteObjectRequest = {
     Bucket: s3conf.bucketName,

[Killed] BlockStatement
Pichupido/src/utils/s3.ts:25:70
   await s3.deleteObject(params).promise();
 }
 
-export const uploadImage = async (photo: string): Promise<string> => {
-  try {
-    const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
-    const type = photo.split(';')[0].split('/')[1] || 'png';
-    const name = uuidv4();
-    const uploadParams = {
-      Bucket: s3conf.bucketName,
-      Key: `${name}.${type}`,
-      Body: base64Data,
-      ACL: 'public-read',
-      ContentEncoding: 'base64',
-      ContentType: `image/${type}`,
-    };
-    const { Location } = await s3.upload(uploadParams)
-      .promise();
-    return Location;
-  } catch (error) {
-    throw new Error(error.message);
-  }
-};
+export const uploadImage = async (photo: string): Promise<string> => {};
 

[Killed] BlockStatement
Pichupido/src/utils/s3.ts:26:7
 }
 
 export const uploadImage = async (photo: string): Promise<string> => {
-  try {
-    const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
-    const type = photo.split(';')[0].split('/')[1] || 'png';
-    const name = uuidv4();
-    const uploadParams = {
-      Bucket: s3conf.bucketName,
-      Key: `${name}.${type}`,
-      Body: base64Data,
-      ACL: 'public-read',
-      ContentEncoding: 'base64',
-      ContentType: `image/${type}`,
-    };
-    const { Location } = await s3.upload(uploadParams)
-      .promise();
-    return Location;
-  } catch (error) {
+  try {} catch (error) {
     throw new Error(error.message);
   }

[Killed] StringLiteral
Pichupido/src/utils/s3.ts:27:80
 
 export const uploadImage = async (photo: string): Promise<string> => {
   try {
-    const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
+    const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, "Stryker was here!"), 'base64');
     const type = photo.split(';')[0].split('/')[1] || 'png';
     const name = uuidv4();

[Killed] StringLiteral
Pichupido/src/utils/s3.ts:27:85
 
 export const uploadImage = async (photo: string): Promise<string> => {
   try {
-    const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
+    const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), "");
     const type = photo.split(';')[0].split('/')[1] || 'png';
     const name = uuidv4();

[Killed] ConditionalExpression
Pichupido/src/utils/s3.ts:28:18
 export const uploadImage = async (photo: string): Promise<string> => {
   try {
     const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
-    const type = photo.split(';')[0].split('/')[1] || 'png';
+    const type = false;
     const name = uuidv4();
     const uploadParams = {

[Killed] ConditionalExpression
Pichupido/src/utils/s3.ts:28:18
 export const uploadImage = async (photo: string): Promise<string> => {
   try {
     const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
-    const type = photo.split(';')[0].split('/')[1] || 'png';
+    const type = true;
     const name = uuidv4();
     const uploadParams = {

[Killed] ObjectLiteral
Pichupido/src/utils/s3.ts:30:26
     const base64Data = Buffer.from(photo.replace(/^ ?data:image\/\w+;base64,/, ''), 'base64');
     const type = photo.split(';')[0].split('/')[1] || 'png';
     const name = uuidv4();
-    const uploadParams = {
-      Bucket: s3conf.bucketName,
-      Key: `${name}.${type}`,
-      Body: base64Data,
-      ACL: 'public-read',
-      ContentEncoding: 'base64',
-      ContentType: `image/${type}`,
-    };
+    const uploadParams = {};
     const { Location } = await s3.upload(uploadParams)
       .promise();

[Killed] BlockStatement
Pichupido/src/utils/s3.ts:41:19
     const { Location } = await s3.upload(uploadParams)
       .promise();
     return Location;
-  } catch (error) {
-    throw new Error(error.message);
-  }
+  } catch (error) {}
 };
 
